{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sylvie Corbet | AP", "title": "French summit aims to boost counterterror fight in W. Africa", "description": "France is preparing its military to better target Islamic extremists in a West African region that has seen a surge of deadly violence", "url": "https://www.washingtonpost.com/world/africa/french-summit-aims-to-boost-counterterror-fight-in-w-africa/2020/01/13/b42b5044-35e2-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T08:57:19Z", "content": "France, which once colonized much of West Africa, has some 4,500 troops in the sprawling Sahel region and has been accused by some residents of failing to stabilize it. Some in Mali, which has struggled for close to a decade with extremism, have protested the… [+3326 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Left-wing Israeli parties unite ahead of March election", "description": "Israel's main left-parties have announced they will run on a single ticket in the upcoming March 2 election", "url": "https://www.washingtonpost.com/world/middle_east/left-wing-israeli-parties-unite-ahead-of-march-election/2020/01/13/c7e7ea0a-35df-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T08:36:24Z", "content": "Labor Party chairman Amir Peretz will lead the joint list, followed by Orly Levy-Abekasis and then Meretz leader Nitzan Horowitz.\r\nLevy-Abekasis, who heads the more centrist Gesher faction, said on Monday that it was merely a technical union dictated by reali… [+511 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Graffiti painted on Copenhagen's Little Mermaid statue", "description": "Copenhagen's famed Little Mermaid statue was found doused with graffiti early Monday with three lines in red, reading \"Free Hong-Kong\" scribbled on the rock on which the bronze sits, next to the same text in white", "url": "https://www.washingtonpost.com/world/europe/graffiti-painted-on-copenhagens-little-mermaid-statue/2020/01/13/58a1073a-35df-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T08:33:17Z", "content": "The Little Mermaid was created in tribute to the Danish storyteller Hans Christian Andersen. Sitting on a rock at the entrance of the Copenhagen harbor since 1913, she has been a popular target for vandals, who have blown her off her perch, beheaded her and p… [+275 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Regine Cabato", "title": "Taal volcano eruption forces thousands to seek safer ground in the Philippines", "description": "Clouds of ash drifted across the country as many people evacuated their homes and authorities warned of increasing danger.", "url": "https://www.washingtonpost.com/world/asia_pacific/taal-volcano-eruption-forces-thousands-to-seek-safer-ground-in-the-philippines/2020/01/13/4e2680f8-35cd-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/qXaP-X8HWCNK8HYbKANuLFhWzYw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TUBCNJBV3UI6VFKBSEDTANEBUQ.jpg", "publishedAt": "2020-01-13T08:21:46Z", "content": "Thousands have sought safer ground as the Taal volcano erupts for the first time since 1977, blowing clouds of ash as far away as Manila, 60 miles to the north. Officials have warned the volcano, which sits on an island in a lake and is among the Philippines … [+3548 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Glenn Kessler", "title": "Mr. President, here’s how the budget works", "description": "The president said tax revenue is up because of economic growth spurred by his tax cut. That reflects a basic misunderstanding.", "url": "https://www.washingtonpost.com/politics/2020/01/13/mr-president-heres-how-budget-works/", "urlToImage": "https://www.washingtonpost.com/resizer/1rKFQaJV3e32oqSbSxoAkd_33mo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7ZBWQSRUGYI6VFY3IO7MH74YMA.jpg", "publishedAt": "2020-01-13T08:00:49Z", "content": "Here, the president makes a basic mistake. He asserts that even though he signed into law a bill cutting taxes in 2017, revenue has kept going up a fact he attributes to a robust economy. Some listeners might even have gotten the impression that the tax cuts … [+6372 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Jae C. Hong | AP", "title": "AP PHOTOS: Japan honors young adults on Coming of Age Day", "description": "Japan is celebrating Coming of Age Day, a centuries-old tradition and national holiday to honor those who have turned 20 over the past year", "url": "https://www.washingtonpost.com/world/asia_pacific/ap-photos-japan-honors-young-adults-on-coming-of-age-day/2020/01/13/48a3e0b4-35da-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T07:57:03Z", "content": "Tokyo Disneyland is among the most popular locations for the celebration, with hundreds of participants greeted by Mickey and Minnie Mouse. Some even get high-fives from them.\r\nThe ceremonies last less than an hour, but with the participants being part of the… [+225 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "China auto sales fall again in 2019 amid trade war", "description": "China's auto sales fell for a second year in 2019 as a trade war with Washington fueled consumer anxiety and demand for electric vehicles weakened", "url": "https://www.washingtonpost.com/world/asia_pacific/china-auto-sales-fall-again-in-2019-amid-trade-war/2020/01/13/29f7f272-35da-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T07:56:11Z", "content": "The downturn is squeezing global and Chinese automakers at a time when they are spending billions of dollars to meet government targets to sell electric vehicles.\r\nAfter two decades of explosive growth, China suffered its first annual decline in auto sales in… [+1006 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Tameem Akhgar and Abdul Sattar | AP", "title": "Severe weather in Afghanistan, Pakistan leaves 43 dead", "description": "Severe winter weather has struck parts of Afghanistan and Pakistan, with heavy snowfall, rains and flash floods that left at least 43 dead", "url": "https://www.washingtonpost.com/world/asia_pacific/severe-weather-in-afghanistan-pakistan-leaves-43-dead/2020/01/13/ff362b98-35d5-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T07:26:22Z", "content": "Heavy snowfall had forced closures of many highways and some parts in the province were under six inches of snow. Eleven people were killed in eastern Punjab province when their roofs caved in under strong rains, said Abdul Sattar, an official with the state-… [+1122 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Moscow to host meeting of Libya's rival leaders", "description": "The Russian Foreign Ministry says Libya's rival leaders will meet in Moscow for peace talks", "url": "https://www.washingtonpost.com/world/africa/moscow-to-host-meeting-of-libyas-rival-leaders/2020/01/13/f85f504c-35d5-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T07:26:10Z", "content": "The truce came as Libyas civil war was on the brink of a major escalation. Various foreign players back Libyas two rival governments, and they have recently been stepping up their involvement in the oil-rich nations conflict.\r\nThe eastern government is suppor… [+446 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Tom Odula | AP", "title": "Al-Shabab militants kill 3 teachers in Kenya, abduct 1", "description": "A police report say- al-Qaida-linked al-Shabab militants killed three non-Muslim teachers and kidnapped a Muslim teacher at Kamuthe center in Kenya's Garissa county", "url": "https://www.washingtonpost.com/world/africa/al-shabab-militants-kill-3-teachers-in-kenya-abduct-1/2020/01/13/4f76a550-35cd-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-13T06:24:11Z", "content": "Three non-Muslim teachers were killed and one teacher was abducted, the report said. They spared the life of a female nurse due to her gender, it added.\r\nAl-Shabab has vowed retribution on Kenya for its troops being present in Somalia since 2011 to fight the … [+387 chars]"}]}