{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Yuri Kageyama | AP", "title": "Ghosn's lawyer slams minister's gaffe on proving innocence", "description": "A lawyer for Carlos Ghosn, Nissan's former chairman who skipped bail in Japan and fled to Lebanon, has slammed a gaffe by the Japanese justice minister who said that Ghosn should \"prove\" his innocence", "url": "https://www.washingtonpost.com/world/asia_pacific/ghosns-lawyer-slams-ministers-gaffe-on-proving-innocence/2020/01/10/1a50186a-3385-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T08:42:16Z", "content": "Mori has apologized for the error and said she meant to say the suspect should assert innocence, not prove it.\r\nThe presumption of innocence, respect of dignity and rights of defense have been essential components of what constitute a fair trial, he said.\r\nJa… [+1001 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Iran official denies missile hit Ukrainian plane; calls on US, Canada to release data backing missile-strike allegation", "description": "Iran official denies missile hit Ukrainian plane; calls on US, Canada to release data backing missile-strike allegation", "url": "https://www.washingtonpost.com/world/europe/iran-official-denies-missile-hit-ukrainian-plane-calls-on-us-canada-to-release-data-backing-missile-strike-allegation/2020/01/10/04cc1898-3382-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T08:20:11Z", "content": "TEHRAN, Iran Iran official denies missile hit Ukrainian plane; calls on US, Canada to release data backing missile-strike allegation.\r\nCopyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redist… [+7 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Jon Gambrell | AP", "title": "Crash may be grim echo of US downing of Iran flight in 1988", "description": "The Western allegation that Iran shot down a Ukrainian jetliner and killed 176 people offers a grim echo for the Islamic Republic, which found itself the victim of an accidental shootdown by American forces over 30 years ago", "url": "https://www.washingtonpost.com/world/middle_east/crash-may-be-grim-echo-of-us-downing-of-iran-flight-in-1988/2020/01/10/205f3286-3380-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T08:06:38Z", "content": "As recently as last week, Iranian President Hassan Rouhani referenced the attack in criticizing President Donald Trumps comments that U.S. forces had picked out 52 targets to be attacked in Iran if needed, one for each of the American hostages held after the … [+4242 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Salvador Rizzo", "title": "Elizabeth Warren’s false claim that the filibuster stopped immigration reform", "description": "The Senate passed a comprehensive immigration bill with a filibuster-proof majority in 2013. Warren was among the 68 senators who voted yes.", "url": "https://www.washingtonpost.com/politics/2020/01/10/elizabeth-warrens-false-claim-that-filibuster-stopped-immigration-reform/", "urlToImage": "https://www.washingtonpost.com/resizer/5vZTXbjE0zdXfDTd35VH0TFZ7As=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ESW6OXRRZ4I6VFY3IO7MH74YMA.jpg", "publishedAt": "2020-01-10T08:00:28Z", "content": "Sen. Elizabeth Warren (D-Mass.), at a town hall campaign event in Des Moines, Dec. 28, 2019\r\nSo long as we have a filibuster, nothing gets through the Senate unless it has 60 votes. I was in the Senate back in 2013 when an immigration bill passed, but it only… [+5706 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Chinese leader Xi Jinping to visit Myanmar next week", "description": "Chinese leader Xi Jinping will visit neighboring Myanmar next week amid efforts to strengthen relations with members of the Association of Southeast Asian Nations", "url": "https://www.washingtonpost.com/world/asia_pacific/chinese-leader-xi-jinping-to-visit-myanmar-next-week/2020/01/10/21140dda-337d-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T07:45:11Z", "content": "Chinese projects in Myanmar include a pipeline to channel natural gas from the Middle East overland instead of through the Malacca Strait. China has also sought to mediate conflicts between Myanmars central government and minority ethnic groups with Chinese r… [+641 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "3 missing after vessel collision in Black Sea near Istanbul", "description": "A Russian-flagged oil and chemical tanker and a Turkish fishing boat have collided in the Black Sea near Istanbul, sinking the fishing vessel", "url": "https://www.washingtonpost.com/world/europe/3-missing-after-vessel-collision-in-black-sea-near-istanbul/2020/01/10/3938c68e-3379-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T07:17:14Z", "content": "The Russian ship Glard 2 was en route from Rostov-on-Don in Russia to Izmir in western Turkey, according to marine traffic trackers. It is categorized as an oil and chemical tanker.\r\nHeavy fog has prompted the temporary closure of Istanbuls Bosphorus strait, … [+170 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "David Rising | AP", "title": "Flaring tensions could kill Iran nuclear deal; to what end?", "description": "The landmark 2015 deal between Tehran and world powers aimed at preventing Iran from obtaining nuclear weapons has been teetering on the edge of collapse since the United States pulled out unilaterally in 2018", "url": "https://www.washingtonpost.com/world/the_americas/flaring-tensions-could-kill-iran-nuclear-deal-to-what-end/2020/01/10/eb3c0866-3372-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T06:32:06Z", "content": "WHAT HAPPENS IF THE NUCLEAR DEAL FAILS?\r\nThe short answer is that every step Iran takes past the limitations of the deal reduces the so-called break-out time to produce a nuclear warhead which is still something Iran insists it does not want to do. Before the… [+4594 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Ashok Sharma | AP", "title": "India's top court orders review of all curbs in Kashmir", "description": "India's top court has ordered the government to review all restrictions in Indian-controlled Kashmir within a week as an indefinite suspension of people's rights amounted to abuse of power", "url": "https://www.washingtonpost.com/world/asia_pacific/indias-top-court-orders-review-of-all-curbs-in-kashmir/2020/01/10/964df842-3371-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T06:22:34Z", "content": "The court held that the internet shutdown impacted the freedom of press which is part of freedom of speech and expression.\r\nPrime Minister Narendra Modis government ended Muslim-majority Kashmirs semi-autonomous status in August. The move was accompanied by a… [+1391 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Mehdi Fattahi and Aya Batrawy | AP", "title": "On streets of Tehran, relief for now at no wider conflict", "description": "Many Iranians say they are relieved that neither their country nor the United States appear primed right now for a more direct military confrontation", "url": "https://www.washingtonpost.com/world/middle_east/on-streets-of-tehran-relief-for-now-at-no-wider-conflict/2020/01/10/192cdd8e-3370-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-10T06:11:54Z", "content": "But with the relief came some mixed feelings about how far Iran should go to avenge the killing of Revolutionary Guard Gen. Qassem Soleiman, the countrys most powerful commander who was slain by a U.S. drone strike in Baghdad last week. His death brought an o… [+6272 chars]"}]}