{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Firdia Lisnawati | AP", "title": "Indonesia sentences 2 Australians to up to a year for drugs", "description": "A court on Indonesia's tourist island of Bali has sentenced two Australian men to nine and 12 months in jail for possessing cocaine", "url": "https://www.washingtonpost.com/world/asia_pacific/indonesia-sentences-2-australians-to-up-to-a-year-for-drugs/2020/01/06/4bbe1608-3061-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-06T08:48:23Z", "content": "A three-member panel of judges at the Denpasar District Court found Cabantog and Van Iersel guilty of possessing and using a Category 1 drug.\r\nPolice initially said that Cabantog, 36, who was described as a hospitality consultant, was well known for circulati… [+877 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Joanna Slater, Niha Masih", "title": "Masked assailants attack students at prestigious Indian university in New Delhi", "description": "The mob shouted a slogan associated with India's ruling party as it stormed the campus.", "url": "https://www.washingtonpost.com/world/asia_pacific/masked-assailants-attack-students-at-prestigious-indian-university/2020/01/06/81061e56-304c-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-06T07:50:08Z", "content": "The incident comes at a moment of high political tension in India, where hundreds of thousands of people including many students have participated in protests against a controversial citizenship law passed last month. The law creates an expedited path to citi… [+4761 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "German police kill man who approached them with knife", "description": "Police in western Germany say they shot and killed a 37-year-old man who approached them with a knife", "url": "https://www.washingtonpost.com/world/europe/german-police-kill-man-who-approached-them-with-knife/2020/01/06/a15f7cea-3058-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-06T07:46:21Z", "content": "As the man came toward the officers, they saw that he had a knife in his other hand and did not stop despite several orders to do so. A 27-year-old police officer then fatally shot him, dpa said.\r\nLocal media reported that the man shouted Allahu Akbar, or God… [+283 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Fire at hospice in Poland kills 4 patients; others hurt", "description": "Four patients at a hospice in Poland have died in a fire at the facility possibly caused by a worker's cigarette", "url": "https://www.washingtonpost.com/world/europe/fire-at-hospice-in-poland-kills-4-patients-others-hurt/2020/01/06/5c06b45c-3057-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-06T07:37:15Z", "content": "WARSAW, Poland A fire broke out at a hospice in Poland on Monday, killing four people and hospitalizing 21 others, Polish media reported.\r\nThe four dead were all patients at the hospice in Chojnice, a town in northern Poland, said Marian Hinca, a spokesman fo… [+163 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "The Latest: Iran's supreme leader prays over slain general", "description": "Iran's Supreme Leader Ayatollah Ali Khamenei has prayed over the caskets of the top Iranian general and others slain in a U.S. airstrike near the Baghdad airport last week", "url": "https://www.washingtonpost.com/world/middle_east/the-latest-irans-supreme-leader-prays-over-slain-general/2020/01/06/0923c11c-304d-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-06T06:23:21Z", "content": "The generals successor, Easmail Ghaani stood near his side, as did Iranian President Hassan Rouhani and other top leaders in the Islamic Republic.\r\nKhamenei wept at one point during the traditional Muslim prayers for the dead. The crowd and others wailed. Aft… [+751 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Attackers beat protesting students at Indian university", "description": "Masked assailants have beaten students and teachers with sticks on the campus of a prestigious university in India's capital", "url": "https://www.washingtonpost.com/world/asia_pacific/attackers-beat-protesting-students-at-indian-university/2020/01/06/ea0c1baa-304a-11ea-971b-43bec3ff9860_story.html", "urlToImage": "", "publishedAt": "2020-01-06T06:08:10Z", "content": "Most of the injured were treated at a hospital for cuts and bruises, said Aarti Vij, a spokeswoman at the All India Institute of Medical Sciences.\r\nNew Delhi Police Commissioner Amulya Patnaik said the incident was a clash between rival student groups.\r\nOppos… [+2150 chars]"}]}