{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Washington Post Staff", "title": "Iran announces arrests over its downing of a Ukrainian passenger plane by an antiaircraft missile", "description": "Judiciary spokesman Gholamhossein Esmaili said the arrests of “some individuals” took place after extensive investigations, but he gave no further details. The announcement came after President Hassan Rouhani called for a special court to be set up to probe t…", "url": "https://www.washingtonpost.com/news/world/wp/2020/01/14/iran-announces-arrests-over-its-downing-of-a-ukrainian-passenger-plane-by-an-antiaircraft-missile/", "urlToImage": "", "publishedAt": "2020-01-14T08:59:38Z", "content": "Judiciary spokesman Gholamhossein Esmaili said the arrests of some individuals took place after extensive investigations, but he gave no further details. The announcement came after President Hassan Rouhani called for a special court to be set up to probe the… [+140 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "US citizen dies in Egyptian prison after hunger strike", "description": "The U.S. State Department says an American citizen, who was on hunger strike in prison in Egypt and who claimed he was wrongfully detained, has died after spending six years behind bars", "url": "https://www.washingtonpost.com/world/middle_east/us-citizen-dies-in-egyptian-prison-after-hunger-strike/2020/01/14/2f092c38-36aa-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T08:45:15Z", "content": "His death in custody was needless, tragic and avoidable, Assistant Secretary of State for Near Eastern Affairs David Schenker told reporters. I will continue to raise our serious concerns about human rights and Americans detained in Egypt at every opportunity… [+1501 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Iran's judiciary says arrests have been made over shootdown of Ukrainian plane that killed 176 people", "description": "Iran's judiciary says arrests have been made over shootdown of Ukrainian plane that killed 176 people", "url": "https://www.washingtonpost.com/world/middle_east/irans-judiciary-says-arrests-have-been-made-over-shootdown-of-ukrainian-plane-that-killed-176-people/2020/01/14/5efe0baa-36a7-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T08:25:07Z", "content": "DUBAI, United Arab Emirates Irans judiciary says arrests have been made over shootdown of Ukrainian plane that killed 176 people.\r\nCopyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistribu… [+3 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Libya's rival leaders leave Moscow, no peace deal signed", "description": "Libya's rival leaders have left Moscow without reaching an agreement on a cease-fire deal proposed by Russia and Turkey in an effort to bring an end to the country's long-running civil war", "url": "https://www.washingtonpost.com/world/middle_east/libyas-rival-leaders-leave-moscow-no-peace-deal-signed/2020/01/14/fa5416f6-369f-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T07:32:12Z", "content": "After the meetings, Russian Foreign Minister Sergey Lavrov and his Turkish counterpart, Mevlut Cavusoglu, announced that Sarraj signed the draft document spelling out the details of the proposed cease-fire deal, while Hifter requested more time to consider it… [+1402 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Sheikh Saaliq | AP", "title": "Indian state challenges new citizenship law in court", "description": "India's southern Kerala has became the first state to legally challenge a new citizenship law that has triggered nationwide demonstrations", "url": "https://www.washingtonpost.com/world/asia_pacific/indian-state-challenges-new-citizenship-law-in-court/2020/01/14/c24373e8-369e-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T07:23:28Z", "content": "The citizenship law backed by Prime Minister Narendra Modis Hindu nationalist party provides a path to naturalization for people from Bangladesh, Afghanistan and Pakistan, unless theyre Muslim. It has led to nationwide protests and clashes with police, leadin… [+1210 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Turkey: 115 soldiers detained over links to US-based cleric", "description": "Turkish authorities have detained 115 soldiers who are suspected of links to the U.S.-based Muslim cleric blamed by Turkey for a failed coup attempt in 2016", "url": "https://www.washingtonpost.com/world/europe/turkey-115-soldiers-detained-over-links-to-us-based-cleric/2020/01/14/07d5279a-369e-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T07:18:16Z", "content": "The report said 108 of the soldiers are currently on active duty. The suspects include six F-16 pilots and four district gendarmerie commanders, the agency reported.\r\nOn July 15, 2016, a group of officers attempted a coup to overthrow Turkish President Recep … [+554 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Nick Perry and Sam McNeil | AP", "title": "Australian village scorched by wildfires struggles with loss", "description": "The tiny village of Nerrigundah in southeastern Australia has been among the places hardest hit by the country's devastating wildfires, with about two-thirds of the homes destroyed", "url": "https://www.washingtonpost.com/world/australian-village-scorched-by-wildfires-struggles-with-loss/2020/01/14/54e23376-369d-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T07:13:15Z", "content": "Grahams Austrian wife, Melanie, died from cancer a year or so ago, and his house burned down in the Dec. 31 fire. His truck and his few belongings are with him in the yard of the fire station, the last place he saw Kozi. Graham had left his dog at the station… [+4865 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Joe McDonald | AP", "title": "China's exports end 2019 up 0.5% despite US tariff war", "description": "China's global exports rose 0.5% in 2019 despite a tariff war with Washington as the two governments prepared to sign an interim trade deal", "url": "https://www.washingtonpost.com/world/asia_pacific/chinas-exports-end-2019-up-05percent-despite-us-tariff-war/2020/01/14/a033812c-3698-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T06:39:34Z", "content": "The impact of Trumps tariff hikes in a fight over Beijings technology ambitions and trade surplus has been smaller than forecasters expected.\r\nFamously resilient Chinese exporters have pursued other markets, stepping up sales to Asia, Europe and Africa. China… [+2401 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Prosecutors: Police raiding premises in 4 German states", "description": "Prosecutors say police are conducting raids in four German states early Tuesday on suspicion of a planned serious \"violent crime", "url": "https://www.washingtonpost.com/world/europe/prosecutors-police-raiding-premises-in-4-german-states/2020/01/14/52c1e024-3697-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T06:30:15Z", "content": "The raids are taking place in Berlin, Brandenburg, North Rhine-Westphalia and Thuringia states.\r\nCopyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Samya Kullab and Qassem Abdul-Zahra | AP", "title": "Iraqis worry US-Iran tensions are eclipsing their protests", "description": "Mass protests by young Iraqis against their country's ruling elite helped force the resignation of the country's prime minister", "url": "https://www.washingtonpost.com/world/middle_east/iraqis-worry-us-iran-tensions-are-eclipsing-their-protests/2020/01/14/1daa87c6-3695-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T06:14:27Z", "content": "And in the stormy aftermath of the U.S. drone strike that also killed top Iraqi militia commander Abu Mahdi al-Muhandis, avoiding another war in Iraq became a top priority for state officials as they scrambled to contain hostilities between Washington and Teh… [+4906 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Bus falls after road collapses in China, 10 dead or missing", "description": "Authorities say a bus plunged through a collapsed section of road in northwestern China, killing at least six people and leaving four missing", "url": "https://www.washingtonpost.com/world/asia_pacific/bus-falls-after-road-collapses-in-china-10-dead-or-missing/2020/01/14/d0e7f154-3693-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T06:05:09Z", "content": "The collapse Monday afternoon left 16 people in the hospital. The bureau said the bus had been raised from the collapsed 80-square meter (860-square foot) section into which it had fallen.\r\nFootage posted online showed the bus tipped halfway into the chasm th… [+838 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Afghan official: Bombs kill 2 children in northern province", "description": "An Afghan official says that two bombs have gone off near-simultaneously on a roadside in the country's north, killing two children and wounding nine people", "url": "https://www.washingtonpost.com/world/asia_pacific/afghan-official-bombs-kill-2-children-in-northern-province/2020/01/14/2161f982-3693-11ea-a1ff-c48c1d59a4a1_story.html", "urlToImage": "", "publishedAt": "2020-01-14T06:00:14Z", "content": "No one immediately claimed responsibility for the attack but the Taliban have stepped up attacks in Balkh in recent weeks and elsewhere in northern Afghanistan. Earlier this month, the insurgents claimed an attack on a police checkpoint in Balkh that killed n… [+453 chars]"}]}