{"status": "ok", "totalResults": 4, "articles": [{"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Carolyn Hax", "title": "Carolyn Hax: Should I dispel the grand illusion and tell Mom I don’t want kids?", "description": "It’s probably kinder to go ahead and break the news to an anxious wannabe grandma.", "url": "https://www.washingtonpost.com/lifestyle/advice/carolyn-hax-should-i-dispel-the-grand-illusion-and-tell-mom-i-dont-want-kids/2019/12/31/51dbae6a-2819-11ea-9c21-2c2a4d2c2166_story.html", "urlToImage": "https://www.washingtonpost.com/resizer/z4tvEB9x2hl7RUWX0s8voSKjBiY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YEVHAWRFXII6VHGJ4GOPXSD6KE.jpg", "publishedAt": "2020-01-01T04:59:00Z", "content": "Dear Carolyn: Okay, I know it's not a good idea to lead people along about having kids when you don't want to, but my mom keeps saying she wants grandkids and I keep playing it off as a joke when I'm pretty sure 95 percent I don't want them. \r\nThe problem is,… [+2952 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Taiwan's Tsai defends Anti-Infiltration Law aimed at China", "description": "Taiwan's president says in her New Year's address that China has tried relentlessly to infiltrate Taiwan's politics but the island's new ban on political interference should have no effect on normal exchanges between them", "url": "https://www.washingtonpost.com/world/asia_pacific/taiwans-tsai-defends-anti-infiltration-law-aimed-at-china/2019/12/31/c6797f44-2c52-11ea-bffe-020c88b3f120_story.html", "urlToImage": "", "publishedAt": "2020-01-01T04:54:22Z", "content": "The laws passage wont have any effect on freedom or violate human rights and wont influence normal commercial exchanges. It will simply provide greater guarantees from Taiwans freedom and democracy, Tsai said.\r\nGiven Chinas similar actions in other countries,… [+2230 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Associated Press", "title": "Overnight clashes extend Hong Kong protests into new year", "description": "Hong Kong police have used tear gas, pepper spray and water cannons against anti-government protesters over New Year's Eve and into the early morning hours, extending the months-long movement into a new year", "url": "https://www.washingtonpost.com/world/asia_pacific/overnight-clashes-extend-hong-kong-protests-into-new-year/2019/12/31/e2f762d6-2c4c-11ea-bffe-020c88b3f120_story.html", "urlToImage": "", "publishedAt": "2020-01-01T04:12:13Z", "content": "The protests began in June over proposed legislation that could have allowed residents to be extradited to China where they could face possible torture and unfair trials. The legislation was withdrawn, but not before the protests expanded to wider calls for r… [+620 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Tristan Lavalette | AP", "title": "Australia sending aid by sea to towns cut off by wildfires", "description": "Australia is deploying military ships and aircraft to help communities ravaged by apocalyptic wildfires that destroyed homes and sent thousands of residents and holidaymakers fleeing to the shoreline", "url": "https://www.washingtonpost.com/world/australia-sending-aid-by-sea-to-towns-cut-off-by-wildfires/2019/12/31/31cd283c-2c48-11ea-bffe-020c88b3f120_story.html", "urlToImage": "", "publishedAt": "2020-01-01T03:38:38Z", "content": "On Tuesday morning, 4,000 people in the coastal town of Mallacoota fled to the shore as winds pushed a fire toward their homes under a sky darkened by smoke and turned blood-red by flames. Stranded residents and vacationers slept in their cars, and gas statio… [+3094 chars]"}]}