{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Manager at Turkish jet operator told authorities he helped Ghosn escape because of threats- newspaper", "description": "A manager at Turkish jet operator MNG Jet has told authorities that he assisted unwittingly in the escape of ex-Nissan boss Carlos Ghosn from Japan because he had been threatened by a former acquaintance, Hurriyet newspaper reported on Saturday.", "url": "https://uk.reuters.com/article/nissan-ghosn-turkey-statement-idUKL8N299074", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-04T12:56:18Z", "content": "ISTANBUL, Jan 4 (Reuters) - A manager at Turkish jet operator MNG Jet has told authorities that he assisted unwittingly in the escape of ex-Nissan boss Carlos Ghosn from Japan because he had been threatened by a former acquaintance, Hurriyet newspaper reporte… [+1458 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "UK's Johnson to meet EU chief von der Leyen in London", "description": "British Prime Minister Boris Johnson will meet European Commission President Ursula von der Leyen in London on Wednesday ahead of the opening rounds of trade talks that will begin once Britain formally leaves the bloc on Jan. 31.", "url": "https://www.reuters.com/article/us-britain-eu-meeting-idUSKBN1Z30CM", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200104&t=2&i=1472125518&w=1200&r=LYNXMPEG030CB", "publishedAt": "2020-01-04T12:53:46Z", "content": "LONDON (Reuters) - British Prime Minister Boris Johnson will meet European Commission President Ursula von der Leyen in London on Wednesday ahead of the opening rounds of trade talks that will begin once Britain formally leaves the bloc on Jan. 31. \r\nThe two … [+1135 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Cricket-India's Pathan announces retirement from all formats", "description": "Indian all-rounder Irfan Pathan announced his retirement from all forms of the game on Saturday, bringing the curtain down on an illustrious career which included a World Twenty20 triumph.", "url": "https://uk.reuters.com/article/uk-cricket-india-pathan-idUKKBN1Z30DI", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200104&t=2&i=1472133150&w=1200&r=LYNXMPEG030DZ", "publishedAt": "2020-01-04T12:53:30Z", "content": "(Reuters) - Indian all-rounder Irfan Pathan announced his retirement from all forms of the game on Saturday, bringing the curtain down on an illustrious career which included a World Twenty20 triumph. \r\nThe 35-year-old left-arm seamer played 29 tests, 120 one… [+1160 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": null, "title": "Tens of thousands march in Baghdad to mourn Soleimani, others killed in U.S. air strike", "description": null, "url": "https://uk.reuters.com/article/uk-iraq-security/tens-of-thousands-march-in-baghdad-to-mourn-soleimani-others-killed-in-us-air-strike-idUKKBN1Z306B", "urlToImage": null, "publishedAt": "2020-01-04T12:52:14Z", "content": null}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "France discusses Middle East tensions with Germany and China", "description": "French Foreign Minister Jean-Yves Le Drian said he had discussed the situation in the Middle East on Saturday with his German and Chinese counterparts, and added that all three had agreed on the need to avoid any escalation in tensions.", "url": "https://uk.reuters.com/article/iraq-security-france-idUKP6N28C02F", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-04T12:51:50Z", "content": "PARIS, Jan 4 (Reuters) - French Foreign Minister Jean-Yves Le Drian said he had discussed the situation in the Middle East on Saturday with his German and Chinese counterparts, and added that all three had agreed on the need to avoid any escalation in tension… [+451 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "John Mair", "title": "Bushfires rage out of control across southeast Australia", "description": "Bushfires burned dangerously out of control on Australia's east coast on Saturday, fanned by high temperatures and strong winds that had firefighters battling to save lives and property, as a change in wind conditions merged several large fire fronts.", "url": "https://uk.reuters.com/article/us-australia-bushfires-idUKKBN1Z2270", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200104&t=2&i=1472122051&w=1200&r=LYNXMPEG030BU", "publishedAt": "2020-01-04T12:49:18Z", "content": "SYDNEY/MELBOURNE (Reuters) - Bushfires burned dangerously out of control on Australia’s east coast on Saturday, fanned by high temperatures and strong winds that had firefighters battling to save lives and property, as a change in wind conditions merged sever… [+4620 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Security firm ended Ghosn's surveillance: sources", "description": "Reuters has learned that lawyers for Carlos Ghosn warned a private security company that its surveillance of Carlos Ghosn's home was a human rights abuse. He escaped house arrest shortly after the firm stopped watching his Tokyo home.", "url": "https://www.reuters.com/video/watch/idRCV007O56", "urlToImage": "https://static.reuters.com/resources/r/?d=20200104&i=RCV007O56&r=RCV007O56&t=2", "publishedAt": "2020-01-04T12:43:46Z", "content": "Posted \r\nReuters has learned that lawyers for Carlos Ghosn warned a private security company that its surveillance of Carlos Ghosn's home was a human rights abuse. He escaped house arrest shortly after the firm stopped watching his Tokyo home."}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Atlantia CEO warns of bankruptcy risk if concession revoked: paper", "description": "Atlantia risks going bankrupt if Italy's government revokes its motorway licence with limited compensation, the infrastructure group's CEO told an Italian daily on Saturday, adding an alternative compromise could be found.", "url": "https://in.reuters.com/article/italy-bridge-atlantia-idINKBN1Z30C3", "urlToImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20200104&t=2&i=1472122069&w=1200&r=LYNXMPEG030BF", "publishedAt": "2020-01-04T12:36:55Z", "content": "MILAN (Reuters) - Atlantia risks going bankrupt if Italy’s government revokes its motorway licence with limited compensation, the infrastructure group’s CEO told an Italian daily on Saturday, adding an alternative compromise could be found. \r\nAtlantia has com… [+2321 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Catalan separatists ERC reaffirm abstention in Spain's investiture vote", "description": "Catalan separatist party Esquerra Republicana de Catalunya (ERC) reaffirmed on Saturday it would abstain during the Spanish parliament's vote to confirm Socialist leader Pedro Sanchez as prime minister, a senior official said, a move that would help to end a …", "url": "https://www.reuters.com/article/us-spain-politics-catalonia-idUSKBN1Z30C9", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-04T12:33:59Z", "content": "MADRID (Reuters) - Catalan separatist party Esquerra Republicana de Catalunya (ERC) reaffirmed on Saturday it would abstain during the Spanish parliament’s vote to confirm Socialist leader Pedro Sanchez as prime minister, a senior official said, a move that w… [+606 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Ahmed Aboulenein", "title": "UPDATE 13-Thousands in Iraq mourn top Iranian general killed by U.S.; rockets fired in Baghdad - Reuters.com", "description": "UPDATE 13-Thousands in Iraq mourn top Iranian general killed by U.S.; rockets fired in Baghdad Reuters.com Trump and Rouhani trade warnings after killing of top general CNN Could Iran and US go to war? | Inside Story Al Jazeera English Trump Kills Iran’s Most…", "url": "https://www.reuters.com/article/iraq-security-idUSL8N29903Z", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-04T12:15:00Z", "content": "* Iraqi mourners shout ‘Death to America’ and ‘No No Israel’ \r\n* Any Americans ‘within reach’ to be punished -Iranian officer \r\n* Iran cites 35 possible targets including Gulf oil region \r\n* U.S., allies suspend training of Iraqi forces \r\n* Four rocket attack… [+6572 chars]"}]}