{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "From arrest to flight - key dates in the Ghosn affair", "description": "Ousted Nissan <7201.T> boss Carlos Ghosn decided to flee Japan after learning that his trial had been delayed until April 2021 and also because he had not been allowed to speak to his wife, sources close to Ghosn said on Thursday.", "url": "https://www.reuters.com/article/us-nissan-ghosn-dates-timeline-idUSKBN1Z10SC", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200102&t=2&i=1471269501&w=1200&r=LYNXMPEG010OZ", "publishedAt": "2020-01-02T12:09:38Z", "content": "(Reuters) - Ousted Nissan (7201.T) boss Carlos Ghosn decided to flee Japan after learning that his trial had been delayed until April 2021 and also because he had not been allowed to speak to his wife, sources close to Ghosn said on Thursday. \r\nGhosn, 65, the… [+2898 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "TIMELINE-From arrest to flight - key dates in the Ghosn affair", "description": "Ousted Nissan boss Carlos Ghosn decided to flee Japan after learning that his trial had been delayed until April 2021 and also because he had not been allowed to speak to his wife, sources close to Ghosn said on Thursday.", "url": "https://www.reuters.com/article/nissan-ghosn-dates-idUSL8N2971FC", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-02T12:05:33Z", "content": "Jan 2 (Reuters) - Ousted Nissan boss Carlos Ghosn decided to flee Japan after learning that his trial had been delayed until April 2021 and also because he had not been allowed to speak to his wife, sources close to Ghosn said on Thursday. \r\nGhosn, 65, the fo… [+2885 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Kyrgios pledges money for victims of Australian bushfires", "description": "Australian Nick Kyrgios has put his hand up to help the victims of raging bushfires in his country by promising a $200 donation for every ace he serves during the home summer season.", "url": "https://www.reuters.com/article/us-tennis-australia-kyrgios-idUSKBN1Z10RY", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200102&t=2&i=1471268192&w=1200&r=LYNXMPEG010OR", "publishedAt": "2020-01-02T12:04:47Z", "content": "(Reuters) - Australian Nick Kyrgios has put his hand up to help the victims of raging bushfires in his country by promising a $200 donation for every ace he serves during the home summer season. \r\nMore than 1,000 homes have been destroyed by the fires fueled … [+2055 chars]"}]}