{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Sudip Kar-Gupta", "title": "Clashes break out at Paris protest against pension reform", "description": "Police on Saturday fired tear gas at demonstrators in Paris's busy Gare du Nord station, used by tourists taking the Eurostar service, and at the Gare de l'Est, during demonstrations against plans to reform France's pension system.", "url": "https://uk.reuters.com/article/uk-france-protests-pensions-idUKKBN1Z30FX", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200104&t=2&i=1472172207&w=1200&r=LYNXMPEG030IO", "publishedAt": "2020-01-04T18:44:01Z", "content": "PARIS (Reuters) - Police on Saturday fired tear gas at demonstrators in Paris’s busy Gare du Nord station, used by tourists taking the Eurostar service, and at the Gare de l’Est, during demonstrations against plans to reform France’s pension system. \r\nThe dem… [+1218 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraqi militia warns security forces to stay away from U.S. bases: Al Mayadeen", "description": "Iraq's Kataib Hezbollah militia warned on Saturday Iraqi security forces to stay away from U.S. bases in Iraq, al-Mayadeen television said.", "url": "https://www.reuters.com/article/us-iraq-security-kataib-idUSKBN1Z30K9", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-04T18:18:44Z", "content": "BAGHDAD (Reuters) - Iraq’s Kataib Hezbollah militia warned on Saturday Iraqi security forces to stay away from U.S. bases in Iraq, al-Mayadeen television said. \r\n“Security forces must stay clear of American bases by a distance not less and a thousand meters s… [+123 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iraqi PM declares national mourning for Soleimani, Muhandis: statement", "description": "Iraqi Prime Minister Adel Abdul Mahdi declared on Saturday three days of national mourning for Iranian military commander Qassem Soleimani, Iraqi militia leader Abu Mahdi al-Muhandis, and others killed in a U.S. air strike in Baghdad.", "url": "https://www.reuters.com/article/us-iraq-security-primeminister-idUSKBN1Z30K7", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-04T18:17:35Z", "content": "BAGHDAD (Reuters) - Iraqi Prime Minister Adel Abdul Mahdi declared on Saturday three days of national mourning for Iranian military commander Qassem Soleimani, Iraqi militia leader Abu Mahdi al-Muhandis, and others killed in a U.S. air strike in Baghdad. \r\n“P… [+248 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Terrorism not ruled out in fatal stabbing near Paris", "description": "French investigators said they had not dismissed possible links to terrorism after a man went on a rampage with a knife in a park near Paris on Friday, killing one person and wounding two. Police shot the man dead.", "url": "https://www.reuters.com/article/us-france-security-idUSKBN1Z30JX", "urlToImage": "https://s1.reutersmedia.net/resources/r/?m=02&d=20200104&t=2&i=1472209500&w=1200&r=LYNXMPEG030M0", "publishedAt": "2020-01-04T18:00:02Z", "content": "PARIS (Reuters) - French investigators said they had not dismissed possible links to terrorism after a man went on a rampage with a knife in a park near Paris on Friday, killing one person and wounding two. Police shot the man dead. \r\n“An act of terrorism can… [+955 chars]"}]}