{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": "reuters", "name": "Reuters"}, "author": "Philip Pullella", "title": "Former Pope Benedict breaks silence on celibacy debate after synod", "description": "Former Pope Benedict, in a new book written with a conservative cardinal, defends priestly celibacy in the Catholic Church in what appears to be a strategically timed appeal to Pope Francis to not change the rules.", "url": "https://www.reuters.com/article/uk-pope-benedict-book-idUSKBN1ZB0O4", "urlToImage": "https://s4.reutersmedia.net/resources/r/?m=02&d=20200112&t=2&i=1475613356&w=1200&r=LYNXMPEG0B0MV", "publishedAt": "2020-01-12T21:27:32Z", "content": "VATICAN CITY (Reuters) - Former Pope Benedict, in a new book written with a conservative cardinal, defends priestly celibacy in the Catholic Church in what appears to be a strategically timed appeal to Pope Francis to not change the rules. \r\nBenedict wrote th… [+2569 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Hexcel and Woodward combine in merger valued at over $6 bln", "description": "Hexcel Corp , a composites technology company, and aircraft and industrial parts maker Woodward Inc said on Sunday they would combine in an all-stock merger of equals to create an integrated systems provider for the aerospace and industrial sectors.", "url": "https://www.reuters.com/article/us-hexcel-m-a-woodward-idUSKBN1ZB0NY", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-12T21:04:19Z", "content": "(Reuters) - Hexcel Corp (HXL.N), a composites technology company, and aircraft and industrial parts maker Woodward Inc (WWD.O) said on Sunday they would combine in an all-stock merger of equals to create an integrated systems provider for the aerospace and in… [+606 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Soccer-Real overcome Atletico in shootout to win Super Sup in Saudi Arabia", "description": "Real Madrid beat city rivals Atletico Madrid 4-1 in a penalty shootout to win the first edition of the revamped Spanish Super Cup in Saudi Arabia following a goalless draw after extra time in a tense final on Sunday.", "url": "https://uk.reuters.com/article/uk-soccer-spain-mad-atm-report-idUKKBN1ZB0O0", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200112&t=2&i=1475609164&w=1200&r=LYNXMPEG0B0MK", "publishedAt": "2020-01-12T20:54:08Z", "content": "JEDDAH (Reuters) - Real Madrid beat city rivals Atletico Madrid 4-1 in a penalty shootout to win the first edition of the revamped Spanish Super Cup in Saudi Arabia following a goalless draw after extra time in a tense final on Sunday. \r\nCaptain Sergio Ramos … [+1029 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Pearson warns 'job not done' as Watford escape relegation zone", "description": "Watford escaped the Premier League relegation zone for the first time this season with a 3-0 win at Bournemouth on Sunday but manager Nigel Pearson, who has engineered a remarkable transformation since taking over, said the job is not done.", "url": "https://uk.reuters.com/article/uk-soccer-england-bou-wat-idUKKBN1ZB0NQ", "urlToImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20200112&t=2&i=1475604336&w=1200&r=LYNXMPEG0B0LP", "publishedAt": "2020-01-12T20:52:52Z", "content": "LONDON (Reuters) - Watford escaped the Premier League relegation zone for the first time this season with a 3-0 win at Bournemouth on Sunday but manager Nigel Pearson, who has engineered a remarkable transformation since taking over, said the job is not done.… [+2725 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Colombia says police foil attempt to assassinate FARC leader Timochenko", "description": "Colombian police thwarted an assassination attempt against Rodrigo Londono, former commander of the demobilized FARC rebels better known by his nom de guerre Timochenko, a senior official said Sunday.", "url": "https://www.reuters.com/article/us-colombia-conflict-idUSKBN1ZB0NK", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-12T20:20:46Z", "content": "BOGOTA (Reuters) - Colombian police thwarted an assassination attempt against Rodrigo Londono, former commander of the demobilized FARC rebels better known by his nom de guerre Timochenko, a senior official said Sunday.      \r\nGeneral Oscar Atehortua, directo… [+1868 chars]"}, {"source": {"id": "reuters", "name": "Reuters"}, "author": "Reuters Editorial", "title": "Iran issues more visas to Canada team investigating plane crash", "description": "Iran has issued eight more visas to a team of Canadian officials in the wake of a fatal plane crash near Tehran and most members of the group should be in Tehran on Monday, Canadian Foreign Minister Francois-Philippe Champagne said on Sunday.", "url": "https://www.reuters.com/article/us-iran-crash-canada-visas-idUSKBN1ZB0HP", "urlToImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "publishedAt": "2020-01-12T20:18:10Z", "content": "OTTAWA (Reuters) - Iran has issued eight more visas to a team of Canadian officials in the wake of a fatal plane crash near Tehran and most members of the group should be in Tehran on Monday, Canadian Foreign Minister Francois-Philippe Champagne said on Sunda… [+884 chars]"}]}