{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Falih Hassan and Alissa J. Rubin", "title": "Iraq’s New Election Law Draws Much Criticism and Few Cheers", "description": "Iraq’s Parliament voted to overhaul the country’s election laws in a bid to reduce the power of political parties. But many protesters, who had called for just such a change, were not impressed.", "url": "https://www.nytimes.com/2019/12/24/world/middleeast/iraq-election-law.html", "urlToImage": "https://static01.nyt.com/images/2019/12/24/world/24iraq1/24iraq1-facebookJumbo.jpg", "publishedAt": "2019-12-25T02:28:59Z", "content": "Legislators defended the new law, insisting that they were doing the will of the protesters. \r\nThe political blocs listened to the demands of the demonstrators and carried out a peaceful coup upon themselves by passing the election law, said Wajih Abbas, a la… [+917 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "Inquiry Into Michigan State’s Handling of Larry Nassar Case Is Suspended", "description": "The university’s former president and former gymnastics coach are facing criminal prosecution as a result of the investigation, while a former dean was sentenced to one year in prison.", "url": "https://www.nytimes.com/2019/12/24/sports/Larry-Nassar-investigation.html", "urlToImage": "https://static01.nyt.com/images/2019/12/24/multimedia/24xp-nassar/24xp-nassar-facebookJumbo.jpg", "publishedAt": "2019-12-25T02:07:51Z", "content": "A Michigan State spokeswoman, Emily Guerrant, said in a statement Tuesday that the East Lansing university had complied with numerous investigations.\r\nM.S.U. has cooperated fully with the inquiry, including handing over all facts associated with the case, the… [+1019 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "JACK HEALY", "title": "In Indian Country, a Crisis of Missing Women. And a New One When They’re Found.", "description": "GALLUP, N.M. — Prudence Jones had spent two years handing out “Missing” flyers and searching homeless camps and underpasses for her 28-year-old daughter when she got the call she had been praying for: Dani had been found. She was in a New Mexico jail, but she…", "url": "https://www.nytimes.com/2019/12/24/us/native-women-girls-missing.html", "urlToImage": "https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "publishedAt": "2019-12-25T02:01:31Z", "content": "GALLUP, N.M. Prudence Jones had spent two years handing out Missing flyers and searching homeless camps and underpasses for her 28-year-old daughter when she got the call she had been praying for: Dani had been found. She was in a New Mexico jail, but she was… [+9862 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Associated Press", "title": "35 Civilians Killed in Extremist Attack in Burkina Faso", "description": "The assault by Islamist extremists on a town in northern Burkina Faso also left 80 jihadists dead, according to the country’s president.", "url": "https://www.nytimes.com/2019/12/24/world/africa/burkina-faso-35-civilians-killed.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-25T01:24:18Z", "content": "OUAGADOUGOU, Burkina Faso Jihadists attacked a town in northern Burkina Faso and killed 35 civilians, most of them women, and the ensuing clashes with security forces left 80 jihadists dead, the West African nations president, Roch Marc Christian Kaboré, anno… [+593 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "Australia’s volunteer firefighters find it hard to pause, even for Christmas", "description": "Australia’s Volunteer Firefighters Find It Hard to Pause, Even for Christmas", "url": "http://www.nytimes.com/2019/12/24/world/australia/volunteer-firefighters.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2018/01/day-in-pix008.jpg?w=1024&h=683", "publishedAt": "2019-12-25T01:13:57Z", "content": "SYDNEY — One of the worst early fire seasons in Australias history has so far left 10 people dead, destroyed nearly 1,000 properties and consumed millions of acres. To confront the danger and protect communities, the country has relied on its overwhelmingly v… [+2028 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "Pentagon eyes Africa drawdown as first step in global troop shift", "description": "Defense Secretary Mark T. Esper is weighing proposals for a major reduction — or even a complete pullout — of U.S. forces from West Africa as the first phase of reviewing global deployments.", "url": "http://www.nytimes.com/2019/12/24/world/africa/esper-troops-africa-china.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2019/12/b03274e7-511c-41d4-a895-93a6eafc45f3.jpg?w=1024&h=683", "publishedAt": "2019-12-25T01:06:07Z", "content": "WASHINGTON — Defense Secretary Mark T. Esper is weighing proposals for a major reduction or even a complete pullout of U.S. forces from West Africa as the first phase of reviewing global deployments that could reshuffle thousands of troops around the world, a… [+9023 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ruth Maclean", "title": "Nigeria Releases Leading Critic on Bail After a Campaign an Ocean Away", "description": "Omoyele Sowore, a publisher and ex-presidential candidate, was released after months in detention. His New Jersey neighbors had led the effort to free him.", "url": "https://www.nytimes.com/2019/12/24/world/africa/nigeria-omoyele-sowore-released.html", "urlToImage": "https://static01.nyt.com/images/2019/12/24/world/24nigeriabail1/24nigeriabail1-facebookJumbo.jpg", "publishedAt": "2019-12-25T00:50:43Z", "content": "Mr. Sowore still faces trial on charges of treason, money laundering and cyberstalking the last for allegedly insulting the president, Muhammadu Buhari, on television. His bail conditions stipulate that he may not leave the Nigerian capital, Abuja, or speak t… [+960 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Marc Stein", "title": "The Decade’s Best and Worst (Sorry, Knicks) - The New York Times", "description": "The Decade’s Best and Worst (Sorry, Knicks) The New York Times NBA Christmas Day - One big question about every team ESPN Richard Jefferson Reveals The Difference Between Kawhi Leonard And LeBron James Fadeaway World Paul George Pranked Mom by Saying He Was T…", "url": "https://www.nytimes.com/2019/12/24/sports/basketball/nba-decade-in-review.html", "urlToImage": "https://static01.nyt.com/images/2019/06/02/sports/02oldwarriors1/02oldwarriors1-facebookJumbo.jpg", "publishedAt": "2019-12-25T00:09:00Z", "content": "Dont forget that the decade began with Nowitzki leading the Mavericks to a championship in 2011 that rewrote his legacy. Winning that ring, with no other All-Stars on the Mavericks 2010-11 roster, enabled Nowitzki to retire as both a revolutionary for changin… [+1908 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jay Ruttenberg", "title": "In Praise of Barack Obama, Music Critic", "description": "The former president’s annual year-end playlist never fails to delight.", "url": "https://www.nytimes.com/2019/12/24/opinion/barack-obama-music-playlist.html", "urlToImage": "https://static01.nyt.com/images/2019/12/24/opinion/24ruttenbergWeb/24ruttenbergWeb-facebookJumbo-v2.jpg", "publishedAt": "2019-12-25T00:07:47Z", "content": "Regardless of any feelings about the recent leader of the free world transitioning into a Nick Hornby protagonist, Mr. Obama makes a knockout music critic. Putting together these year-end lists is no picnic. When staff positions compelled me to assemble them,… [+2119 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "Children’s Aid Helped a Young Ghanaian Woman Get to College", "description": "Karen Mills, who came to New York at 13, found a support network through piano lessons.", "url": "https://www.nytimes.com/2019/12/24/opinion/neediest-cases-childrens-aid.html", "urlToImage": "https://static01.nyt.com/images/2019/12/24/opinion/24neediestWeb/24neediestWeb-facebookJumbo.jpg", "publishedAt": "2019-12-25T00:00:05Z", "content": "The Childrens Aid staff recognized even the needs Ms. Mills didnt articulate. When she was a high school senior and getting ready for college, she realized she had no money for new clothes or dorm room furniture, but she kept that to herself, thinking she cou… [+1545 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Brittan Heller", "title": "How to Teach an Old Frog New Tricks", "description": "Pepe, Gaysper and other once-hateful symbols teach us that tech companies should institutionalize impermanence.", "url": "https://www.nytimes.com/2019/12/24/opinion/pepe-frog-hate-speech.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/opinion/22Heller/22Heller-facebookJumbo.jpg", "publishedAt": "2019-12-25T00:00:04Z", "content": "Shifts like these have always happened. But today, thanks to meme culture, online audiences can flip hate speech on its head faster than ever. In April, the Spanish political party Vox tweeted a meme referencing The Lord of the Rings: a picture of Aragorn, di… [+2478 chars]"}]}