{"status": "ok", "totalResults": 33, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mihir Zaveri", "title": "U.S. Entitled to Edward Snowden’s Proceeds From His New Memoir, Judge Says", "description": "The former intelligence contractor did not let federal intelligence agencies vet his book before it was published in breach of his agreements with the agencies, the judge said.", "url": "https://www.nytimes.com/2019/12/18/us/politics/snowden-book-lawsuit.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/multimedia/18xp-SNOWDEN/18xp-SNOWDEN-facebookJumbo.jpg", "publishedAt": "2019-12-18T17:18:12Z", "content": "The United States attorneys office in Alexandria, Va., referred questions to the Justice Department in Washington. The department did not immediately respond to requests for comment on Wednesday.\r\nThe ruling on Tuesday addressed only Mr. Snowdens liability fo… [+1688 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Matt Dorfman", "title": "The Best Book Covers of 2019", "description": "“So many covers tossed aside fail-safe choices this year and pursued directions that allowed for the possibility of art,” the Book Review’s art director writes.", "url": "https://www.nytimes.com/2019/12/18/books/review/best-book-covers.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/books/review/18BestCovers-PROMO/18BestCovers-PROMO-facebookJumbo.jpg", "publishedAt": "2019-12-18T17:02:40Z", "content": "There are emergency protocols and fail-safe maneuvers in book cover design just as there are in any semi-functioning government. If conflicting visions arise between designers, editors, marketing, authors, agents or publishers the odds being decent that they … [+1087 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Robin George Andrews", "title": "A 3D Encounter With a Violent Volcano’s Underbelly", "description": "Scientists spent days aboard a helicopter with special sensors over a volcano to develop a picture of how its insides affect its frequent eruptions.", "url": "https://www.nytimes.com/2019/12/18/science/volcano-3d-reunion-island.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/science/18TB-VOLCANO02/merlin_166134297_bc416a56-f6ad-47f3-9ebd-f558b06691ec-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:58:48Z", "content": "Réunion, a French island in the western Indian Ocean, is a jigsaw of two massive shield volcanoes. The younger, Piton de la Fournaise or peak of the furnace, is a furious factory of lava, erupting every eight months on average over the last four decades.\r\nTha… [+974 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David McCabe and Kate Conger", "title": "Stamping Out Online Sex Trafficking May Have Pushed It Underground", "description": "A change in a law to hold tech platforms accountable had almost universal support in Congress last year. Now, some are revisiting their decision.", "url": "https://www.nytimes.com/2019/12/17/technology/fosta-sex-trafficking-law.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/business/17trafficking-sub/17trafficking-sub-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:58:09Z", "content": "Senator Richard Blumenthal, a Democrat from Connecticut who sponsored the 2018 law, said in a statement that the sex trafficking carve-out was written to change tech industry practices, and that it had succeeded. \r\nAny website that closed down because of the … [+1027 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Brooks Barnes", "title": "On an Old West Set, Trying to Create Hollywood’s Future", "description": "Rideback Ranch is an attempt by one of the entertainment industry’s leading producers to find a new way to develop ideas for movies and TV shows.", "url": "https://www.nytimes.com/2019/12/18/business/media/rideback-ranch.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/business/18rideback-3/18rideback-3-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:57:09Z", "content": "In Hollywood people are really good at appearing to be decent and good, Modi Wiczyk, a co-founder of MRC, said. Dan is actually decent and good. He is also incredibly ambitious you dont get to where he is by accident. All of those qualities can be hard to rec… [+1330 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Marisa Meltzer", "title": "Are Experiential Gifts More Trouble Than They’re Worth?", "description": "Booking your sweetie for a massage, a Broadway show or a surprise trip is a nice idea — if you have the time, dedication and money to pull it off.", "url": "https://www.nytimes.com/2019/12/18/style/experiential-gifts.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/fashion/18EXPERIENCES-art/18EXPERIENCES-art-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:52:54Z", "content": "Drew Zandonella-Stannard, a copywriter in Seattle, knows her husbands taste well. This year, for Christmas, she bought him a bottle from the comedian Eric Wareheims line of natural wines and tickets to his stand-up tour. It was supposed to be a surprise, but … [+1171 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Corey Kilgannon, Andrea Salcedo, Todd Heisler", "title": "How The Immigrant Dream Died In An Automotive Shantytown", "description": "In the heart of Queens lies one of New York City's most curious and untamed neighborhoods — a warren of squalid streets lined with flimsy auto repair shops that bustle with commerce and camaraderie.", "url": "https://www.nytimes.com/interactive/2019/12/18/nyregion/willets-point-development-queens.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/autossell/18WilletsHPVideoPromo/01canvas-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:42:15Z", "content": "In the heart of Queens lies one of New York Citys most curious and untamed neighborhoods a warren of squalid streets lined with flimsy auto repair shops that bustle with commerce and camaraderie.\r\nMechanics delve deep under car hoods, and hawkers barrage driv… [+12041 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David E. Sanger", "title": "Bash Putin? The Senate is Willing. The Trick Is Not Impugning Trump.", "description": "WASHINGTON — As the House of Representatives began debating Wednesday whether to impeach President Trump for undercutting Ukraine in its fight with Russian aggressors, the Senate Foreign Relations Committee met in a small room in the Capitol to consider a bil…", "url": "https://www.nytimes.com/2019/12/18/us/politics/trump-ukraine-russian-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/us/politics/18dc-memo1/18dc-memo1-facebookJumbo-v2.jpg", "publishedAt": "2019-12-18T16:39:00Z", "content": "The debate that resonated inside the ornate Senate Foreign Relations Committee suite where senators of a different era debated how to push back against Hitler in the 1930s and how to define Cold War strategy against the Soviet Union thereafter featured Republ… [+1532 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Bakalar", "title": "The More Processed Foods You Eat, the Higher Your Diabetes Risk", "description": "Ultraprocessed foods were tied to a higher risk of Type 2 diabetes.", "url": "https://www.nytimes.com/2019/12/18/well/eat/the-more-processed-foods-you-eat-the-higher-your-diabetes-risk.html", "urlToImage": "https://static01.nyt.com/images/2016/09/14/well/well_pog_eat/well_pog_eat-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:29:29Z", "content": "Eating ultraprocessed foods may increase your risk for Type 2 diabetes.\r\nUltraprocessed foods including chips, instant noodles, breakfast cereals, chicken nuggets and other industrially processed ready-to-eat or microwaveable fare are designed for tastiness a… [+1263 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ceylan Yeginsu", "title": "Nurses in Northern Ireland Strike Amid Growing Health Care Crisis", "description": "About 15,000 nurses walked out Wednesday, demanding pay parity with the rest of Britain, and more staffing to save a health system they say is endangering patient safety.", "url": "https://www.nytimes.com/2019/12/18/world/europe/northern-ireland-nurses-strike.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/world/18ni-nurses/merlin_166124688_0ca4e396-569d-47a0-9d38-062f633afd90-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:18:51Z", "content": "The concerns of nurses were raised again and again over a number of years, but this has continued to fall on deaf ears, she added.\r\nNorthern Irelands health care services are on the brink of collapse because of chronic underfunding that has gone unresolved fo… [+1355 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Bakalar", "title": "Poor Sleep Tied to Heart Disease and Stroke", "description": "Being an early bird, sleeping seven to eight hours a night, having no insomnia, not snoring and not being sleepy during the day were tied to better cardiovascular health.", "url": "https://www.nytimes.com/2019/12/18/well/live/poor-sleep-tied-to-heart-disease-and-stroke.html", "urlToImage": "https://static01.nyt.com/images/2016/09/15/well/well_pog_sleep/well_pog_sleep-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:16:33Z", "content": "Poor sleep may increase the risk for cardiovascular disease, new research suggests.\r\nResearchers assigned sleep scores on a scale of zero to five to 385,292 British men and women, giving one point for having each of five indicators of healthy sleep: being an … [+888 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nick Corasaniti", "title": "Letter Calls on 2020 Campaigns to Condemn Nondisclosure Agreements", "description": "The letter, from three former Fox News employees, is intended to pressure presidential campaigns to end the practice of forcing workers to sign NDAs.", "url": "https://www.nytimes.com/2019/12/18/us/politics/2020-Democrats-Fox-News-NDAs.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/us/politics/18campaignNDAs1/18campaignNDAs1-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:07:14Z", "content": "The group is not necessarily calling for an end to all nondisclosure agreements, understanding the need on a political campaign to protect trade secrets like self-research and internal polling. Instead, it is focused on nondisclosure agreements solely dealing… [+1121 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Caitlin Youngquist", "title": "Six Stars of the New ‘West Side Story’ Discuss Its Enduring Relevance", "description": "The male actors, many making their Broadway debuts, talk about the director Ivo van Hove’s radical approach — and offer a fresh take on holiday dressing.", "url": "https://www.nytimes.com/2019/12/18/t-magazine/west-side-story-broadway.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/t-magazine/17tmag-westsidestory-slide-AL1P/17tmag-westsidestory-slide-AL1P-facebookJumbo.jpg", "publishedAt": "2019-12-18T16:00:09Z", "content": "While van Hove, 61, is no stranger to New Yorks theater scene nor to adapting American classics, having remounted Arthur Millers A View From the Bridge in 2015 and Millers The Crucible in 2016 this is his Broadway musical debut. The original production was a … [+2633 chars]"}]}