{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elisha Brown", "title": "In Retirement, They Help Immigrants Find Their Way in New York", "description": "Maher and Salwa Gendy recall feeling adrift after arriving in the United States from Egypt. Now they help members of their church get benefits and prepare for the citizenship test.", "url": "https://www.nytimes.com/2020/01/06/neediest-cases/coptic-christians-faith-volunteerism.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/neediest-cases/00ncf-gendy02/00ncf-gendy02-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:51:50Z", "content": "The Gendys each receive $3 for each day they volunteer, or about $240 per year, from The Neediest Cases Fund to offset some of their transportation costs, said Rebecca Haase, who directs the financial advocacy program for the Community Service Society. The co… [+852 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Raymond Zhong", "title": "Awash in Disinformation Before Vote, Taiwan Points Finger at China", "description": "The self-governing island is on high alert for digital-age trickery and deception that Beijing might be using to try to swing a crucial election.", "url": "https://www.nytimes.com/2020/01/06/technology/taiwan-election-china-disinformation.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/business/05taiwanmeddling-1/00taiwanmeddling-1-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:47:52Z", "content": "Puma Shen, an assistant professor at National Taipei University who studies Chinese influence efforts, does not believe that disinformation from China is always guided by some central authority as it spreads around the internet. \r\nIts not an order from Beijin… [+1307 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Roberta Smith", "title": "When He Was Good, He Was Breathtaking", "description": "The mesmerizing, frustrating world of Félix Vallotton, now at the Metropolitan Museum.", "url": "https://www.nytimes.com/2020/01/06/arts/design/felix-vallotton-metropolitan-museum.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/arts/06vallotton-review4/06vallotton-review4-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:37:02Z", "content": "But three paintings from after 1900 stand out for their size and ambition, if also their increasing academicism. The first is marvelously strange: The Five Painters (1902-03), a group portrait of the Nabis (Vallotton included). The dark-suited artists almost … [+1418 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Ford Quarterly Sales Slip on Slowdown in Passenger Cars Demand", "description": "American automakers’ sales for 2019 showed passenger cars falling out of favor with buyers amid lower oil prices.", "url": "https://www.nytimes.com/2020/01/06/automobiles/ford-car-sales.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-06T17:30:45Z", "content": "Shares of the company were down 1.19 percent, while shares of General Motors, the No. 1 United States automaker, were down 0.96 percent.\r\nFord sold more than 1.2 million trucks in 2019, outselling rival G.M., which sold 802,962 pickups during the year.\r\nFello… [+197 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Natasha Singer", "title": "4 Things to Know About YouTube’s New Children Privacy Practices", "description": "The video service is making several changes after a settlement with federal and state regulators.", "url": "https://www.nytimes.com/2020/01/06/technology/youtube-children-privacy.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/business/06youtube/06youtube-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:30:06Z", "content": "YouTube will no longer show ads on childrens videos that are targeted at viewers based on their web-browsing or other online activity data. Instead, the company said, it may now show ads based on the context of what people are viewing.\r\nYouTube said viewers w… [+1229 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tejal Rao", "title": "India’s ‘Pickle Queen’ Preserves Everything, Including the Past", "description": "Usha Prabakaran’s 20-year-old cookbook, crammed with recipes from home cooks, is simple and self-published. But it has become a cult classic in India.", "url": "https://www.nytimes.com/2020/01/06/dining/indian-pickle-queen-usha-prabakaran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/dining/00pickle01/00pickle01-facebookJumbo-v2.jpg", "publishedAt": "2020-01-06T17:24:47Z", "content": "The reason for writing the book was to ensure that the vast culinary heritage of this land stays on the map, she said.\r\nTo broaden her sweep as she researched, she turned everyone she met into a source: friends, family, their colleagues, cooks working in midd… [+1254 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sui-Lee Wee and Vivian Wang", "title": "China Grapples With Mystery Pneumonia-Like Illness", "description": "Beijing is racing to identify a new illness that has sickened 59 people as it tries to calm a nervous public.", "url": "https://www.nytimes.com/2020/01/06/world/asia/china-SARS-pneumonialike.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06china-illness/06china-illness-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:14:51Z", "content": "Chinese health officials at first appeared to close guarding information about the illness. The Wuhan government confirmed on Dec. 31 that health authorities were treating dozens of cases of pneumonia of unknown cause only after an emergency notice to city ho… [+1665 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Victor Mather", "title": "Dallas Cowboys, After a Long Divorce, Commit to Mike McCarthy as Coach - The New York Times", "description": "Dallas Cowboys, After a Long Divorce, Commit to Mike McCarthy as Coach The New York Times Cowboys reportedly agree to make Mike McCarthy new coach Yahoo Sports The Mike McCarthy hire makes sense for the Cowboys. But it’s not quite a home run. The Washington P…", "url": "https://www.nytimes.com/2020/01/06/sports/football/mike-mccarthy-jerry-jones-cowboys.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/sports/06cowboysWEB1/06cowboysWEB1-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:10:00Z", "content": "The longtime Green Bay Packers coach Mike McCarthy will return to football as the coach of the Dallas Cowboys, according to multiplenewsmedia accounts.\r\nMcCarthy, 56, coached the Packers for almost 13 seasons, catching the end of the Brett Favre era and usher… [+629 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Coral Davenport", "title": "New E.P.A. Rule Would Reduce Truck Pollution — and Avert Tougher State Controls", "description": "The E.P.A. opened an effort to cut  pollution from trucks, an anomaly for an administration known for regulatory rollbacks but a move that would also pre-empt state rules.", "url": "https://www.nytimes.com/2020/01/06/climate/trump-truck-pollution.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/climate/06CLI-TRUCKS1/06CLI-TRUCKS1-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:09:15Z", "content": "Although the law does not require the agency to update the rule, the Obama administrations E.P.A. began examining a tighter standard after multiple states and public health organizations like the American Lung Association petitioned to cut emissions an additi… [+1638 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jon Caramanica", "title": "It’s Got a Great Beat, and You Can File a Lawsuit to It", "description": "Pop music isn’t made in a vacuum. Copying isn’t always bad. And a new trend pulling more pop stars into courtrooms is a dangerous one.", "url": "https://www.nytimes.com/2020/01/06/arts/music/pop-music-songs-lawsuits.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/arts/06pop-caramanica/06pop-caramanica-facebookJumbo.jpg", "publishedAt": "2020-01-06T17:00:08Z", "content": "In these situations, the alleged source song was a popular one the case could be made that even if there was no direct influence, there was an ambient one. Copyright law makes no distinction between conscious and unconscious copying, which means that even tho… [+1479 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Fandos, Michael S. Schmidt", "title": "Bolton Says He Is Willing to Testify in Impeachment Trial - The New York Times", "description": "Bolton Says He Is Willing to Testify in Impeachment Trial The New York Times Bolton willing to testify in Senate impeachment trial if subpoenaed NBCNews.com John Bolton says he will testify in Trump's impeachment trial if the Senate subpoenas him CNBC View fu…", "url": "https://www.nytimes.com/2020/01/06/us/politics/bolton-testify-impeachment-trial.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/us/politics/06dc-impeach-sub/06dc-impeach-sub-facebookJumbo.jpg", "publishedAt": "2020-01-06T16:56:00Z", "content": "That could fundamentally change the dynamics around the impeachment trial in the Senate, where a two-thirds vote 67 senators is needed to remove Mr. Trump. Democrats, the minority party, control 45 seats.\r\nSpeaker Nancy Pelosi has so far declined to send the … [+1312 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jan Ransom", "title": "Judge Deals Blow to Weinstein, Ruling Disgraced Detective Cannot Testify", "description": "Protesters met the movie producer as he hobbled with a walker into state court in Manhattan to face rape charges.", "url": "https://www.nytimes.com/2020/01/06/nyregion/harvey-weinstein-trial.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/nyregion/06Weinstein/06Weinstein-facebookJumbo.jpg", "publishedAt": "2020-01-06T16:44:29Z", "content": "A judge dealt a blow to Harvey Weinsteins defense on Monday, ruling that it cannot call as a witness the disgraced detective who withheld evidence favorable to the defense from prosecutors.\r\nMr. Weinsteins lawyers had hoped to call the detective, Nicholas DiG… [+712 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tracey Tully", "title": "Amy Kennedy Joins N.J. Race to Defeat Van Drew, Who Switched Parties - The New York Times", "description": "Amy Kennedy Joins N.J. Race to Defeat Van Drew, Who Switched Parties The New York Times Amy Kennedy running against NJ Rep. Van Drew, who switched parties over impeachment New York Post Amy Kennedy announces bid for N.J. House seat held by Van Drew, who switc…", "url": "https://www.nytimes.com/2020/01/06/nyregion/amy-kennedy-jeff-van-drew.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/nyregion/00njkennedy/00njkennedy-facebookJumbo.jpg", "publishedAt": "2020-01-06T16:38:00Z", "content": "We continue to ignore the biggest public health emergency of our time the mental health and addiction crisis that affects virtually every family, she said. \r\nShe added, People in South Jersey cant find good jobs, but the richest corporations pay almost no tax… [+1010 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tara Siegel Bernard", "title": "Opening the door to unicorns invites risk for average investors", "description": "The nation’s top securities regulator is contemplating how to let ordinary people get in on companies before they go public.", "url": "https://www.nytimes.com/2020/01/03/your-money/investing-private-market-startups.html", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2019/03/03142019_stocktriomarch_tzr_tzr_100540-780x501.jpg", "publishedAt": "2020-01-06T16:01:26Z", "content": "Many investors may have fantasized about those if only investments. If only I had invested in Peloton. Or Uber. Or Lyft.\r\nFor most people, though, thats not possible and not just because they dont have a million dollars to drop on a billion-dollar idea. Under… [+7035 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Denise Grady", "title": "A.I. Comes to the Operating Room", "description": "Images made by lasers and read by computers can help speed up the diagnosis of brain tumors during surgery.", "url": "https://www.nytimes.com/2020/01/06/health/artificial-intelligence-brain-cancer.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/science/06AI-BRAIN-still/06AI-BRAIN-still-facebookJumbo.jpg", "publishedAt": "2020-01-06T16:00:10Z", "content": "The result was a draw: humans, 93.9 percent correct; A.I., 94.6 percent.\r\nThe study was paid for by the National Cancer Institute, the University of Michigan and private foundations. Dr. Orringer owns stock in the company that made the imaging system, as do s… [+1862 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Johnny Diaz", "title": "Police Investigating the Release of Bedbugs at a Walmart", "description": "Pill bottles filled with bedbugs were left inside a Pennsylvania Walmart, the authorities said.", "url": "https://www.nytimes.com/2020/01/06/us/bed-bugs-walmart.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/multimedia/06xp-bedbugs/06xp-bedbugs-facebookJumbo.jpg", "publishedAt": "2020-01-06T16:00:04Z", "content": "On Saturday, a Walmart employee found a second closed pill bottle with several dead bugs on the floor of the mens department, near the belts, the police said. \r\nA trooper collected that bottle for fingerprints, Trooper Cindy Schick, a Pennsylvania State Polic… [+724 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Timothy Williams", "title": "Democrats, Newly Dominant in Virginia, Race to Make New Laws", "description": "Most state legislatures are dominated by Republicans, but Democrats have gained ground in several states since President Trump’s election.", "url": "https://www.nytimes.com/2020/01/06/us/virginia-state-legislature.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/us/06VIRGINIA-RUSH-capitol/06VIRGINIA-RUSH-capitol-facebookJumbo.jpg", "publishedAt": "2020-01-06T15:55:05Z", "content": "Democrats may find that control of state government does not always translate into overwhelming legislative success, political analysts said.\r\nIn most places, having Democratic unified control is not carte blanche to enact a progressive policy agenda, said Sa… [+1628 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sam Sifton", "title": "Time to Cook", "description": "It’s a new year, top of the quarter. Make dishes that’ll make you feel better: grilled cheeses with tomato soup, an easy chicken noodle soup, or braised tofu.", "url": "https://www.nytimes.com/2020/01/06/dining/time-to-cook.html", "urlToImage": "https://static01.nyt.com/images/2019/12/23/dining/aw-easiest-chicken-noodle-soup/aw-easiest-chicken-noodle-soup-facebookJumbo-v2.jpg", "publishedAt": "2020-01-06T15:30:00Z", "content": "Good morning. Welcome back. It was nice there for a while, everything operating at about 60 percent capacity, like an easy drive through Berlin to Paris Bar for Champagne and fries, everyone smiling, everyone in sweaters, everyone chill. Now its a new year, t… [+1416 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "The Best and the Worst of the Golden Globes", "description": "The night veered from snarky to earnest, from climate change to … eyebrows? Yep, it got weird.", "url": "https://www.nytimes.com/2020/01/06/movies/golden-globes-best-worst.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-06T15:20:23Z", "content": "The 88 voting members of the Hollywood Foreign Press Association have worked hard in recent years to overcome their batty reputation, but they can still be their own worst enemies. Citing concern for the environment, they served a Globes dinner on Sunday that… [+837 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Victor J. Blue", "title": "Holding Tight to a Racing Tradition", "description": "Indian Relay, a type of bareback horse racing practiced by Native American tribes in the plains states, blends heritage and danger. For one family, it’s a shared passion that means everything.", "url": "https://www.nytimes.com/2020/01/06/sports/indian-relay-lakota.html", "urlToImage": "https://static01.nyt.com/images/2019/11/28/sports/00indian-relay-01/merlin_160989537_856226fe-1075-4cfa-9230-7b18e8d9ed46-facebookJumbo.jpg", "publishedAt": "2020-01-06T15:17:04Z", "content": "The first heat goes well for the Long Feathers. The exchanges are smooth, and Jace runs hard for second place but is caught at the wire and finishes third. It is good enough to secure a spot in the Sundays championship race, but Jace knows it wont be easy. Te… [+640 chars]"}]}