{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Adam Satariano", "title": "At the Edge of the World, a New Battleground for the U.S. and China", "description": "The Faroe Islands have become perhaps the most unexpected place for the United States and China to tussle over the Chinese tech giant Huawei.", "url": "https://www.nytimes.com/2019/12/20/technology/faroe-islands-huawei-china-us.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/business/00huawei-faroe2/00huawei-faroe2-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:56:26Z", "content": "For more than a year, American officials have applied pressure on Britain, Germany, Poland and others to follow its lead in banning Huawei from new 5G networks. They argue the company can be used by Chinas Communist Party to spy or sabotage critical networks.… [+970 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David Stout", "title": "Ward Just, 84, Dies; Ex-Journalist Found Larger Truths in Fiction", "description": "After covering the Vietnam War and Washington, Mr. Just turned to writing novels that probed American society.", "url": "https://www.nytimes.com/2019/12/20/books/ward-just-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/obituaries/00Just/00Just-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:45:22Z", "content": "In the 2017 interview, Mr. Just said he stayed in the newspaper business for about a year too long. Those final months were spent writing editorials for The Washington Post. I felt silly commenting on news instead of digging it out, he said.\r\nMr. Justs first … [+1860 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Japan Partially Reverses Curbs on Tech Materials Exports to South Korea - The New York Times", "description": "The Japanese government has reversed curbs on exports of photoresists to South Korea, one of three technology materials which it had restricted since July, a Trade Ministry official said on Friday.", "url": "https://www.nytimes.com/reuters/2019/12/20/technology/20reuters-southkorea-japan.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-20T16:21:25Z", "content": "TOKYO/SEOUL The Japanese government has reversed curbs on exports of photoresists to South Korea, one of three technology materials which it had restricted since July, a Trade Ministry official said on Friday.\r\nThe step comes as Prime Minister Shinzo Abe and … [+584 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aidan Gardiner", "title": "Iranian Families Divided by the Trump Travel Ban Tell of Holidays Apart and Lives on Hold", "description": "Readers in the United States with ties to Iran share how they have been affected by President Trump’s travel ban.", "url": "https://www.nytimes.com/2019/12/20/reader-center/trump_travel_ban.html", "urlToImage": "https://static01.nyt.com/images/2019/12/10/insider/10readers-smith/10readers-smith-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:20:31Z", "content": "Below is a selection of responses, lightly edited, from readers in Iran or withfamily there. Because of concerns over their immigration status, some requested to use only their first names or their initials.\r\nMasoud Abdi, of Savoy, Ill., is a doctor and a leg… [+648 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Billy Witz", "title": "Women Dominate This Sport. Why Is the Coaching a Boys’ Club?", "description": "A female head coach has yet to win a national title in Division I women’s volleyball. This season’s semifinalists? All coached by men.", "url": "https://www.nytimes.com/2019/12/20/sports/volleyball-ncaa-women.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/sports/20volleyball01/20volleyball01-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:09:04Z", "content": "Though volleyball is the most popular team sport for high school girls nationwide and was played last year by nearly 18,000 women in all N.C.A.A. divisions, fewer than half of Division I coaches are women and that 46 percent is slightly less than it was a dec… [+1275 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ivan Nechepurenko", "title": "Gun Enthusiast Is Identified as Russian Spy Agency’s Attacker", "description": "The gunman was identified by Russian news outlets as a 39-year-old loner who owned seven rifles.", "url": "https://www.nytimes.com/2019/12/20/world/europe/fsb-shooting-russia.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/world/20russia-shooter/merlin_166218072_47e92744-ec20-4978-974e-018c522d67e5-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:07:08Z", "content": "In an interview with Komsomolskaya Pravda, a popular Russian tabloid, Mr. Manyurovs mother, Svetlana, described him as a private person who worked for a series of security companies. Mr. Manyurov had seven rifles, all registered under his name, Komsomolskaya … [+930 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ronda Kaysen", "title": "Follow Every Step of a Major Midcentury Modern Renovation", "description": "In 1948, it was a ‘daring project,’ but the next 70 years weren’t kind. A Connecticut couple’s plan was to rescue and update it — and to survive the process.", "url": "https://www.nytimes.com/2019/12/20/realestate/follow-every-step-of-a-major-midcentury-modern-renovation.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/realestate/20RENOVATIONS-slide-6DHV/20RENOVATIONS-slide-6DHV-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:04:16Z", "content": "They are unique in the way that they undulate, Mr. Reidy said. Most doors dont do that.\r\nBut by 2017, few of them were operable, and the single-paned glass made the house drafty and cold. They needed to be updated, but the homeowners did not want to sacrifice… [+1699 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Farhad Manjoo, Kara Swisher and Adam Westbrook", "title": "You Should Be Freaking Out About Privacy", "description": "Nothing to hide, nothing to fear? Think again", "url": "https://www.nytimes.com/2019/12/20/opinion/privacy-surveillance-video.html", "urlToImage": "https://static01.nyt.com/images/2019/10/28/autossell/Submission_layered/Submission_layered-facebookJumbo.png", "publishedAt": "2019-12-20T16:00:05Z", "content": "Weve published a lot of stories in the last year about privacy. Like, a lot. And almost every time we do, we hear a version of the same thing. It amazes me how often I hear from people, I have nothing to hide. I have nothing to fear from people spying on me. … [+11546 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jim Sensenbrenner", "title": "Why I Voted Against the Trump Impeachment", "description": "The investigation against President Clinton was thorough and nonpartisan. The Trump proceedings have been the opposite in every way.", "url": "https://www.nytimes.com/2019/12/20/opinion/trump-impeachment-sensenbrenner.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/opinion/20Sensenbrenner/20Sensenbrenner-facebookJumbo.jpg", "publishedAt": "2019-12-20T16:00:05Z", "content": "Earlier this year, I wrote in The Wall Street Journal that an unfair process cannot lead us to true justice. The House impeachment inquiry and process was unfair, and therefore unjust.\r\nA majority of my constituents in Wisconsin a key battleground state do no… [+1979 chars]"}]}