{"status": "ok", "totalResults": 33, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mariel Padilla", "title": "New Jersey Is Third State to Ban Discrimination Based on Hair", "description": "“No one should be made to feel uncomfortable or be discriminated against because of their natural hair,” Gov. Phil Murphy said.", "url": "https://www.nytimes.com/2019/12/20/us/nj-hair-discrimination.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/multimedia/20xp-hairdiscrimination/merlin_148832682_4942671e-fa5c-4549-b25f-5cc3431cfc4c-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:59:19Z", "content": "A referee told Mr. Johnson that his hair and the hair cover he was wearing violated wrestling rules. A video capturing Mr. Johnsons hurried, last-minute haircut drew widespread attention and prompted a civil rights investigation by the New Jersey Division on … [+1368 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Rory Smith", "title": "He Can Have Any Job He Wants. Right Now, He Doesn’t Want One.", "description": "Massimiliano Allegri is one of soccer’s top free agents. But he says he will only coach again when he is ready, and only when the job is right.", "url": "https://www.nytimes.com/2019/12/19/sports/soccer/massimiliano-allegri-juventus-italy.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/sports/19allegri1/19allegri1-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:57:20Z", "content": "Over these last few months, though, he has been able to watch five or six games a week, from all over Europe. He has been most impressed, he said, by Liverpool, the Premier League leader. He is fulsome in his praise of the work its coach, Jürgen Klopp, has do… [+1422 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Farah Stockman", "title": "Mrs. Claus, Yes. Elves and Grinches, No. When Santa Meets Identity Politics.", "description": "It used to be easy for the International Brotherhood of Real Bearded Santas to know who could become a member. No more.", "url": "https://www.nytimes.com/2019/12/20/us/santa-claus-international-brotherhood-members.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/00santas-01alt/00santas-01alt-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:51:32Z", "content": "For years, there wasnt much confusion about who could join the International Brotherhood of Real Bearded Santas, the largest membership organization of Santas in the world. It was open only to men with whiskers long enough to be styled like St. Nicks, which c… [+1196 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Cade Metz", "title": "Randy Suess, Computer Bulletin Board Inventor, Dies at 74", "description": "The messaging system that he and a friend created in 1978 was a forerunner of social media services like Twitter, Facebook and YouTube.", "url": "https://www.nytimes.com/2019/12/20/technology/randy-suess-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/obituaries/20Suess1/20Suess1-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:41:38Z", "content": "Everything we do in terms of communicating with other people online can be traced back to Randy and his bulletin board, said Jason Scott, a computer history archivist who made an online documentary about the creation of C.B.B.S. The only difference is that no… [+1931 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Russia, Backed by China, Casts 14th U.N. Veto on Syria to Block Cross-Border Aid", "description": "Russia, backed by China, on Friday cast its 14th U.N. Security Council veto since the start of the Syrian conflict in 2011 to block cross-border aid deliveries from Turkey and Iraq to millions of Syrian civilians.", "url": "https://www.nytimes.com/reuters/2019/12/20/world/europe/20reuters-syria-security-un.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-20T23:40:02Z", "content": "The council then voted on the rival Russian draft resolution that would have approved the two Turkish crossing points for six months, but it failed with only five votes in favor, six against and four abstentions. \r\n\"Who won today? Nobody. Who lost? The Syrian… [+1002 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Frank Bruni", "title": "Bruni: Pete Buttigieg and the parable of the wine cave", "description": "That’s the hell of this primary: There’s talent galore. But with each talented candidate comes serious shortcomings, and there’s just no clear answer to which of them would be Trump’s fiercest adversary.", "url": "http://www.nytimes.com/2019/12/20/opinion/wine-cave-debate.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2019/12/AP19354057620165.jpg?w=1024&h=640", "publishedAt": "2019-12-20T23:29:13Z", "content": "Does the road to the White House run through a wine cave?\r\nThat was the question that electrified the Democratic debate in Los Angeles on Thursday. It was specific, referring to the location of a recent fundraiser that Pete Buttigieg had held in Napa Valley.\r… [+6952 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Lara Jakes and Anatoly Kurmanaev", "title": "U.S. Accuses Venezuela’s President of Rigging Coming Vote", "description": "At stake is control of the country’s National Assembly, which is controlled by the opposition leader Juan Guaidó, who has accused President Nicolás Maduro of corruption.", "url": "https://www.nytimes.com/2019/12/20/us/politics/venezuela-election-bribery.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20dc-diplo/20dc-diplo-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:12:11Z", "content": "The Jan. 5 vote is crucial to determining whether Mr. Guaidó will continue to claim Venezuelas presidency and keep up the international pressure on Mr. Maduro.\r\nMr. Guaidó declared himself the interim president until the new general elections can be held, a r… [+1777 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jim Tankersley", "title": "Treasury Finalizes Rules for Opportunity Zone Tax Breaks", "description": "The regulations will allow a wider group of investors to profit from the 2017 tax provision that was pitched as a boon to low-income areas.", "url": "https://www.nytimes.com/2019/12/20/business/treasury-finalizes-rules-for-opportunity-zone-tax-breaks.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/business/20dc-zones/20dc-zones-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:11:30Z", "content": "Critics said Treasurys regulations did not address a fundamental flaw with the zones, which lack legal guidelines to ensure the investments actually benefit low-income areas and residents. Senator Ron Wyden, an Oregon Democrat who has introduced legislation t… [+1579 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Bret Stephens", "title": "This Decade of Disillusion", "description": "Why and how the young rule our time.", "url": "https://www.nytimes.com/2019/12/20/opinion/decade-millennials.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/opinion/20Stephens/20Stephens-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:08:34Z", "content": "Technology had another effect: It vastly accelerated the speed with which previously outlying ideas became, in the hands of their mainly youthful advocates, moral certitudes.\r\nSome of those ideas, like marriage equality (the single greatest moral victory of t… [+1677 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Roger Cohen", "title": "A Longing for the Lost Landline", "description": "In the landline world there was down time. You left home, you looked around, you saw people, you daydreamed.", "url": "https://www.nytimes.com/2019/12/20/opinion/landine-phone.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/opinion/20cohenWeb/20cohenWeb-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:04:13Z", "content": "Landlines provided connections that were stable and seemed real, in contrast to cellphone conversations, with their enervating interruptions because of lost reception. The cellphone introduced redialing, sometimes multiple times. The time lost (and the argume… [+1939 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sydney Ember and Reid J. Epstein", "title": "Democratic Debate Clashes Had a Common Denominator: Iowa", "description": "Elizabeth Warren, Pete Buttigieg and Amy Klobuchar are trying to knock each other out in the Iowa caucuses, where they need strong finishes to stay viable in the 2020 race.", "url": "https://www.nytimes.com/2019/12/20/us/politics/iowa-caucuses-democratic-debate.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20Dems1/20Dems1-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:03:39Z", "content": "Mr. Buttigiegs aides and allies dont think the attacks from Ms. Warren on fund-raising and Ms. Klobuchar on experience will damage the South Bend mayor. Much of his rise was powered by his big-money fund-raising and for many of his supporters, his lack of exp… [+1861 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Remy Tumin and Hiroko Masuike", "title": "Starliner, Democratic Party, Holidays: Your Friday Evening Briefing", "description": "Here’s what you need to know at the end of the day.", "url": "https://www.nytimes.com/2019/12/20/briefing/starliner-democratic-party-holidays.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/briefing/122019evening-briefing-promo/122019evening-briefing-promo-facebookJumbo.jpg", "publishedAt": "2019-12-20T23:02:09Z", "content": "10. And finally, the decade in pictures.\r\nAs we close out the final days of the 2010s, our photo editors pored over 10 years of images that tell the story of the past decade. A lot has happened. The Times managing editor Joe Kahn described it as a decade of u… [+699 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tariq Panja", "title": "The Game Was on TV. The Beer Was on Ice. So Why Were Fans Uneasy?", "description": "A global soccer championship has been a crucial test of Qatar’s tolerance for thousands of visiting fans accustomed to mixing matches with alcohol.", "url": "https://www.nytimes.com/2019/12/20/sports/soccer/qatar-soccer-alcohol.html", "urlToImage": "https://static01.nyt.com/images/2019/12/21/sports/20soccer-beer-print/20soccer-beer-02-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:56:14Z", "content": "At a table at one of the cafes, a group of Flamengo fans chatted about the differences between their trip to Doha and the one they had taken last month to Lima, Peru, for the final of the South American championship, the Copa Libertadores. There, the entire c… [+2242 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Lesley Stockton", "title": "5 Holiday Dinner Guest Tips No One Taught You", "description": "Be a splendid companion this holiday season and New Year.", "url": "https://www.nytimes.com/2019/12/20/smarter-living/wirecutter/5-holiday-dinner-guest-tips-no-one-taught-you.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/smarter-living/wc-guest/wc-guest-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:30:04Z", "content": "If youre bringing a dish to a potluck, dont surprise your host with a cold casserole. Please bring your dish warm theres never enough oven space, said Ms. Sins. But if thats not possible, Sins suggests coordinating with the host a few days ahead to secure a s… [+1750 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Hale", "title": "The 30 Best International TV Shows of the Decade", "description": "The 2010s saw a radical shift in the trade balance when it comes to television series. Our critic counts down the finest imports, from “Fleabag” to “Strong Girl Bong-soon.”", "url": "https://www.nytimes.com/2019/12/20/arts/television/best-international-tv-shows.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/arts/00international-tv-decade-promo/00international-tv-decade-promo-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:29:48Z", "content": "The nimble inventiveness of the shows creators, Steven Moffat and Mark Gatiss, and the superbly assured and clever work of its stars, Benedict Cumberbatch and Martin Freeman, made this modern retelling of the Sherlock Holmes stories the most smartly entertain… [+952 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kyle Buchanan", "title": "Every Musical Number in ‘Cats,’ Ranked from ‘Huh?’ to ‘What???’", "description": "Is this an actual article, or merely one journalist’s attempt to reconnect the pieces of his broken brain after seeing ‘Cats’? Yes.", "url": "https://www.nytimes.com/2019/12/20/movies/cats-songs-ranked.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/arts/20cats-ranking1/merlin_166030263_5224734f-8313-4924-94d5-d76fa810c295-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:26:33Z", "content": "When the movie is more than halfway over, suddenly Ian McKellen appears and is so genuinely wonderful funny, poignant and feline in a way that finally feels right that you may start to wonder, What if the whole movie were like this? Could there have been a ve… [+2464 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Levenson", "title": "Military Says Hand Gestures at Game Were Not White Power Signs", "description": "West Point and Naval Academy investigations found that cadets and midshipmen were playing “the circle game” during an ESPN broadcast of the Army-Navy game on Saturday.", "url": "https://www.nytimes.com/2019/12/20/us/army-navy-circle-game.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/multimedia/20xp-handgestures/20xp-handgestures-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:21:25Z", "content": "Last Saturday we had reason to believe these actions were an innocent game and not linked to extremism, but we must take allegations such as these very seriously, he said in the statement. We are disappointed by the immature behavior of the cadets.\r\nThe objec… [+1479 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Gina Kolata", "title": "Alzheimer’s Tests Soon May Be Common. Should You Get One?", "description": "Diagnostic tests for Alzheimer’s disease are already here. But the results may raise as many questions as they answer.", "url": "https://www.nytimes.com/2019/12/20/health/alzheimers-disease-diagnosis.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/science/20SCI-ALZHEIMERS01/20SCI-ALZHEIMERS01-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:19:59Z", "content": "So he received brain scans for beta amyloid and took cognitive tests. He knew that in people like him with mild memory problems, the combination can cinch a diagnosis.\r\nThe result? He was in the early stages of Alzheimers disease.\r\nNow he worries about his fu… [+1263 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sarah Mervosh, Campbell Robertson and Mike Baker", "title": "‘How? How? How?’: Victims’ Families Rage as Matt Bevin Defends Pardons", "description": "Prosecutors cried foul. A mother collapsed to the floor. The outgoing Kentucky governor’s clemency decisions have caused widespread outrage.", "url": "https://www.nytimes.com/2019/12/20/us/kentucky-governor-matt-bevin-pardons.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/20KENTUCKY-topalt/20KENTUCKY-topalt-facebookJumbo.jpg", "publishedAt": "2019-12-20T22:04:12Z", "content": "With days and hours to get this done, we didnt think we could launch an innocence project, said John Tilley, the head of Mr. Bevins cabinet on justice and public safety. \r\nIn at least a handful of cases where Mr. Bevin saw clarity, there was far from unanimou… [+1336 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Karen Zraick", "title": "New Zealand Ban on Most Semiautomatic Weapons Takes Effect", "description": "The law, passed after the Christchurch massacre in March, outlaws military-style semiautomatic weapons and assault rifles. It will be enforced as a gun buyback and amnesty program ends amid debate.", "url": "https://www.nytimes.com/2019/12/20/world/australia/new-zealand-gun-ban.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/multimedia/20xp-newzealand/merlin_153354291_1c069621-36de-4006-9c6a-8610cab36976-facebookJumbo.jpg", "publishedAt": "2019-12-20T21:57:53Z", "content": "On the same television program, Mr. Nash said that he believed that the majority of banned weapons had been handed in. A widely reported estimate by the accounting firm KPMG, calculated on behalf of the government, had put the number of now-illegal weapons at… [+1666 chars]"}]}