{"status": "ok", "totalResults": 27, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Catie Edmondson", "title": "Pelosi Announces Vote to Limit Trump’s War-Making Power Against Iran", "description": "The House is expected to vote on Thursday on a resolution to force the president to halt any military action against Iran unless Congress authorizes it.", "url": "https://www.nytimes.com/2020/01/08/us/politics/nancy-pelosi-trump-iran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/us/politics/08dc-cong-1/merlin_166844997_582de541-0241-4845-b82c-ed06ffd153f8-facebookJumbo.jpg", "publishedAt": "2020-01-08T21:14:57Z", "content": "After a dizzying pace of developments in Washington unfolded overnight missile strikes on Tuesday night on bases in Iraq where American troops are stationed, followed by Mr. Trumps speech and a set of classified briefings by administration officials on Capito… [+1199 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dina Esfandiary", "title": "Iran Lets Trump Avoid a War", "description": "After a few days of quiet, Iran carried out its promised “severe revenge” for the United States’ killing of Maj. Gen. Qassim Suleimani last week. On Wednesday morning in the Middle East, Iran’s Islamic Revolutionary Guard Corps launched 22 missiles at two Ame…", "url": "https://www.nytimes.com/2020/01/08/opinion/iran-missile-attack-us.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/opinion/08esfandiary/08esfandiary-facebookJumbo.jpg", "publishedAt": "2020-01-08T21:11:00Z", "content": "Still, it seems that the attack on Wednesday was intended as a warning rather than real retribution. Prime Minister Adel Abdul Mahdi of Iraq said that Tehran had warned him that the missiles were coming; reports say he passed that information on to American a… [+1829 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Hafner", "title": "Peter Kirstein, Father of the European Internet, Is Dead at 86", "description": "He was crucial to the spread of the protocols that underpin today’s internet (and gave Queen Elizabeth her own email address).", "url": "https://www.nytimes.com/2020/01/08/technology/peter-kirstein-dead.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/obituaries/08Kirstein1/08Kirstein1-facebookJumbo.jpg", "publishedAt": "2020-01-08T20:58:17Z", "content": "His father belonged to an exclusive yacht club in Berlin. \r\nAs early as 1931, the secretary of the club said, You cant be very happy here with people like Joachim von Ribbentrop and Hermann Göring in the club, Professor Kirstein said. It wasnt until they said… [+1497 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Don’t Blame Mental Illness", "description": "A psychiatrist is troubled by statements in an Op-Ed article linking anti-Semitic violence to mental health problems. Also: Progress on public schools; tips for the hard of hearing.", "url": "https://www.nytimes.com/2020/01/08/opinion/letters/mental-illness.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/opinion/31silber/31silber-facebookJumbo.jpg", "publishedAt": "2020-01-08T20:30:13Z", "content": "To the Editor:\r\nRe For Brain Health, Correct Mild Hearing Loss, by Jane E. Brody (Personal Health, Dec. 31):\r\nAs one who has studied hearing-related difficulties for 30 years, I heartily agree that if you suspect hearing loss, dont let vanity (Im too young fo… [+1097 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "An Attack by Iran, Then an Easing of Tensions", "description": "Writers discuss the attack on American air bases and the speech by President Trump.", "url": "https://www.nytimes.com/2020/01/08/opinion/letters/us-iran-trump.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/us/politics/08dc-prexy-sub1/08dc-prexy-sub1-facebookJumbo-v3.jpg", "publishedAt": "2020-01-08T20:11:59Z", "content": "Jeffery DonaldsonLas Vegas\r\nTo the Editor:\r\nI am thankful that at least for now, President Trump seems to be backing off from engaging in further provocation of our implacable foe, Iran. Obviously, some reasonable individual has gotten through to him that to … [+1361 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Astead W. Herndon", "title": "How Elizabeth Warren Is Being Squeezed by the Left and Center", "description": "Ms. Warren is figuring out what candidates like Beto O’Rourke, Kamala Harris and Kirsten Gillibrand have already learned: It’s hard to appeal to the two main factions of the Democratic Party.", "url": "https://www.nytimes.com/2020/01/08/us/politics/elizabeth-warren-campaign.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/us/politics/08warren-squeeze1/08warren-squeeze1-facebookJumbo.jpg", "publishedAt": "2020-01-08T20:00:14Z", "content": "Wallace Watson, a 52-year-old who attended her rally over the weekend in Dubuque, Iowa, said he decided to support Ms. Warren months ago because he saw her as the only candidate who could energize both voters who backed Mr. Sanders in 2016 and those who suppo… [+2439 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Molly Oswaks", "title": "Elizabeth Wurtzel Was a Great Writer and a Better Friend", "description": "Before we met, she was my idol. Once we became close, Lizzie enriched my work and life in new ways.", "url": "https://www.nytimes.com/2020/01/08/opinion/elizabeth-wurtzel.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/opinion/08Oswaks/08Oswaks-facebookJumbo.jpg", "publishedAt": "2020-01-08T20:00:09Z", "content": "She was also by this time clean from hard drugs, having written in a second memoir about her struggles with addiction. But she loved to open a bottle of red wine and listen to records and talk for hours, often offering unsolicited and highly questionable advi… [+1922 chars]"}]}