{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Perri Klass, M.D", "title": "Advice for College Students Studying Abroad, and Their Parents", "description": "Students take challenges along when they spend a semester abroad and need to be prepared to take care of themselves in a new setting and a new language.", "url": "https://www.nytimes.com/2019/12/16/well/family/advice-for-college-students-studying-abroad-and-their-parents.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/well/16klass/16klass-facebookJumbo.jpg", "publishedAt": "2019-12-16T10:00:05Z", "content": "Any student with a medical problem, of course, should bring along relevant records, should ask about the availability of specialists if theyre needed, and should perhaps see if a home doctor would be willing to be called by a foreign doctor if problems arise.… [+1914 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Julia Phillips", "title": "After Her Heart Stops Beating, a Woman Continues to Think", "description": "In “10 Minutes 38 Seconds in This Strange World,” a finalist for the Booker Prize by Elif Shafak, the narrator recalls her life in the minutes before she dies.", "url": "https://www.nytimes.com/2019/12/16/books/review/10-minutes-38-seconds-in-this-strange-world-elif-shafak.html", "urlToImage": "https://static01.nyt.com/images/2019/10/30/books/review/Phillips1/Phillips1-facebookJumbo.jpg", "publishedAt": "2019-12-16T10:00:04Z", "content": "10 MINUTES 38 SECONDS IN THIS STRANGE WORLDBy Elif Shafak\r\nThe Booker Prize became one of the worlds most prestigious awards for fiction by setting for itself one of literary criticisms loftiest goals: to recognize the years best novel written in English. Bes… [+2381 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dwight Garner", "title": "Moments in Reading That Salvaged an Often Sour Year", "description": "The critic Dwight Garner recalls the scenes, observations and one-liners in books that stuck with him in 2019.", "url": "https://www.nytimes.com/2019/12/16/books/favorite-reading-moments-of-2019.html", "urlToImage": "https://static01.nyt.com/images/2019/12/12/books/16Garner-essay/00Dwight-facebookJumbo.jpg", "publishedAt": "2019-12-16T10:00:04Z", "content": "Even the food writing in 2019 was a bit bruised. In Peter Orners new collection of stories, Maggie Brown &amp; Others, he wrote: Only human beings could make a party out of boiling a few fellow creatures alive and then cracking their backs open.\r\nIn Smiths Sp… [+2104 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Graham Bowley", "title": "At Pulse Shooting Site, a Plan to Remember Renews Pain for Some", "description": "A museum and memorial are intended to honor the victims of the tragic Pulse nightclub killings in Florida, but some families and survivors have objected to the multimillion-dollar projects.", "url": "https://www.nytimes.com/2019/12/15/arts/pulse-shooting-memorial-plan-renews-pain-for-some.html", "urlToImage": "https://static01.nyt.com/images/2019/12/09/arts/00pulse9/00pulse9-facebookJumbo.jpg", "publishedAt": "2019-12-16T09:51:04Z", "content": "They are trying to make money off a tragic situation and trying to make this a tourist attraction when I myself need a lot of financial help, he said. I called. They just turned me down. They said they didnt have the funds to help any of the survivors or the … [+1129 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Luis Ferré-Sadurní", "title": "N.Y. Lawmakers Passed 935 Bills by June. Many Remain Unsigned.", "description": "A groundbreaking legislative session has hit pause, with a slew of legislation awaiting Gov. Andrew M. Cuomo’s signature or veto.", "url": "https://www.nytimes.com/2019/12/16/nyregion/ny-state-senate-assembly.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/nyregion/00nybills02/merlin_162855021_4d4f564c-2992-4575-b635-2001abef6a1a-facebookJumbo.jpg", "publishedAt": "2019-12-16T09:44:45Z", "content": "Some of the backlogged bills passed the Senate and Assembly with overwhelming support, including the e-scooter bill and measures to ensure higher wages for building service workers and to curb toxic chemicals in consumer products.\r\nThere are also seemingly le… [+1438 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Google Warns Turkish Partners Over New Android Phones Amid Dispute - The New York Times", "description": "Google has told its Turkish business partners it will not be able to work with them on new Android phones to be released in Turkey, after the Turkish competition board ruled that changes Google made to its contracts were not acceptable.", "url": "https://www.nytimes.com/reuters/2019/12/16/technology/16reuters-turkey-google.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-16T09:30:00Z", "content": "\"Consumers will be able to purchase existing device models and will be able to use their devices and applications normally. Google's other services will be unaffected,\" it said, adding that it was working with the authority to resolve the issue.\r\nGoogle made … [+871 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Najim Rahim and Mujib Mashal", "title": "An Afghan Warlord Escapes Arrest as Troops Turn City into War Zone", "description": "President Ashraf Ghani sent combat forces to capture a belligerent warlord, but many Afghans believed the deadly raid was a political stunt gone awry.", "url": "https://www.nytimes.com/2019/12/16/world/asia/afghanistan-Qaisari-arrest.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/world/16afghanistan-1/16afghanistan-1-facebookJumbo.jpg", "publishedAt": "2019-12-16T09:22:35Z", "content": "Mr. Qaisari was such a major criminal that all the risk was worth it, officials said. Still, months later, Mr. Qaisari was suddenly free, holding rallies in the north and conducting television interviews surrounded by the gun-toting guards that the government… [+1694 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jason Gutierrez", "title": "Searchers Try to Find Earthquake Victims in Philippines", "description": "Two bodies were pulled from the rubble of a collapsed store on Monday, but searchers were looking for more after the powerful quake in the south.", "url": "https://www.nytimes.com/2019/12/16/world/asia/philippines-earthquake.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/world/16philippines-1/16philippines-1-facebookJumbo.jpg", "publishedAt": "2019-12-16T09:17:44Z", "content": "The quake was the third with a magnitude of 6.5 or higher to hit the area since late October. The quake struck near the heavily urbanized Davao City, President Rodrigo Dutertes hometown, causing widespread panic there.\r\nNearly 200 aftershocks followed through… [+769 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "French Business Activity Stable in December Despite Pension Strike-PMI - The New York Times", "description": "French business grew at a steady pace in December despite a nationwide strike against pension reform, although activity in the manufacturing sector came unexpectedly close to stagnating, a survey showed on Monday.", "url": "https://www.nytimes.com/reuters/2019/12/16/business/16reuters-france-economy-pmi.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-16T08:21:00Z", "content": "While overall business confidence was nearly stable, it was because stronger services activity helped offset slower manufacturing growth.\r\n\"The latest PMI data pointed to further activity growth in the French private sector, but revealed disappointing results… [+536 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Keith Bradsher", "title": "Beijing Backs Hong Kong Leader Despite Election Setback", "description": "China’s premier endorses Hong Kong’s embattled leader, Carrie Lam, despite the rout of her political allies in local elections three weeks ago.", "url": "https://www.nytimes.com/2019/12/16/world/asia/beijing-hong-kong-protests-carrie-lam.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/world/16hongkong-promo/16hongkong-promo-facebookJumbo.jpg", "publishedAt": "2019-12-16T08:14:15Z", "content": "You have been leading the government in safeguarding social stability with the utmost effort, Mr. Li said to Mrs. Lam in a televised excerpt released by the Hong Kong government. He praised her for rolling out a series of measures to help businesses and stabi… [+1100 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tiffany Hsu", "title": "Netflix Shuns Commercials, but It’s Cozying Up to Brands", "description": "Tide Pod shout-outs onscreen. Flirtatious exchanges with companies on Twitter. Netflix may not run ads, but it has become a coveted marketing platform.", "url": "https://www.nytimes.com/2019/12/16/business/media/netflix-commercials.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/business/04jpnetflixads1-print/04netflixads04-facebookJumbo.jpg", "publishedAt": "2019-12-16T08:00:08Z", "content": "The same logic may extend to product placements. Netflix has typically left such decisions up to individual producers, saying in a statement that most of the brands that appear in shows and movies are added by creators who believe they add to the authenticity… [+1606 chars]"}]}