{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "Giants Cut Janoris Jenkins After He Used Slur in Twitter Exchange With a Fan", "description": "The team said the cornerback’s refusal to acknowledge his “offensive” language factored in his release.", "url": "https://www.nytimes.com/2019/12/13/sports/janoris-jenkins-tweet-giants.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/multimedia/13xp-jenkins/13xp-jenkins-facebookJumbo.jpg", "publishedAt": "2019-12-14T03:56:44Z", "content": "I Just want to thank the organization for the opportunity &amp; good luck to my brothers that remains a Giant! he wrote. Again, want my fans to know my intentions are always pure and genuine.\r\nJenkins, who goes by the nickname Jackrabbit, did not immediately … [+1091 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ted Loos", "title": "New York’s Newest Private Museum Is Tucked Away in Brooklyn", "description": "First he took Copenhagen and Beijing. Now, Danish dealer-turned-philanthropist Jens Faurschou is debuting his blue-chip collection in the borough’s Greenpoint section.", "url": "https://www.nytimes.com/2019/12/13/arts/design/Faurschou-New-York-private-museum.html", "urlToImage": "https://static01.nyt.com/images/2019/12/14/arts/13faurschou1/13faurschou1-facebookJumbo.jpg", "publishedAt": "2019-12-14T02:13:10Z", "content": "The Faurschou Foundations location is certainly distinct, on a block that is a study in Brooklyn gentrification. Theres a pizza place and an astrologer, but also sleek new residential buildings.\r\nAfter looking at spaces in Harlem, Mr. Faurschou landed three y… [+1227 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aimee Ortiz", "title": "JPMorgan Chase C.E.O. Says It Needs to Do More to Tackle Racism", "description": "The comments came days after The New York Times published a report detailing allegations of racism at branches of JPMorgan in the Phoenix area.", "url": "https://www.nytimes.com/2019/12/13/business/Jamie-Dimon-racism-chase.html", "urlToImage": "https://static01.nyt.com/images/2019/12/14/multimedia/13xp-dimon-print/13xp-dimon-facebookJumbo.jpg", "publishedAt": "2019-12-14T02:03:02Z", "content": "Jamie Dimon, the chairman and chief executive of JPMorgan Chase, on Friday tackled allegations of racism at the banking giant, telling employees that such behavior does not reflect who we are as a company and how we serve our clients and communities every day… [+643 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nikita Stewart", "title": "$625,000 Settlement for Woman Whose Child Was Torn From Her Arms", "description": "Jazmine Headley sued over a confrontation with New York City workers that was captured in a widely seen video.", "url": "https://www.nytimes.com/2019/12/13/nyregion/jazmine-headley-video-settlement.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/nyregion/00headley01/00headley01-facebookJumbo.jpg", "publishedAt": "2019-12-14T02:00:19Z", "content": "The steps that we said we would take that would mitigate the horrible things that happened to Ms. Headley have been taken, Steven Banks, the social services commissioner, said in an interview on Friday.\r\nMs. Headley had taken the day off from her job cleaning… [+1187 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Abdi Latif Dahir", "title": "Sudan’s Ousted Leader Faces Verdict in Corruption Trial", "description": "Omar Hassan al-Bashir, accused of genocide in Darfur, was overthrown in a popular uprising this year. He has been tried on corruption charges, but Sudanese ask, is it “real justice?”", "url": "https://www.nytimes.com/2019/12/13/world/africa/sudan-bashir-trial-verdict.html", "urlToImage": "https://static01.nyt.com/images/2019/12/15/world/15sudan/16sudan-facebookJumbo.jpg", "publishedAt": "2019-12-14T01:39:01Z", "content": "Nevertheless, the trial marks a pivotal moment in the fraught democratic transition of Sudan, a large, strategic state that serves as a bridge between north and sub-Saharan Africa. By facing the law, Mr. al-Bashir joins a list of reputedly despotic leaders wh… [+1729 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Bret Stephens", "title": "Britain’s Ominous Portent for Democrats", "description": "Warren and Sanders supporters should consider the fate of Jeremy Corbyn.", "url": "https://www.nytimes.com/2019/12/13/opinion/uk-elections.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/opinion/13stephensWEb/13stephensWEb-facebookJumbo.jpg", "publishedAt": "2019-12-14T01:17:15Z", "content": "How did he do this? In four ways, each of which has parallels with Trump.\r\nFirst, Johnson was fortunate in his political foes. He ran against the most avowedly leftist frontbench the Labour Party has put forward since the early 1980s. Labour leader Jeremy Cor… [+1895 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "McConnell, Coordinating With White House, Lays Plans for Impeachment Trial - The New York Times", "description": "McConnell, Coordinating With White House, Lays Plans for Impeachment Trial The New York Times View full coverage on Google News", "url": "https://www.nytimes.com/2019/12/13/us/politics/mcconnell-white-house-impeachment-trial.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/us/politics/13dc-senate-1/13dc-senate-2-facebookJumbo.jpg", "publishedAt": "2019-12-14T01:06:00Z", "content": "The talks are complicated, with a lot of variables: how long the trial will last; how much time each side will get to present its case; whether any witnesses will be called, and if so, how many; how documentary evidence will be handled; and so on. There are q… [+1693 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Exclusive: U.S. Agency Probes 12th Tesla Crash Tied to Possible Autopilot Use", "description": "The U.S. auto safety agency said on Friday it will investigate a 12th Tesla crash that may be tied to the vehicle's advanced Autopilot driver assistance system after a Tesla Model 3 rear-ended a parked police car in Connecticut last week.", "url": "https://www.nytimes.com/reuters/2019/12/13/business/13reuters-tesla-probe-expclusive.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-14T01:03:43Z", "content": "Tesla, which did not respond to requests for comment Friday, and the NHTSA both advise drivers that they must keep their hands on the steering wheel and pay attention at all times while using Autopilot. Tesla says Autopilot \"enables your car to steer, acceler… [+1119 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Heather Murphy", "title": "Hallmark Channel Pulls Zola Ads Featuring Brides Kissing", "description": "A spokesman for the channel said the lesbian couple’s P.D.A. violated its policies. Hallmark did not reject a similar ad featuring an opposite-sex couple.", "url": "https://www.nytimes.com/2019/12/13/style/hallmark-channel-ads.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/multimedia/13xp-hallmark/13xp-hallmark-facebookJumbo.jpg", "publishedAt": "2019-12-14T01:03:00Z", "content": "The Hallmark Channel spokesman suggested on Friday afternoon that the issue was the couples kissing. The decision not to air overt public displays of affection in our sponsored advertisement, regardless of the participants, is in line with our current policy,… [+1360 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Wisconsin Judge Says State Must Purge 200,000 Voter Registrations - The New York Times", "description": "Wisconsin Judge Says State Must Purge 200,000 Voter Registrations The New York Times More than 200,000 Wisconsin voters will be removed from the rolls | TheHill The Hill Judge orders 234,000 purged from Wisconsin voter rolls USA TODAY View full coverage on Go…", "url": "https://www.nytimes.com/2019/12/13/us/wisconsin-voter-rolls-purge.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/us/13Wisconsin/merlin_146415048_0d2757d1-4c74-4994-b013-c021292b90d6-facebookJumbo.jpg", "publishedAt": "2019-12-14T00:49:00Z", "content": "Those who did not respond to the letters were to be removed from the voting rolls, but not until 2021, state officials had indicated. But a conservative group, the Wisconsin Institute for Law &amp; Liberty, filed a lawsuit, saying that election officials were… [+1140 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Rogers", "title": "Despite Her ‘Be Best’ Campaign, Melania Trump Stays Mum as Husband Mocks Greta Thunberg", "description": "But Stephanie Grisham, the White House press secretary, said in a statement that the first lady communicates “differently” from President Trump.", "url": "https://www.nytimes.com/2019/12/13/us/politics/melania-trump-greta-thunberg.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/us/politics/13dc-bebest/merlin_165721467_358b20f8-1c3c-4579-9373-3c024bea8dee-facebookJumbo.jpg", "publishedAt": "2019-12-14T00:42:26Z", "content": "Pamela S. Karlan, a Stanford law professor testifying in support of Mr. Trumps impeachment, was trying to make a distinction between kings and presidents when she mentioned Mrs. Trumps son.\r\nThe Constitution says there can be no titles of nobility, she said. … [+784 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael D. Shear", "title": "The Breach Widens as Congress Nears a Partisan Impeachment", "description": "Fleeting efforts at persuasion by members of the Judiciary Committee gave way to disputes over basic facts during a marathon debate over articles of impeachment.", "url": "https://www.nytimes.com/2019/12/13/us/politics/impeachment-partisan-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/us/politics/13dc-assess1/13dc-assess1-facebookJumbo.jpg", "publishedAt": "2019-12-14T00:36:22Z", "content": "If this was a muddying the waters, yall are an E.P.A. hazardous waste site at this point, Mr. Collins snapped back.\r\nAfter three-and-a-half hours of opening statements on Wednesday, a marathon session on Thursday seemed like it would never finish as both side… [+1558 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sarah Mervosh", "title": "Matt Bevin, Ousted in Kentucky, Sets Off Furor With ‘Extreme Pardons’", "description": "The outgoing governor pardoned or commuted the sentences of more than 400 people as he left office, prompting calls for an investigation.", "url": "https://www.nytimes.com/2019/12/13/us/matt-bevin-kentucky-crimes.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/us/13KENTUCKY/13KENTUCKY-facebookJumbo.jpg", "publishedAt": "2019-12-14T00:17:26Z", "content": "I personally spent hundreds of hours reading every application and file of those who received a pardon, he said, adding that he personally wrote every word of justification for each pardon granted and each sentence commuted.\r\nHe added that suggestions that fi… [+1695 chars]"}]}