{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Emily S. Rueb", "title": "Second U.S. Baby to Be Born From a Dead Donor’s Uterus Is Delivered", "description": "Researchers at Penn Medicine in Philadelphia said the procedure could pave a new path to parenthood for women with uterine factor infertility.", "url": "https://www.nytimes.com/2020/01/09/health/uterus-transplant-baby.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/multimedia/09xp-uterus2/09xp-uterus2-facebookJumbo.jpg", "publishedAt": "2020-01-10T03:50:46Z", "content": "I felt the actual glow, she said about being pregnant with her son, Benjamin.\r\nFeeling Benjamins little kicks, and seeing all the ultrasounds are priceless to me, she said. \r\nBut there were difficult parts. Ms. Gobrecht had to take immunosuppressant medicine … [+723 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Associated Press", "title": "Austin Peay Dumps Tennessee Tech Behind Taylor Double-Double - The New York Times", "description": "Terry Taylor scored 27 points with 12 rebounds and Jordyn Adams scored 20 and Austin Peay beat Tennessee Tech 75-62 on Thursday.", "url": "https://www.nytimes.com/aponline/2020/01/09/sports/ncaabasketball/bc-bkc-austin-peay-tennessee-tech.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-10T03:33:00Z", "content": "COOKEVILLE, Tenn. Terry Taylor scored 27 points with 12 rebounds and Jordyn Adams scored 20 and Austin Peay beat Tennessee Tech 75-62 on Thursday.\r\nAntwuan Butler and Carlos Paez each scored 10. Austin Peay (9-7, 3-0 Ohio Valley) was 29-of-58 shooting (50%).\r… [+389 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Todd May", "title": "‘The Good Place’ Asks, Are You the Worst Thing You’ve Ever Done?", "description": "In the latest episode, there is a critique of the prison system amid the laughs.", "url": "https://www.nytimes.com/2020/01/09/opinion/good-place-season-4.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/opinion/09stone-good-place-02/09stone-good-place-02-facebookJumbo.jpg", "publishedAt": "2020-01-10T02:00:06Z", "content": "The idea that one can be treated as no more than the worst thing one has ever done is a recipe for cruelty, one that infests much of the prison system in this country. As someone who teaches regularly in a maximum-security prison, I am well aware of this. It … [+2110 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "How Serious Is Tom Steyer’s Polling Surge? - The New York Times", "description": "How Serious Is Tom Steyer’s Polling Surge? The New York Times Fox News Poll: Biden ahead by 21 points among South Carolina Democrats Fox News Surging Steyer qualifies for Democratic debate POLITICO Tom Steyer: From cash cow to party crasher? Washington Examin…", "url": "https://www.nytimes.com/2020/01/09/upshot/Tom-Steyer-polling-surprise.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/upshot/10up-steyer2/10up-steyer2-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:57:00Z", "content": "The polls have one immediate, tangible consequence: Mr. Steyer has qualified for the next debate, placing him on the stage with Joe Biden, Bernie Sanders, Elizabeth Warren, Pete Buttigieg and Amy Klobuchar. And the results of these polls alone could be enough… [+1860 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Natalie Kitroeff", "title": "Boeing Employees Mocked F.A.A. in Internal Messages", "description": "“We regret the content of these communications, and apologize to the F.A.A., Congress, our airline customers, and to the flying public for them,” the company said.", "url": "https://www.nytimes.com/2020/01/09/business/boeing-737-messages.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/business/09boeing1/merlin_162016902_0d778ee7-a556-4abd-af9e-0b28be689951-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:51:19Z", "content": "These communications contain provocative language, and, in certain instances, raise questions about Boeings interactions with the F.A.A. in connection with the simulator qualification process, Boeing said in a statement to Congress. Having carefully reviewed … [+1266 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Annie Karni, Maggie Haberman", "title": "Kushner’s Global Role Shrinks as He Tackles Another: The 2020 Election - The New York Times", "description": "Kushner’s Global Role Shrinks as He Tackles Another: The 2020 Election The New York Times How the US response to Iran's attack unfolded behind the scenes CNN House passes War Powers Resolution in rebuke of Trump's actions against Iran Fox News John Kerry: Dip…", "url": "https://www.nytimes.com/2020/01/09/us/politics/jared-kushner-trump-campaign.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/us/politics/08dc-jared/08dc-jared-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:30:00Z", "content": "Mr. Kushner declined to comment on his change in focus, but his allies in the White House say he sees no reason to involve himself as extensively in international issues now that the State Department is run by Mr. Pompeo, whom he sees as far more competent th… [+2501 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aimee Ortiz", "title": "Queens Woman Is Sentenced to 15 Years in Bomb Plot", "description": "The woman, who pleaded guilty to a charge involving weapons of mass destruction, had been accused of planning to build a bomb for use in a terrorist attack.", "url": "https://www.nytimes.com/2020/01/09/nyregion/queens-woman-bomb-plot-sentencing.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/multimedia/09xp-WMDsentence1/merlin_93918038_c172af26-17e3-4671-a990-d273e8cb2c12-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:20:39Z", "content": "The United States attorneys office said Ms. Siddiquis long-term interest in violent terrorist-related activities was displayed in her submissions to a radical jihadist magazine.\r\nMs. Siddiqui wrote two poems and an article that were published in a magazine ca… [+1103 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Astor and Nick Corasaniti", "title": "Tom Steyer Makes Democratic Debate With Two Surprising Polls", "description": "Mr. Steyer will join five other candidates onstage on Tuesday after registering double-digit support in Nevada and South Carolina.", "url": "https://www.nytimes.com/2020/01/09/us/politics/tom-steyer-democratic-debate.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/us/politics/09steyer/09steyer-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:17:12Z", "content": "Were it not for Michael R. Bloombergs nine-figure media budget, Mr. Steyer would be by far the biggest spender in the 2020 race. He has been a prolific advertiser both nationally spending $11 million on national cable and $4.2 million on national broadcast an… [+529 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "Good for Meghan and Harry", "description": "The Duke and Duchess of Sussex are right to blaze their own trail.", "url": "https://www.nytimes.com/2020/01/09/opinion/markle-harry-royal-family.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/opinion/09royals_web/09royals_web-facebookJumbo-v3.jpg", "publishedAt": "2020-01-10T01:15:16Z", "content": "Sarcasm and exaggeration come easily when writing about royals, and the story of Prince Harry, the rambunctious second son of Prince Charles and Princess Diana, reaching across the Atlantic to marry an American actress was custom-made for the tabloids and, ye… [+2148 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dan Bilefsky", "title": "Evidence That Plane Was Shot Down in Iran May Upset U.S.-Canada Relations", "description": "As evidence emerged that an Iranian missile may have felled a jetliner, causing the death of 63 Canadians, journalists pressed Justin Trudeau if President Trump should bear any of the blame.", "url": "https://www.nytimes.com/2020/01/09/world/canada/iran-plane-crash-ukraine.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/world/09canada-crash-sub/09canada-crash-sub-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:05:55Z", "content": "Professor Johnston said he expected Mr. Trudeau to try to avoid antagonizing Mr. Trump, given the economic importance of Canadas relationship with the United States. A crucial new trade agreement between Canada, the United States and Mexico is awaiting approv… [+1253 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ed Shanahan", "title": "Trump Fails to Quash E. Jean Carroll’s Defamation Suit - The New York Times", "description": "Trump Fails to Quash E. Jean Carroll’s Defamation Suit The New York Times Trump Must Face Rape Accuser Carroll’s Defamation Lawsuit Bloomberg Trump loses bid to dismiss rape accuser's defamation lawsuit in New York Reuters Judge denies Trump's bid to have E. …", "url": "https://www.nytimes.com/2020/01/09/nyregion/trump-e-jean-carroll-defamation.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/nyregion/09carroll/09carroll-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:03:00Z", "content": "We look forward to moving ahead and proving that Donald Trump lied when he told the world that he did not rape Ms. Carroll and had not even met her, Ms. Kaplan said.\r\nWE MOVE AHEAD!! Ms. Carroll said on Twitter. \r\nThe lawyer representing Mr. Trump in the case… [+882 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Peter Baker", "title": "Trump Opens Re-election Year at Rally in Ohio", "description": "For his first campaign event of 2020, the president flew to the region where many analysts believe the fall contest will be decided and touted his confrontation with Iran.", "url": "https://www.nytimes.com/2020/01/09/us/politics/trump-rally-toledo-ohio.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/us/politics/09dc-trump-2/merlin_166899840_40283ceb-e348-4afa-8b64-9b9a51000b40-facebookJumbo.jpg", "publishedAt": "2020-01-10T01:02:25Z", "content": "In Ohio, unemployment has fallen to 4.2 percent but remains higher than the national rate and among the 10 states with the highest in the country. The state lost 4,400 jobs last year through November and shed 2,200 manufacturing jobs over the previous year.\r\n… [+995 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Zolan Kanno-Youngs", "title": "Twin Court Rulings Buoy Construction of Trump’s Border Wall - The New York Times", "description": "Twin Court Rulings Buoy Construction of Trump’s Border Wall The New York Times Trump touts court ruling allowing military funds for border wall construction Fox News Appeals Court Allows Trump To Divert $3.6 Billion In Military Funds For Border Wall NPR Priva…", "url": "https://www.nytimes.com/2020/01/09/us/politics/trump-border-wall.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/us/politics/09dc-wall/09dc-wall-facebookJumbo.jpg", "publishedAt": "2020-01-10T00:44:00Z", "content": "In a statement on Thursday, the White House applauded as a victory for the rule of law the appeals court ruling in New Orleans that lifted an illegitimate nationwide injunction. \r\nAnd in doing so, the statement said, the court has allowed vital border wall co… [+1306 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "John Kerry", "title": "John Kerry: Trump Played Into Suleimani’s Hard-Line Strategy", "description": "The president could have ensured a nonnuclear Iran by sticking with the 2015 agreement. Instead, he put us on a path toward conflict and turmoil.", "url": "https://www.nytimes.com/2020/01/09/opinion/john-kerry-trump-iran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/opinion/09Kerry/09Kerry-facebookJumbo.jpg", "publishedAt": "2020-01-10T00:34:28Z", "content": "What did we turn over to President-elect Trump in 2017? Iran was in compliance with the nuclear agreement. Our allies were united with the United States. There were no missile attacks on United States facilities. No ships were being detained or sabotaged in t… [+2058 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David Brooks", "title": "Trump Has Made Us All Stupid", "description": "The decline of discourse in the anti-Trump echo chamber.", "url": "https://www.nytimes.com/2020/01/09/opinion/trump-iran-media.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/opinion/09brooksnew/09brooksnew-facebookJumbo.jpg", "publishedAt": "2020-01-10T00:21:22Z", "content": "A great cry went up from the echo chamber. Were on the brink of war! Trump is leading us to more endless wars in the Middle East! Were on the precipice of total chaos! This was not the calibrated language of risk and reward. It was fear-stoking apocalyptic la… [+2379 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dave Philipps", "title": "Army Denies Request by Soldier Pardoned by Trump, Setting Up Showdown", "description": "Maj. Mathew L. Golsteyn, once charged with murder, had asked that the Army restore his Special Forces tab, which denotes membership in the elite Green Berets force.", "url": "https://www.nytimes.com/2020/01/09/us/mathew-golsteyn-army-war-crime.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/us/09GOLDSTEYN/09GOLDSTEYN-facebookJumbo.jpg", "publishedAt": "2020-01-10T00:16:57Z", "content": "After the initial investigation into the killing began, the Army stripped him of his Special Forces tab, and rescinded a medal that the Army had approved for him but had not yet presented, the Distinguished Service Cross.\r\nBut Major Golsteyn never went on tri… [+931 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Denise Grady", "title": "Vaping Kills a 15-Year-Old in Texas", "description": "The teenager was the youngest to die so far in the outbreak of lung illnesses that affected thousands of people.", "url": "https://www.nytimes.com/2020/01/09/health/teen-vaping-death.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/science/09VAPING/9VAPING-facebookJumbo.jpg", "publishedAt": "2020-01-10T00:02:11Z", "content": "Cases of lung illness and deaths from vaping have tapered off since peaking in September, health officials said on Thursday, but the outbreak also reached a grim new milestone: The youngest death, of a 15-year-old, was reported by Dallas County Health and Hum… [+695 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Yi-Zheng Lian", "title": "How China May Help Its Enemy Get Elected in Taiwan", "description": "President Tsai can thank Beijing for its stupidity if she stays in power.", "url": "https://www.nytimes.com/2020/01/09/opinion/taiwan-election-china.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/opinion/09Lian1/09Lian1-facebookJumbo.jpg", "publishedAt": "2020-01-10T00:00:07Z", "content": "And so it does seem that Ms. Tsai, just back from the political doldrums, is poised to win this Saturday, despite plenty of fake news and other moves to derail her by China or its supporters. A coattail effect may also help her party retain its current majori… [+1573 chars]"}]}