{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Lola Fadulu", "title": "Homelessness Rises 2.7 Percent, Driven by California’s Crisis, Report Says", "description": "Soaring rates of homelessness in California, which is struggling with out-of-reach housing costs and affordable housing construction, pulled that figure upward.", "url": "https://www.nytimes.com/2019/12/20/us/politics/homelessness-trump-california.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20dc-homeless/merlin_159526740_259e47e4-ecbc-42b2-a217-98c2e9ee4675-facebookJumbo.jpg", "publishedAt": "2019-12-21T03:52:26Z", "content": "Housing costs are going up dramatically in many parts of the country, including in California, and thats driving increases in homelessness as well as a housing crunch for many people, she said.\r\nThe HUD report said 568,000 people experienced homelessness on a… [+1345 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Emily Bazelon and Beverly Gage", "title": "Why Is Trump Finding More Protection Than Nixon Did?", "description": "Several factors unrelated to the facts are shielding President Trump in ways Nixon would have envied.", "url": "https://www.nytimes.com/2019/12/20/opinion/sunday/impeachment-trump-nixon.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/opinion/sunday/22bazelon/22bazelon-facebookJumbo.jpg", "publishedAt": "2019-12-21T03:38:57Z", "content": "Several months later, details of a whistle-blower complaint, reportedly from someone in the C.I.A., leaked out and set the stage for the impeachment inquiry. The complaint laid out a conversation between Mr. Trump and Volodymyr Zelensky, the president of Ukra… [+2861 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "14 Horses Found Shot to Death at Abandoned Coal Mining Site in Kentucky", "description": "The Floyd County sheriff said that several of the horses were pregnant, and that the killing was probably premeditated.", "url": "https://www.nytimes.com/2019/12/20/us/horses-shot-death-Kentucky.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/multimedia/20xp-horses/20xp-horses-facebookJumbo.jpg", "publishedAt": "2019-12-21T03:15:31Z", "content": "Ms. Conn said that the horses bodies were spread out over a large area, and that the remote location made it difficult to do a necropsy in a lab setting. Some of the horses did not die immediately and bled out from gunshot wounds, she added. Feral or free-roa… [+909 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Annie Karni and Maggie Haberman", "title": "Trump Has a Habit of Quoting His Allies on Twitter Saying Things They Never Said", "description": "The president frequently injects his own words into statements he claims his supporters said on Fox News or elsewhere. They rarely publicly correct him.", "url": "https://www.nytimes.com/2019/12/20/us/politics/trump-twitter-quotes.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19dc-fakenews-sub1/19dc-fakenews-sub1-facebookJumbo.jpg", "publishedAt": "2019-12-21T02:04:12Z", "content": "Not all of Mr. Trumps misrepresentations come from watching TV. Sometimes he attributes something to a private conversation that may not have ever occurred. \r\nThat happened in October when the president was defending the contents of a reconstructed transcript… [+1591 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Levenson", "title": "Georgia Company Recalls Eggs Linked to Deadly Listeria Outbreak", "description": "Almark Foods said the voluntary recall affected hard-boiled and peeled eggs that were sold in white plastic pails to restaurants and grocery stores for use in egg salad and other foods.", "url": "https://www.nytimes.com/2019/12/20/us/georgia-company-recalls-eggs-linked-to-deadly-listeria-outbreak.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/multimedia/20xp-eggrecall/20xp-eggrecall-facebookJumbo-v2.jpg", "publishedAt": "2019-12-21T01:49:21Z", "content": "This week, the Centers for Disease Control and Prevention said that food processors, restaurants and retailers should not use bulk hard-boiled eggs produced at the Georgia plant. It also recommended that those who received the eggs use extra vigilance in clea… [+1045 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jamelle Bouie", "title": "Impeachment Hurts, and Trump Knows It", "description": "The idea that the president thinks it will help him politically is wrong. Just listen to what he is saying.", "url": "https://www.nytimes.com/2019/12/20/opinion/sunday/impeachment-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/opinion/22Bouie2/22Bouie2-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:41:05Z", "content": "I think its a horrible thing to be using the tool of impeachment, which is supposed to be used in an emergency, Trump grumbled in the midst of a meeting with President Mario Abdo Benítez of Paraguay. Its a scam. Its something that shouldnt be allowed. And its… [+2286 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Carol Pogash and Nicholas Bogel-Burroughs", "title": "Democrats Sparred Over a Wine Cave Fund-Raiser. Its Billionaire Owner Isn’t Pleased.", "description": "“It’s just not fair,” said the owner of the wine cave, who with his wife has donated millions to Democrats since the 1980s.", "url": "https://www.nytimes.com/2019/12/20/us/wine-cave-craig-hall.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/20winecave-01/20winecave-01-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:37:27Z", "content": "For the Halls, the scrutiny has felt personal. Mr. Hall said that during the debate, Ms. Hall turned to him and jokingly said she might go buy something for herself instead of contributing to another political campaign.\r\nMr. Hall, 69, made much of his fortune… [+1573 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Richard Goldstein", "title": "Junior Johnson, Good-Old-Boy Auto Racing Star, Is Dead at 88", "description": "He competed on the NASCAR circuit for 12 seasons, became a successful team owner and was one of the first inductees in the organization’s Hall of Fame.", "url": "https://www.nytimes.com/2019/12/20/sports/junior-johnson-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/21/obituaries/20johnson-obit1/20johnson-01-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:13:20Z", "content": "Mr. Wolfes profile inspired the 1973 Hollywood movie The Last American Hero, with Jeff Bridges portraying a character based on Johnson. His name was invoked in Bruce Springsteens song Cadillac Ranch.\r\nIn his years delivering moonshine, beginning when he was a… [+1380 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "Why Is the Justice Department Treating T-Mobile Like a Client?", "description": "Antitrust officials are supposed to prevent problematic corporate mergers. Instead, they’re helping shepherd deals.", "url": "https://www.nytimes.com/2019/12/20/opinion/justice-department-antitrust-sprint-tmobile.html", "urlToImage": "https://static01.nyt.com/images/2019/12/21/opinion/21anitrust/21anitrust-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:12:02Z", "content": "And the deeper problem is that Mr. Delrahims behavior was not exceptional.\r\nSince the 1980s, the federal government has maintained a permissive attitude toward corporate concentration, giving the benefit of the doubt to companies that want to get hitched. In … [+1630 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "New York’s Subways Need Better Service, Not More Police", "description": "The M.T.A. is spending millions to add 500 officers while it faces serious financial problems.", "url": "https://www.nytimes.com/2019/12/20/opinion/subways-police.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/opinion/22mta/22mta-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:11:28Z", "content": "In an op-ed in The New York Post last month, then-Commissioner James ONeill noted that the chance of being the victim of a serious crime in the subway is about one in a million.\r\nPatrick Foye, the M.T.A. chairman and chief executive, said in an interview on F… [+1471 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Emily Cochrane and Annie Karni", "title": "Administration Threatened Veto Over Ukraine Aid in Spending Package", "description": "Had the language not been removed, administration officials threatened that President Trump would veto must-pass spending legislation, prompting another government shutdown.", "url": "https://www.nytimes.com/2019/12/20/us/politics/veto-threatened-veto-ukraine-aid.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20dc-spending-1/merlin_166127883_16e641fd-3e98-4fb5-8e20-c3b89972f4d9-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:02:39Z", "content": "The administration also objected to Democratic language that would have required the Office of Management and Budget to make public budget documents, known as apportionment letters, related to the release of aid to federal agencies, one official said. Those l… [+1267 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Carl Hulse", "title": "Mitch McConnell, Master of the Blockade, Plots Impeachment Strategy", "description": "The Senate majority leader has earned the nickname the grim reaper for his iron-fisted grip on the chamber, but an impeachment trial is harder to control.", "url": "https://www.nytimes.com/2019/12/20/us/mitch-mcconnell-impeachment-strategy.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20DC-McConnell/merlin_166196775_1666b83c-5451-42a6-96cc-b6525865b0e7-facebookJumbo.jpg", "publishedAt": "2019-12-21T01:01:12Z", "content": "And Ms. Pelosi believes that Mr. Trump is so eager for the public vindication of a Senate acquittal that he will put pressure on the majority leader to make it happen even if it means offering some concessions to Mr. Schumer. \r\nFor now, however, Mr. McConnell… [+1960 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jim Tankersley", "title": "Treasury Completes Rules for Opportunity Zone Tax Breaks", "description": "The regulations will allow a wider group of investors to profit from the 2017 tax provision that was pitched as a boon to low-income areas.", "url": "https://www.nytimes.com/2019/12/20/business/tax-breaks-opportunity-zones.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/business/20dc-zones/20dc-zones-facebookJumbo.jpg", "publishedAt": "2019-12-21T00:36:29Z", "content": "Critics said Treasurys regulations did not address a fundamental flaw with the zones, which lack legal guidelines to ensure the investments actually benefit low-income areas and residents. Senator Ron Wyden, an Oregon Democrat who has introduced legislation t… [+1420 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Edgar Sandoval and Ashley Southall", "title": "Boy, 14, Sought in Killing of Tessa Majors, Barnard Student", "description": "Officials took the unusual step of distributing his photo, asking the public for help in finding him.", "url": "https://www.nytimes.com/2019/12/20/nyregion/tessa-majors-barnard-stabbing-arrest.html", "urlToImage": "https://static01.nyt.com/images/2019/12/21/nyregion/21Barnard-print/20Barnard2-facebookJumbo.jpg", "publishedAt": "2019-12-21T00:28:00Z", "content": "The 13-year-old who was arrested last week told detectives that he and two middle school classmates went to the park on the evening of Dec. 11 determined to rob people, the police said. Initially, the teens followed a man walking on some steps, but the boys s… [+1201 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Charlie Savage", "title": "Surveillance Court Orders Review of Actions by Ex-F.B.I. Lawyer", "description": "Amid fallout from a scathing inspector general report, the court that oversees national security surveillance is also getting a new presiding judge.", "url": "https://www.nytimes.com/2019/12/20/us/politics/surveillance-court-fisa.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20dc-FISA/merlin_165675660_343ca126-8649-4de4-ae73-cd8805e51c6b-facebookJumbo.jpg", "publishedAt": "2019-12-21T00:01:35Z", "content": "But the inspector general, Michael E. Horowitz, found that the F.B.I. cherry-picked and misstated the evidence about Mr. Page. Among the problems was that the law enforcement officials presented his long history of meeting with Russian intelligence officials … [+1486 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mimi Swartz", "title": "Holiday Stress Can Be Unbearable. But You Will Miss It When It’s Gone.", "description": "Being with people you love becomes more important than small digs and even arguing about Donald Trump.", "url": "https://www.nytimes.com/2019/12/20/opinion/holiday-stress.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/opinion/20swartz/20swartz-facebookJumbo.jpg", "publishedAt": "2019-12-21T00:00:05Z", "content": "Then, in early October this year, I tripped and landed in the hospital myself, with a broken femur. After some debate, my husband and I called off Thanksgiving, which was in itself semi-stressful because I hated to disappoint our holiday regulars. Instead, we… [+1807 chars]"}]}