{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tariro Mzezewa", "title": "Ringing in the New Year (With Rings)", "description": "Everyone already has the dresses, the tuxedos, the champagne. Is New Year’s Eve the one holiday it’s not rude to have a wedding?", "url": "https://www.nytimes.com/2019/12/31/fashion/weddings/new-years-eve-weddings.html", "urlToImage": "https://static01.nyt.com/images/2020/01/02/fashion/31nyeweddings/31nyeweddings-facebookJumbo-v2.jpg", "publishedAt": "2019-12-31T23:54:09Z", "content": "Preston Bailey, an event designer who worked on the weddings of Serena Williams, LeBron James and Eva Longoria, said that planning a New Years Eve wedding can be difficult and expensive, with popular locations either going fast because demand is high or becau… [+959 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dave Philipps", "title": "From the Brig to Mar-a-Lago, Former Navy SEAL Capitalizes on Newfound Fame", "description": "After receiving presidential clemency, Edward Gallagher has left the SEALs to become a pitchman and conservative activist.", "url": "https://www.nytimes.com/2019/12/31/us/navy-seals-edward-gallagher-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/us/31GALLAGHER/31GALLAGHER-facebookJumbo.jpg", "publishedAt": "2019-12-31T23:40:11Z", "content": "Paul Rieckhoff, the founder of Iraq and Afghanistan Veterans of America, who has openly criticized Chief Gallagher, said that the square-jawed, blue-eyed SEAL has been a valuable political weapon for the Trump administration.\r\nTrump is a oligarch of casting, an… [+1237 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Baker", "title": "Firings at Trump Property Cap Year of Purging Undocumented Workers", "description": "Facing a public reckoning, the Trump Organization has been cracking down on its unauthorized laborers.", "url": "https://www.nytimes.com/2019/12/31/us/trump-undocumented-workers-winery.html", "urlToImage": "https://static01.nyt.com/images/2017/05/27/us/31trump-workers/00trumpwine6-facebookJumbo-v2.jpg", "publishedAt": "2019-12-31T23:20:33Z", "content": "Do you currently have legal permission to work in the United States? the manager asked with the aid of an interpreter. Mr. Miranda responded that he did not. \r\nThe manager said the company would not continue employing him. She said that he was wonderful and t… [+1238 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Spencer Bokat-Lindell", "title": "The Extremely Online Decade of ‘Get Out,’ Fake Meat and Crystals", "description": "The 2010s, reviewed.", "url": "https://www.nytimes.com/2019/12/31/opinion/decade-review-2010s.html", "urlToImage": "https://static01.nyt.com/images/2020/01/01/opinion/0101debatable/0101debatable-facebookJumbo.jpg", "publishedAt": "2019-12-31T23:05:04Z", "content": "Jennifer: Watchmen, the series on HBO that just completed its run in December 2019, is a hard look at American history and mythology. It captures, breathtakingly, the profound and unhealable racism written into this countrys DNA; it also shows that a woman of… [+2497 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Choe Sang-Hun", "title": "North Korea Is No Longer Bound by Nuclear Test Moratorium, Kim Says", "description": "Kim Jong-un said North Korea was free of a self-imposed pause on testing nuclear weapons and long-range missiles, which President Trump had called a diplomatic victory.", "url": "https://www.nytimes.com/2019/12/31/world/asia/north-korea-kim-speech.html", "urlToImage": "https://static01.nyt.com/images/2019/12/23/world/00nkorea-test-hfo/00nkorea-icbm-hfo-facebookJumbo.jpg", "publishedAt": "2019-12-31T23:02:37Z", "content": "SEOUL, South Korea North Koreas leader, Kim Jong-un, said his country no longer felt bound by its self-imposed moratorium on testing nuclear weapons and long-range ballistic missiles, its official media reported on Wednesday in the strongest indication yet th… [+671 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ellen Barry", "title": "Chinese Scientist Is Accused of Smuggling Lab Samples, Amid Crackdown on Research Theft", "description": "Zaosong Zheng, a promising cancer researcher, confessed that he had planned to take the stolen samples to Sun Yat-sen Memorial Hospital, and publish the results under his own name.", "url": "https://www.nytimes.com/2019/12/31/us/chinese-scientist-cancer-research-investigation.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/us/31boston-cancer/31boston-cancer-facebookJumbo.jpg", "publishedAt": "2019-12-31T23:01:56Z", "content": "Researchers of Chinese descent make up nearly half of the work force in American research laboratories, in part because American-born scientists are drawn to the private sector and less interested in academic careers, Dr. McKinney said. Among the 6,000 Chines… [+1883 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Adam Liptak", "title": "Impeachment Trial Looming, Chief Justice Reflects on Judicial Independence", "description": "Chief Justice John Roberts’s year-end report on the judiciary praised civics education, but it was not hard to detect a timely subtext that appeared to be addressed to President Trump.", "url": "https://www.nytimes.com/2019/12/31/us/john-roberts-trump-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/us/politics/31dc-scotus/31dc-scotus-facebookJumbo.jpg", "publishedAt": "2019-12-31T23:00:07Z", "content": "The exchange started when Mr. Trump called a judge who had ruled against his administrations asylum policy an Obama judge. In response, the chief justice said the president had misunderstood the role of the federal courts in the constitutional system.\r\nWe do … [+1974 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alana Celii, Brent Lewis, Renee Melides, Brent Murray and David Yaffe-Bellany", "title": "What the Year in Business News Looked Like", "description": "A snapshot of our best photography and graphic illustrations from 2019.", "url": "https://www.nytimes.com/2019/12/31/business/2019-business-news.html", "urlToImage": "https://static01.nyt.com/images/2019/03/05/business/05seacables/merlin_148363527_91c6037b-1999-4d3e-bd1e-4bfb43526464-facebookJumbo.jpg", "publishedAt": "2019-12-31T22:27:14Z", "content": "Not all business news happens in the boardroom. \r\nOver the last year, photographers at The New York Times have chased business stories across the world, from oil fields to garbage dumps, from Silicon Valley to Kazakhstan. They have captured the struggles of e… [+227 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kara Swisher", "title": "No More Phones and Other Tech Predictions for the Next Decade", "description": "Despair not. What’s coming in the next few years might be a lot better than you expect.", "url": "https://www.nytimes.com/2019/12/31/opinion/2019-in-tech.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/opinion/31swisher/31swisher-facebookJumbo.jpg", "publishedAt": "2019-12-31T22:22:59Z", "content": "We havent quite dealt with all of the repercussions of techs domination of the past decade there will be regulations, a lot of tech is still addictive, and digital hate will continue to travel halfway around the world before the truth gets out of bed but ther… [+3412 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Remy Tumin and Hiroko Masuike", "title": "New Year’s Eve, Iraq, Lily Tomlin: Your Tuesday Evening Briefing", "description": "Here’s what you need to know at the end of the last day of the year.", "url": "https://www.nytimes.com/2019/12/31/briefing/new-years-eve-iraq-lily-tomlin.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/briefing/123119evening-briefing-promo/123119evening-briefing-promo-facebookJumbo.jpg", "publishedAt": "2019-12-31T22:18:59Z", "content": "8. Finally, New Years traditions and superstitions from around the world. Above, Hong Kong got the festivities started. \r\nIn Denmark, they throw plates as a sign of friendship; in Scotland, balls of fire are swung to ward off evil. And in Sweden, folklore ent… [+848 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Adam Nossiter", "title": "Macron Stands by Contested Pension Plan, Despite Pressure From Marathon Strike", "description": "In his annual New Year's Eve speech, President Emmanuel Macron of France hinted there could be changes to his plan, though he insisted “fear shouldn’t mean inaction.”", "url": "https://www.nytimes.com/2019/12/31/world/europe/macron-speech-strike.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/world/31france-macron/31france-macron-facebookJumbo.jpg", "publishedAt": "2019-12-31T22:14:04Z", "content": "And he repeated the word responsibility, which has come to represent a red flag for many unions; for Mr. Macrons government, it means that people must work longer, and the retirement age will be effectively pushed from 62 to 64 for many. With the ratio of wor… [+1684 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Sonny Mehta, Knopf Editor, Remembered by His Writers", "description": "Authors who worked with him recall the publisher’s elegance, his wit, and, above all, his fierce devotion to books and their writers.", "url": "https://www.nytimes.com/2019/12/31/books/sonny-mehta-salman-rushdie-bret-easton-ellis.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/obituaries/31MehtaBooks1/31MehtaBooks1-facebookJumbo.jpg", "publishedAt": "2019-12-31T21:50:09Z", "content": "When he was honored at the Center for Fiction gala last year, Sonny abandoned the taciturn habits of a lifetime and spoke at great length, and with deep emotion, about his life in books. All of us who heard him that day were greatly moved, partly because it w… [+3308 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Brian Libby", "title": "The Warriors Get a New Home, and New Neighbors", "description": "Chase Center, in San Francisco’s Mission Bay, seeks to anchor more than an N.B.A. franchise.", "url": "https://www.nytimes.com/2019/12/31/business/chase-center-warriors-arena.html", "urlToImage": "https://static01.nyt.com/images/2020/01/01/business/31chasecenter10/31chasecenter10-facebookJumbo.jpg", "publishedAt": "2019-12-31T21:26:24Z", "content": "Chase Center is designed to be as conducive to concerts as it is to basketball games. For example, the arenas video scoreboard, the largest in the N.B.A., lifts mechanically into the ceiling, after which two horizontal doors close over it. This offers visitor… [+659 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Crowley and Edward Wong", "title": "Trump Warns Iran as Risk of Wider Armed Conflict Grows", "description": "Administration officials say they are restoring “deterrence” against Iran, but the president’s reluctance to use force in the Middle East may be creating an opening for Tehran.", "url": "https://www.nytimes.com/2019/12/31/us/politics/trump-iran-baghdad-embassy.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/us/politics/31dc-diplo1/31dc-diplo1-facebookJumbo.jpg", "publishedAt": "2019-12-31T20:33:12Z", "content": "Mr. Trumps former national security adviser, John R. Bolton, warned in a tweet against conflating the embassy attack with mass protests that have gripped Iraq in recent months. \r\nThe attack on the U.S. embassy in Baghdad is straight from Irans playbook in 197… [+2327 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Nicholas Bakalar", "title": "Antibiotics May Raise the Risk of Allergies", "description": "Infants given antibiotics were at increased risk of asthma and childhood allergies, a study suggests.", "url": "https://www.nytimes.com/2019/12/31/well/live/antibiotics-allergies-infants.html", "urlToImage": "https://static01.nyt.com/images/2019/06/18/well/18well_pog_drugs/well_pog_drugs-facebookJumbo.jpg", "publishedAt": "2019-12-31T20:29:04Z", "content": "Giving antibiotics to infants may increase their risk for developing allergies, a new study suggests.\r\nResearchers used records of 798,426 children in the Military Health System database from 2001 to 2013, tracking their antibiotic prescriptions in infancy an… [+722 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Victor Mather", "title": "Ron Rivera, Cast Out of Carolina, Lands With the Washington Redskins - The New York Times", "description": "Ron Rivera, Cast Out of Carolina, Lands With the Washington Redskins The New York Times Ron Rivera is traditional, hard-nosed and just what the Redskins need The Washington Post Ron Rivera made poor choice in choosing Redskins, Patriots' system is aging rapid…", "url": "https://www.nytimes.com/2019/12/31/sports/football/ron-rivera-washington-redskins.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/sports/31coaches/31coaches-facebookJumbo.jpg", "publishedAt": "2019-12-31T20:29:00Z", "content": "The N.F.L. coaching carousel revolved again on Tuesday, as the Washington Redskins hired Ron Rivera, according to multiplereports. A spokesman for the team declined to comment. \r\nRivera had been dismissed in early December by the Carolina Panthers after eight… [+1086 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Paul Greenberg", "title": "A New Year’s Climate Diet", "description": "How many tons of emissions can we trim in the new year?", "url": "https://www.nytimes.com/2019/12/31/opinion/climate-diet.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/opinion/31greenberg/31greenberg-facebookJumbo.jpg", "publishedAt": "2019-12-31T20:24:46Z", "content": "Be really lazy and drink from the tap. What could be a lazier thing to do than shuffling to your own sink and pouring yourself a glass of water? And yet nowadays we often replace this most low-effort of American habits with driving to a store and buying a pla… [+2904 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Was 2019 the ‘Best Year Ever’?", "description": "Readers offer a mix of optimism and despair in response to Nicholas Kristof’s declaration.", "url": "https://www.nytimes.com/2019/12/31/opinion/letters/2019-review.html", "urlToImage": "https://static01.nyt.com/images/2019/12/29/opinion/29Kristof/29Kristof-facebookJumbo.jpg", "publishedAt": "2019-12-31T20:13:20Z", "content": "Mr. Kristof is right, of course: The past few decades have seen remarkable improvements in the standard of living across the world, and we should end 2019 with a feeling of thankfulness. But perhaps its also a good time to remember that we did not get to this… [+1351 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Anti-Semitism in New York", "description": "The senior rabbi at Temple Emanu-El says we need to demonstrate that an attack on one New Yorker is an attack on all New Yorkers. Also: Security in the subways; Joe Biden’s stuttering.", "url": "https://www.nytimes.com/2019/12/31/opinion/letters/anti-semitism-new-york.html", "urlToImage": "https://static01.nyt.com/images/2019/12/29/nyregion/29nysynagogue3/29nysynagogue3-facebookJumbo-v2.jpg", "publishedAt": "2019-12-31T20:05:50Z", "content": "To the Editor:\r\nRe A Misuse of Funds for the Subway (editorial, Dec. 23), about the decision by the financially strapped Metropolitan Transportation Authority to add more police officers to patrol the system instead of spending the money on improving service:… [+1241 chars]"}]}