{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "Kevin Spacey Accuser’s Estate Drops Sexual Assault Lawsuit", "description": "A Los Angeles County massage therapist, who died in September, had accused Mr. Spacey of groping him and making improper advances during a 2016 massage.", "url": "https://www.nytimes.com/2019/12/31/us/kevin-spacey-lawsuit-accuser.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/multimedia/31xp-spacey/merlin_166329861_0af593e6-6354-4d31-8882-128628d01002-facebookJumbo.jpg", "publishedAt": "2020-01-01T05:50:31Z", "content": "A lawyer for the estate of the massage therapist, a Los Angeles County man identified in the lawsuit as John Doe, did not immediately respond to a request for comment on Tuesday evening.\r\nThe massage therapist sued Mr. Spacey, 60, last January. He accused Mr.… [+856 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Roston", "title": "Rocket Launches, Trips to Mars and More 2020 Space and Astronomy Events", "description": "A year full of highs and lows in space just ended, and the 12 months to come  will be full of new highlights in orbit and beyond.", "url": "https://www.nytimes.com/2020/01/01/science/space-astronomy-2020.html", "urlToImage": "https://static01.nyt.com/images/2020/01/01/science/01SPACEPREVIEW1/01SPACEPREVIEW1-facebookJumbo.jpg", "publishedAt": "2020-01-01T05:05:07Z", "content": "Roughly every two years, the orbits of Earth and Mars come closer than usual. Space agencies on Earth often send missions to the red planet during that window, and in 2020 four such launches are scheduled.\r\nThree of the missions will carry rovers. The United … [+970 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas St. Fleur", "title": "Meteor Showers in 2020 That Will Light Up Night Skies", "description": "All year long, Earth passes through streams of cosmic debris. Here’s a list of major meteor showers and how to spot one.", "url": "https://www.nytimes.com/2020/01/01/science/meteor-showers-2020.html", "urlToImage": "https://static01.nyt.com/images/2020/01/01/science/01meteorshowers/01meteorshowers-facebookJumbo.jpg", "publishedAt": "2020-01-01T05:00:08Z", "content": "All year long as Earth revolves around the sun, it passes through streams of cosmic debris. The resulting meteor showers can light up night skies from dusk to dawn, and if youre lucky you might be able to catch one.\r\nIf you spot a meteor shower, what youre re… [+1115 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Crowley", "title": "Dizzying Day for Trump Caps a Year Full of Them - The New York Times", "description": "Dizzying Day for Trump Caps a Year Full of Them The New York Times US presses Iraq to protect American personnel after embassy attack: ‘There will be no Benghazis’ Fox News Trump threatens Iran after protesters attack US embassy in Baghdad CNN Tehran is tryin…", "url": "https://www.nytimes.com/2019/12/31/us/politics/trump-new-years-eve.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/us/politics/31dc-trump1/31dc-trump1-facebookJumbo.jpg", "publishedAt": "2020-01-01T04:54:00Z", "content": "By then it had already been a long and action-filled day for Mr. Trump after what had been a relatively peaceful holiday escape. For the better part of two weeks, he had been laying low during his vacation, shuttling back and forth between Mar-a-Lago and the … [+1282 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elaine Yu", "title": "Hong Kong Protest: Thousands Expected to March on New Year’s Day", "description": "A holiday tradition in Hong Kong — a pro-democracy rally — could inject new momentum into the protest movement after weeks of calm.", "url": "https://www.nytimes.com/2020/01/01/world/asia/hong-kong-protest.html", "urlToImage": "https://static01.nyt.com/images/2020/01/01/world/01hongkong-1/01hongkong-1-facebookJumbo.jpg", "publishedAt": "2020-01-01T04:53:52Z", "content": "The march is expected to begin at 2 p.m. The police have approved a two-mile route that passes some of the citys most iconic landmarks and buildings, stretching from Victoria Park to the Central business district. \r\nOn New Years Day, we need to show our solid… [+735 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Malachy Browne, Christiaan Triebert, Evan Hill, Whitney Hurst, Gabriel Gianordoli, Dmitriy Khavin", "title": "Hospitals and Schools Are Being Bombed in Syria. A U.N. Inquiry Is Limited. We Took a Deeper Look. - The New York Times", "description": "Attacks on civilian sites in Syria have grown so frequent that the U.N. launched a rare inquiry to document the violations. But the investigation is limited in scope and the final report may not be made public. The New York Times did its own investigation. He…", "url": "https://www.nytimes.com/interactive/2019/12/31/world/middleeast/syria-united-nations-investigation.html", "urlToImage": "https://static01.nyt.com/images/2019/12/30/world/syria-un-investigation-promo/syria-un-investigation-promo-facebookJumbo.jpg", "publishedAt": "2020-01-01T03:48:00Z", "content": "The bombs smashed into a child care center, a refugee camp and a school. They destroyed makeshift clinics and hospitals, disabling essential services for tens of thousands of people.\r\nOver the past year, attacks on buildings in northwestern Syria, which are s… [+42754 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sheila Kaplan and Maggie Haberman", "title": "F.D.A. Plans to Ban Most E-Cigarette Flavors but Menthol", "description": "The tobacco and vaping industries and conservative allies intensively lobbied against a ban on popular flavored e-cigarettes.", "url": "https://www.nytimes.com/2019/12/31/health/e-cigarettes-flavor-ban-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/11/06/science/05FDA-FLAVORS/05FDA-FLAVORS-facebookJumbo.jpg", "publishedAt": "2020-01-01T01:31:34Z", "content": "Public health experts were pleased that the flavors most alluring to youths were prohibited, but feared teenagers would switch to menthol rather than quit vaping. \r\nPresident Trumps hesitance to put in place a full ban has become increasingly clear in recent … [+1568 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "Protect Veterans From Fraud", "description": "Congress could do much more to protect Americans who have served their country from predatory for-profit colleges.", "url": "https://www.nytimes.com/2019/12/31/opinion/for-profit-college-veterans.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/opinion/31_veteran_web/31_veteran_web-facebookJumbo.jpg", "publishedAt": "2020-01-01T00:27:36Z", "content": "These 70-year-old complaints are still being echoed in lawsuits and enforcement actions aimed at for-profit schools all over the United States. On Dec. 10, for example, the Federal Trade Commission reached a $191 million settlement with the for-profit Univers… [+2084 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dave Montgomery, Anemona Hartocollis and Rick Rojas", "title": "Texas Churchgoers Welcomed the Poor, but Sensed This One Was Trouble", "description": "The gunman who shot two parishioners at the West Freeway Church of Christ had come earlier looking for food and money, church leaders said.", "url": "https://www.nytimes.com/2019/12/31/us/texas-church-shooting-white-settlement.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/us/31TEXAS-CHURCH-vigil/31TEXAS-CHURCH-vigil-facebookJumbo.jpg", "publishedAt": "2020-01-01T00:14:41Z", "content": "Mr. Kinnunen approached Mr. Wallace, who was administering communion, and the two men spoke briefly. No one knows what that conversation was, Mr. Wilson said. The gunman sat down and then went up to Mr. Wallace again, this time pulling out a shotgun he had hi… [+1675 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Coral Davenport and Lisa Friedman", "title": "Science Panel Staffed With Trump Appointees Says E.P.A. Rollbacks Lack Scientific Rigor", "description": "The Trump administration staffed an E.P.A. advisory panel with its choice of scientists, but they  concluded that three significant regulatory rollbacks broke with established science.", "url": "https://www.nytimes.com/2019/12/31/climate/epa-science-panel-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/climate/31cli-epa2/31cli-epa2-facebookJumbo.jpg", "publishedAt": "2020-01-01T00:10:35Z", "content": "One of the primary problems, he said, is that the E.P.A., in an unusual move, used a flawed economic model that had not been reviewed either internally by federal agencies or in the academic literature. That model found what Mr. Wilcoxen described as the real… [+1799 chars]"}]}