{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mark Gardiner", "title": "The Leotard Queen", "description": "The dance world’s secret workout weapon is poised to go mainstream.", "url": "https://www.nytimes.com/2019/12/17/style/best-leotards-for-dancers.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/fashion/17LeotardLady-2/17LeotardLady-2-facebookJumbo.jpg", "publishedAt": "2019-12-17T17:44:16Z", "content": "She began cutting up secondhand leotards to use as patterns, and started making her own, relying on sewing skills she had picked up from her mother, and during high school, when she studied at Utah Regional Ballet.\r\nMs. Choules chose bright colors and prints … [+1346 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "Many renters who face eviction owe less than $600", "description": "Many Renters Who Face Eviction Owe Less Than $600", "url": "http://www.nytimes.com/2019/12/12/upshot/eviction-prevention-solutions-government.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2019/11/GettyImages-149060607.jpg?w=1024&h=681", "publishedAt": "2019-12-17T17:43:27Z", "content": "Among the millions of recent eviction cases researchers have begun to compile across the country, there are a startling number of modest sums. There are dozens of families in Texas evicted with money judgments — unpaid rent, late fees, court costs totaling $5… [+8019 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tina Rosenberg", "title": "Five Who Spread Hope in 2019", "description": "In a year of many dispiriting headlines, Fixes still found the better angels of human nature at work.", "url": "https://www.nytimes.com/2019/12/17/opinion/spread-hope-2019.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/opinion/17Fixes1/merlin_148870704_bf85554a-5701-4e7b-b19f-fcc2f9db69bd-facebookJumbo.jpg", "publishedAt": "2019-12-17T17:30:33Z", "content": "Kimberly McGrath heals trafficked children\r\nNow we know they really are just extremely traumatized youth.\r\nWhat happens to a child who is exploited commercially for sex?\r\nKimberly McGrath is changing the answer to that question. Historically, trafficked child… [+1403 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Pete Wells", "title": "8 Ways Restaurants Have Changed in the Past Decade", "description": "Our chief restaurant critic tries to make sense of the past 10 years in American dining, with a little help from Twitter.", "url": "https://www.nytimes.com/2019/12/17/dining/restaurant-trends-pete-wells.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/dining/17decade2/17decade2-facebookJumbo.jpg", "publishedAt": "2019-12-17T17:24:15Z", "content": "Recently, I asked Twitter to help make sense of the American restaurant scene, 2010 to 2019. \r\nOK all my Zeitgeist-surfing food media friends: What the hell WAS the past decade in restaurants all about? Sum it up so I don't have to write a 2000 word essay abo… [+8842 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jeffrey Gettleman, Vindu Goel and Maria Abi-Habib", "title": "India Adopts the Tactic of Authoritarians: Shutting Down the Internet", "description": "India, the world’s largest democracy, shuts down the internet far more than any other country. This week, 60 million people — roughly the size of France — have no service.", "url": "https://www.nytimes.com/2019/12/17/world/asia/india-internet-modi-protests.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/business/17india-internet/17india-internet-facebookJumbo.jpg", "publishedAt": "2019-12-17T17:16:53Z", "content": "Several officials in Mr. Modis party tried to sullytheir reputations; one wrote atweet calling them rabidly indoctrinated Islamists. \r\nThere is no evidence of that and in fact, one of the girls, 20-year-old Chanda Yadav, is a Hindu. \r\nMs. Yadav said the campa… [+910 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Genzlinger", "title": "Ken Heyman, 89, Dies; Collaborative Photographer With a Singular Eye", "description": "He traveled with the anthropologist Margaret Mead, teamed up with President Lyndon Johnson and shot for Life and Look, creating revelatory pictures.", "url": "https://www.nytimes.com/2019/12/17/arts/ken-heyman-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/obituaries/16Heyman1/16Heyman1-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:53:29Z", "content": "Ken Heyman seems to use his skill and the photographic process to allow other people, his subjects, to make their own pitch about themselves, an essay about him in the book U.S. Camera 62 said. He doesnt really take pictures of people and things (or, God forb… [+868 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Andrew Higgins", "title": "A Rare Russian Tech Triumph, a Police Raid and a Backlash - The New York Times", "description": "A case linked to a $670 million acquisition shows that there may be a limit to the authorities’ abuse of law enforcement to advance corrupt business interests.", "url": "https://www.nytimes.com/2019/12/17/world/europe/russia-tech-nginx.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/world/17russia-tech/17russia-tech-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:49:00Z", "content": "In a summary of the case in a search warrant, a Ministry of Interior investigator, E.A. Spirenkova, said Nginxs popular software belonged to Rambler, a Russian internet and media holding company controlled by a state bank and a well-connected billionaire.\r\nBo… [+2231 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jim Tankersley and Emily Cochrane", "title": "Congressional Negotiators Agree to Extend Some Tax Credits and Add to Debt", "description": "The end-of-year deal is the product of months of negotiations that fell short of both parties’ hopes.", "url": "https://www.nytimes.com/2019/12/17/business/congress-tax-breaks-debt.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/business/17dc-tax/17dc-tax-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:44:44Z", "content": "The agreement did not include the kind of dramatic increases in credits for low-income families that Democrats had hoped for and also fell short of Republicans hopes of correcting language in the 2017 tax law that has hurt some business owners, including a pr… [+1673 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Pete Wells", "title": "What Happens When a Fitness Chain Opens a Restaurant?", "description": "Electric Lemon, in the Equinox Hotel at Hudson Yards, answers the question with vibrant flavors and a “feel the burn” playlist.", "url": "https://www.nytimes.com/2019/12/17/dining/electric-lemon-review-pete-wells.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-17T16:44:09Z", "content": "Wasnt it Sartre who said Hell is other peoples workout music?\r\nI know, it didnt sound quite right to me, either, but I was having trouble concentrating as I looked around Electric Lemon, the restaurant on the 24th floor of the Equinox Hotel in Hudson Yards.\r\n… [+1180 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alison Roman", "title": "Desserts That Bring the Party, but Not the Fuss", "description": "After a giant ham, Alison Roman wants something sweet, celebratory and a little grand — but not too difficult to make, either.", "url": "https://www.nytimes.com/2019/12/17/dining/christmas-desserts.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/dining/17Roman6/17Roman6-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:34:52Z", "content": "Cookies have always had a monopoly on holiday desserts, which is great if youre into cookies. But in my opinion, tiny, delicate, ornamental desserts are a touch anticlimactic at the end of a holiday meal. \r\nFor cocktail parties and giftable tins, of course, r… [+780 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael D. Shear", "title": "McConnell Rejects Calling Mulvaney or Bolton for Impeachment Trial", "description": "Senator Chuck Schumer, the Democratic leader, had sought testimony from four witnesses the White House had blocked, including Mick Mulvaney and John Bolton.", "url": "https://www.nytimes.com/2019/12/17/us/politics/trump-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/us/politics/17dc-impeach-sub1/17dc-impeach-sub1-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:20:06Z", "content": "WASHINGTON Senator Mitch McConnell, the Republican leader, on Tuesday rejected demands by Democrats to call four White House officials as witnesses during President Trumps impeachment trial in the Senate.\r\nOn the eve of a House vote on Wednesday that is all b… [+722 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Victor Mather", "title": "At the Top, It’s Just Drew Brees and Tom Brady. Or Is It Brady and Brees? - The New York Times", "description": "At the Top, It’s Just Drew Brees and Tom Brady. Or Is It Brady and Brees? The New York Times View full coverage on Google News", "url": "https://www.nytimes.com/2019/12/17/sports/football/drew-brees-540-tom-brady.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/sports/17breesWEB1/merlin_166067181_9bccbc10-519a-4bfa-a15c-ed28535c8ebb-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:19:00Z", "content": "Brees ranks third in the N.F.L.s career passer rating, according to Pro Football Reference, at 98.2. (Brady is sixth.) Brees trails two active quarterbacks who havent been around as long, but are even more efficient: Aaron Rodgerss career rating is 102.9, and… [+1335 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mihir Zaveri", "title": "Army Unit ‘Regrets’ Using Photo of Nazi War Criminal to Honor Battle of the Bulge", "description": "The colorized portrait of Joachim Peiper, whose unit slaughtered more than 80 American prisoners, was part of a Facebook commemoration of the battle on its 75th anniversary.", "url": "https://www.nytimes.com/2019/12/17/us/joachim-peiper-nazi-photo-apology.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/multimedia/17xp-naziphoto/17xp-naziphoto-facebookJumbo-v5.png", "publishedAt": "2019-12-17T16:16:41Z", "content": "A unit of the United States Army said Tuesday that it regrets sharing a colorized photograph of a Nazi war criminal in a Facebook post commemorating the 75th anniversary of the Battle of the Bulge after the post drew a widespread backlash on social media.\r\nTh… [+819 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elisabetta Povoledo", "title": "Pope Francis Abolishes Secrecy Policy in Sexual Abuse Cases", "description": "The change lets church officials share information with the secular law enforcement authorities. Critics had charged that the confidentiality rule led to the concealment of charges and evidence.", "url": "https://www.nytimes.com/2019/12/17/world/europe/pope-francis-secrecy-sexual-abuse.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/world/17vatican/17vatican-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:15:04Z", "content": "Francis then issued a law requiring that all church officials report to their superiors either abuse allegations or attempts to cover them up.\r\nThe rule announced on Tuesday was also a product of the February meeting, the Vatican said.\r\nThis is a sign of open… [+1526 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicole Hong, Arielle Dollinger", "title": "Scandal Began With Sex Toys. Now Ex-D.A. Is Convicted on Long Island. - The New York Times", "description": "Scandal Began With Sex Toys. Now Ex-D.A. Is Convicted on Long Island. The New York Times Former Suffolk County DA Thomas Spota Found Guilty Of Cover-Up CBS New York Powerful Former LI Prosecutor Guilty of Police Beating Cover-Up NBC New York Verdict reached i…", "url": "https://www.nytimes.com/2019/12/17/nyregion/tom-spota-trial-verdict.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/nyregion/17spotaverdict/17spotaverdict-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:12:00Z", "content": "Police officers who were supposed to investigate gangs and school shootings would be diverted to help the their chief with petty vendettas and mundane tasks, like spying on his girlfriends or driving him to the airport, former officers testified. \r\nTogether, … [+1246 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mitchell Kuga", "title": "Ronny Chieng Can Even Make This Year’s News Funny", "description": "The comedian, whose Netflix special “Asian Comedian Destroys America!” debuts today, shares a joke exclusively with T.", "url": "https://www.nytimes.com/2019/12/17/t-magazine/ronny-chieng.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/t-magazine/16tmag-ronny-chieng-02/16tmag-ronny-chieng-02-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:04:30Z", "content": "Like much of his comedy, Ronny Chiengs contribution to our video series Tell T a Joke highlights the absurdities of American culture with the prickliness of an immigrant and the timeliness of a news junkie. Born in Malaysia, and raised between New Hampshire a… [+1093 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Gordon Marino", "title": "Are You Listening?", "description": "If you’re hearing others through the filter of your own concerns, you’re not really hearing them.", "url": "https://www.nytimes.com/2019/12/17/opinion/art-of-listening.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/opinion/17Stone-marino/17Stone-marino-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:00:09Z", "content": "But Im not just trying to describe the virtue of being a good listener. I also want to suggest that people who have not been listened to often find it hard to listen to themselves.\r\nA few years ago, I had a student come to me in dire academic straits. This wa… [+3065 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Knvul Sheikh", "title": "What a 5,700-Year-Old Wad of Chewed Gum Reveals About Ancient People and Their Bacteria", "description": "Scientists dig into the diet, health and history of Danish hunter-gatherers in a new study.", "url": "https://www.nytimes.com/2019/12/17/science/ancient-gum-dna.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/science/17TB-ANCIENTDNA1/17TB-ANCIENTDNA1-facebookJumbo.jpg", "publishedAt": "2019-12-17T16:00:08Z", "content": "Lola, however, had been eating duck and hazelnuts before she started chewing on birch pitch, based on additional DNA found in the birch sample.\r\nThis is a snapshot of a real person in real time, said Natalija Kashuba, an archaeologist at Uppsala University in… [+1550 chars]"}]}