{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Asian Business Sentiment Bounces Back, but Caution Abounds: Thomson Reuters/INSEAD Survey - The New York Times", "description": "Confidence among Asian businesses rebounded sharply this quarter to hit an 18-month high with firms reporting a pickup in sales, though most are holding off on hiring as trade war uncertainty weighs, a Thomson Reuters/INSEAD survey found.", "url": "https://www.nytimes.com/reuters/2019/12/17/business/17reuters-asia-businesssentiment-poll.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-18T03:48:00Z", "content": "For a graphic on Business sentiment index, click https://fingfx.thomsonreuters.com/gfx/editorcharts/ASIA-BUSINESSSENTIMENT/0H001QXN59RG/eikon.png\r\nREADY TO REAP\r\nThe survey was conducted from Nov. 29 to Dec. 13, as Chinese and U.S. negotiators finalised a \"ph… [+1043 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Paul Mozur and Aaron Krolik", "title": "A Surveillance Net Blankets China’s Cities, Giving Police Vast Powers", "description": "The authorities can scan your phones, track your face and find out when you leave your home. One of the world’s biggest spying networks is aimed at regular people, and nobody can stop it.", "url": "https://www.nytimes.com/2019/12/17/technology/china-surveillance.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/business/00china-surveillance-1/00china-surveillance-1-facebookJumbo.jpg", "publishedAt": "2019-12-18T02:57:20Z", "content": "Online data leakage is a major problem in China. Local media reports describe how people with access to the data sell private details to fraudsters, suspicious spouses and anyone else, sometimes for just a few dollars per person. Leaks have become severe enou… [+1702 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aimee Ortiz", "title": "Arkansas Sheriff Accused of Assaulting 3 Faces Federal Charges", "description": "If convicted, Sheriff Anthony Boen of Franklin County could serve up to 30 years in prison and pay a fine of up to $250,000.", "url": "https://www.nytimes.com/2019/12/17/us/arkansas-sheriff-charged-assault.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/multimedia/17xp-sheriff/17xp-sheriff-facebookJumbo.jpg", "publishedAt": "2019-12-18T02:21:44Z", "content": "On Nov. 21, 2018, Sheriff Boen is said to have ordered that a person who is identified in court documents as B.E. to be taken to the detectives office. Sheriff Boen then pushed B.E. to the floor before grabbing his hair or beard, the indictment said.\r\nA third… [+577 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jan Ransom", "title": "Lawyer Casts Doubt on Boy’s Statements About Murder of Barnard Student", "description": "A defense lawyer suggested detectives had badgered and yelled at a 13-year-old boy before he admitted participating in the fatal mugging of Tessa Majors.", "url": "https://www.nytimes.com/2019/12/17/nyregion/tessa-majors-suspect-barnard-stabbing.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/nyregion/16barnard-02/16barnard-02-facebookJumbo.jpg", "publishedAt": "2019-12-18T02:02:07Z", "content": "Investigators also have a grainy video that shows a scuffle at the bottom of the steps where Ms. Majors was attacked and a person making poking motions toward the victim, Detective Wilfredo Acevedo testified at the probable cause hearing on Tuesday. \r\nThe vid… [+1659 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Rogers, Maggie Haberman", "title": "Trump Wanted to Get Something Off His Chest, and in His Letter to Pelosi He Did - The New York Times", "description": "Trump Wanted to Get Something Off His Chest, and in His Letter to Pelosi He Did The New York Times Pelosi responds to Trump's 'really sick' letter CNN Readers sound off on a Donald Trump impeachment USA TODAY The Democrats Could Re-Elect Trump in 2020 The Wal…", "url": "https://www.nytimes.com/2019/12/17/us/politics/trump-letter-pelosi.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/us/politics/17dc-trump-1/merlin_166097964_6d6c8478-597e-437c-b6c9-3ad5daeed9ad-facebookJumbo.jpg", "publishedAt": "2019-12-18T01:51:00Z", "content": "Michael Waldman, who served as a policy aide and speechwriter to President Bill Clinton during his impeachment, called the letter a six-page screech and said it was a representation of Mr. Trumps id. \r\nTypically a presidents words are weighed very carefully, … [+1019 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "The Rules", "description": "After the House impeachment vote comes the Senate trial. Here’s a look at who gets to set the terms for each.", "url": "https://www.nytimes.com/2019/12/17/podcasts/the-latest-impeachment-rules-mcconnell-schumer.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/podcasts/17latest2/17latest2-facebookJumbo.jpg", "publishedAt": "2019-12-18T01:48:54Z", "content": "Listen and subscribe to our podcast from your mobile device: Via Apple Podcasts | Via Spotify | Via Stitcher\r\nHouse members are preparing for a vote tomorrow on two articles of impeachment against President Trump, while their counterparts in the other chamber… [+1061 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ed Shanahan", "title": "After Anti-Semitic Killings, Jersey City School Official Called Jews ‘Brutes’ - The New York Times", "description": "After Anti-Semitic Killings, Jersey City School Official Called Jews ‘Brutes’ The New York Times Education official tweets anti-Semitic rant about Jersey City shooting rampage New York Post Mayor: Schools official who called Jews 'brutes' should quit Chicago …", "url": "https://www.nytimes.com/2019/12/17/nyregion/joan-terrell-paige-jersey-city.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/nyregion/17jcschoolboard1/17jcschoolboard1-facebookJumbo.jpg", "publishedAt": "2019-12-18T01:19:00Z", "content": "The uproar over Ms. Terrell-Paiges remarks came a week after Jersey City was plunged into a panic after two people fatally shot a police officer before mounting the deadly assault on the kosher market. It also coincided with the funeral for the slain officer,… [+1455 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "How Has This Pesticide Not Been Banned?", "description": "Government scientists say chlorpyrifos is unsafe. And yet it’s still in use.", "url": "https://www.nytimes.com/2019/12/17/opinion/chlorpyrifos-pesticide.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/opinion/17pesticide_web/17pesticide_web-facebookJumbo.jpg", "publishedAt": "2019-12-18T01:11:12Z", "content": "Gov. Andrew Cuomo, however, vetoed that bill. Mr. Cuomo promises to institute a ban on the pesticide and quickly, by July 2021 but says that his administration will accomplish this goal through regulations, not legislation. Thats an unfortunate choice. Regula… [+1902 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Scott Cacciola", "title": "LeBron James Is  Online - The New York Times", "description": "LeBron James Is  Online The New York Times Lakers, LeBron James and what we got wrong Sports Illustrated Giannis Antetokounmpo Raves About Lakers Ahead of Huge Thursday Matchup Lakers Daily MAVERICKS at BUCKS | FULL GAME HIGHLIGHTS | December 16, 2019 N…", "url": "https://www.nytimes.com/2019/12/17/sports/basketball/lebron-james-instagram-emojis.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/sports/18nba-lebron-lede/18nba-lebron-lede-facebookJumbo.jpg", "publishedAt": "2019-12-18T01:09:00Z", "content": "If Instagram is a part of Jamess team-building formula, then emojis are his love language. It goes something like this: James will post a story about a teammate that includes emojis, then that teammate will repost Jamess original post by adding his own emojis… [+1355 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Bogel-Burroughs", "title": "Tulsa Sites May Hold Mass Graves From ‘Black Wall Street’ Massacre", "description": "When white mobs obliterated a thriving black district nearly 100 years ago, as many as 300 people died. Researchers have found clues to where some of those bodies may be.", "url": "https://www.nytimes.com/2019/12/17/us/tulsa-graves-black-wall-street-massacre.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/us/17tulsa/17tulsa-facebookJumbo.jpg", "publishedAt": "2019-12-18T00:56:35Z", "content": "G.T. Bynum, who has been the mayor of Tulsa since 2016, said that a city committee was investigating the suspected mass grave sites and could decide by Feb. 3 whether to excavate them. This should have been done a long time ago, and the fact that were only do… [+877 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Donald G. Mcneil Jr.", "title": "Dr. John Robbins, Developer of a Meningitis Vaccine, Dies at 86", "description": "His method of boosting immune protection in babies helped save seven million lives. But he never profited from it.", "url": "https://www.nytimes.com/2019/12/17/health/john-b-robbins-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/science/00ROBBINS-obit/00ROBBINS-obit-facebookJumbo.jpg", "publishedAt": "2019-12-18T00:47:35Z", "content": "The next generation of vaccines, made of just the surface polysaccharides, were safer. But they rarely worked in children under age 2, who were the most at risk. Dr. Robbinss conjugate Hib vaccine protected babies as young as 2 months old. \r\nHib stands for Ha… [+1184 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nick Corasaniti", "title": "Impeachment Ad Wars", "description": "For Republicans, it’s all about attacking Democratic House members, especially those in congressional districts Mr. Trump won in 2016, with the goal of making their impeachment votes as difficult as possible. Republicans have put more than $16.7 million towar…", "url": "https://www.nytimes.com/2019/12/17/us/politics/impeachment-ad-wars.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/us/politics/17impeachmentads2-copy/17impeachmentads2-facebookJumbo.jpg", "publishedAt": "2019-12-18T00:43:00Z", "content": "The video, it turned out, was a parody by the comedian Nick Ciarelli, but it even confused some journalists. While a harmless joke, it showed just how easy it is for content to be spread and amplified in the modern political arena without anyone checking the … [+2692 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "MARGOT SANGER-KATZ", "title": "Doctors Win Again, in Cautionary Tale for Democrats", "description": "Democratic voters eager to see “Medicare for All” or some other major health overhaul pass the next time they control the White House may want to take a close look at what happened this week in Congress. Leaders from both parties had unveiled legislation to s…", "url": "https://www.nytimes.com/2019/12/17/upshot/surprise-billing-democrats-2020.html", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2019/12/62207571-fd42-441e-bca2-0e46f10b4966-1200x630.jpg", "publishedAt": "2019-12-18T00:40:11Z", "content": "Democratic voters eager to see Medicare for All or some other major health overhaul pass the next time they control the White House may want to take a close look at what happened this week in Congress.\r\nLeaders from both parties had unveiled legislation to st… [+6153 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Norman Mayersohn", "title": "Dogs in Cars, Getting There Safely", "description": "Like any family member, they need to be protected in case of a crash, but also should not distract the driver. Face licking is discouraged.", "url": "https://www.nytimes.com/2019/12/17/smarter-living/dogs-cars-safe-travel.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/multimedia/00sl-pets/00sl-pets-facebookJumbo.jpg", "publishedAt": "2019-12-18T00:30:07Z", "content": "Many families find that the most practical compromise between protection and comfort for their dog is a two-part solution. A travel harness straps around the dogs neck and behind the front legs, with its main support across the chest. The harness should conne… [+1916 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Debbie Dingell", "title": "Debbie Dingell: Why I Will Vote to Impeach Trump", "description": "My decision comes after careful study of testimony, investigative reports and history.", "url": "https://www.nytimes.com/2019/12/17/opinion/debbie-dingell-trump-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/opinion/17dingellWeb/17dingellWeb-facebookJumbo.jpg", "publishedAt": "2019-12-18T00:27:42Z", "content": "No matter the party affiliation of the person occupying the White House or the party of the majority in Congress, our founders built our Constitution on a system of three equal branches of government, with very clear oversight responsibilities delegated to th… [+1740 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "Protesters Clamor for Trump’s Impeachment on Eve of House Votes", "description": "A coalition of liberal groups that included MoveOn.org and Indivisible organized hundreds of rallies across the country.", "url": "https://www.nytimes.com/2019/12/17/us/impeachment-rallies.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/multimedia/17xp-impeachprosts/17xp-impeachprosts-facebookJumbo.jpg", "publishedAt": "2019-12-18T00:25:37Z", "content": "Erica Bruce, an interior designer who lives in New York, held up a gavel, made of garbage and paper, with the words Impeach Trump on it. The impeachment proceedings, she said, should serve as a wake-up call to voters.\r\nI think that what happens tomorrow is go… [+842 chars]"}]}