{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Not Quite Dating, but Certain About Forever", "description": "Rabiah Gul and Marcus Harun met last year through Muzmatch, a website that matches Muslim singles.", "url": "https://www.nytimes.com/2019/12/27/fashion/weddings/not-quite-dating-but-certain-about-forever.html", "urlToImage": "https://static01.nyt.com/images/2019/12/29/fashion/27Vows-LongIslandMuslim1/27Vows-LongIslandMuslim1-facebookJumbo.jpg", "publishedAt": "2019-12-29T03:05:34Z", "content": "Rabiah Gul had a couple of goals in mind when she first met Marcus Harun. First, she wanted to show him that she was the savvy New Yorker he was expecting. She also wanted to return home knowing he was the man she should marry, even though she had no intentio… [+871 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ken Belson", "title": "Concussion Lawsuit Against Pop Warner Is Dismissed", "description": "Two mothers blamed the youth football organization for the deaths of their sons, who were found to have a degenerative brain disease after a fatal motorcycle crash and suicide.", "url": "https://www.nytimes.com/2019/12/28/sports/football/pop-warner-lawsuit.html", "urlToImage": "https://static01.nyt.com/images/2019/12/28/sports/28popwarner-lede/merlin_132821960_577518cc-1a4e-45be-a23a-7873a6caa897-facebookJumbo.jpg", "publishedAt": "2019-12-29T01:50:34Z", "content": "A federal court judge has dismissed a lawsuit against Pop Warner, saying the two women who sued the youth football organization failed to prove that their sons deaths were directly linked to head trauma sustained a decade earlier as young players.\r\nThe women,… [+937 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "NEIL VIGDOR and Nicholas Bogel-Burroughs", "title": "Louisiana Plane Crash Kills 5, Including Sports Reporter", "description": "A sports reporter related to a Louisiana State University football coach was among the five people who died on their way to the team’s playoff game Saturday after a small plane crashed in Lafayette, Louisiana, authorities said. The reporter, Carley McCord, 30…", "url": "https://www.nytimes.com/2019/12/28/us/plane-crash-lafayette-post-office.html", "urlToImage": "https://www.seattletimes.com/wp-content/themes/st_refresh/img/st-meta-facebook.png", "publishedAt": "2019-12-29T01:28:13Z", "content": "A sports reporter related to a Louisiana State University football coach was among the five people who died on their way to the teams playoff game Saturday after a small plane crashed in Lafayette, Louisiana, authorities said.\r\nThe reporter, Carley McCord, 30… [+5620 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alan Blinder", "title": "Joe Burrow Threw 7 Touchdowns. And That Was Just L.S.U.’s First Half", "description": "Louisiana State easily blew past Oklahoma in their College Football Playoff semifinal, 63-28, earning a spot in the Jan. 13 championship game. Burrow, the Heisman Trophy winner, finished with 493 yards passing and eight total touchdowns.", "url": "https://www.nytimes.com/2019/12/28/sports/ncaafootball/lsu-oklahoma-college-football-playoff.html", "urlToImage": "https://static01.nyt.com/images/2020/01/26/sports/26cfp-peach-01/26cfp-peach-01-facebookJumbo.jpg", "publishedAt": "2019-12-29T01:01:36Z", "content": "The game moved L.S.U. into a title showdown that might as well be a home game played Jan. 13 in New Orleans, about 80 miles from its campus against either Clemson or Ohio State, the contenders in Saturday nights other semifinal, the Fiesta Bowl. L.S.U. has no… [+1575 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Scott Heller", "title": "Remembering Jerry Herman: ‘He Called His Shows His Children’", "description": "Harvey Fierstein, Betty Buckley and more on the sunny songwriter behind “Hello, Dolly!” and “Mame,” who hoped that even a flop would find a second life.", "url": "https://www.nytimes.com/2019/12/28/theater/remembering-jerry-herman-harvey-fierstein-chita-rivera.html", "urlToImage": "https://static01.nyt.com/images/2019/12/27/arts/27herman-remember3/27herman-remember3-facebookJumbo.jpg", "publishedAt": "2019-12-29T00:42:16Z", "content": "Everyone described Jerry Herman as an optimist. And certainly the Broadway songwriter, who died Thursday at 88, had reason to look on the bright side: Hello, Dolly!, Mame and La Cage aux Folles, to name his biggest hits, each ran for more than 1,500 performan… [+773 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Robert D. McFadden", "title": "Fred P. Graham, Legal Affairs Reporter and Court TV Anchor, Dies at 88", "description": "Mr. Graham covered the Supreme Court for The New York Times during an era of intense political upheaval and racial tension before becoming CBS’s law correspondent in 1972.", "url": "https://www.nytimes.com/2019/12/28/obituaries/fred-graham-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/28/multimedia/00graham/00graham-facebookJumbo.jpg", "publishedAt": "2019-12-29T00:40:22Z", "content": "Interviewing experts like the defense lawyer F. Lee Bailey, Mr. Graham functioned in the courtroom the way color commentators did at sporting events, covering the 1991 acquittal of William Kennedy Smith in a Florida rape case and the 1992 acquittals of four L… [+2077 chars]"}]}