{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Ives", "title": "Your Monday Briefing", "description": "Iran says it will abandon nuclear deal. Two days after the U.S. killed a top Iranian commander, Tehran appeared on Sunday to all but abandon a landmark nuclear agreement that it reached in 2015 with Britain, China, France, Germany, Russia and the United State…", "url": "https://www.nytimes.com/2020/01/06/briefing/iran-australia-golden-globes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/briefing/010620ambriefing-europe-promo/010620ambriefing-europe-promo-facebookJumbo.jpg", "publishedAt": "2020-01-06T05:40:00Z", "content": "The medieval system works pretty well. But it requires every fourth year to be a leap year, and 2020 is one. Well get an extra day, Feb. 29, to bring the calendar back in line with the actual time it takes the Earth to go around the sun: 365.24 days.\r\nTo keep… [+1178 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maya Salam", "title": "Women’s Rights, Australia Fires and Iran Hang Over Golden Globes", "description": "Michelle Williams, Patricia Arquette, Joaquin Phoenix and other winners took the opportunity to speak directly about some pressing events.", "url": "https://www.nytimes.com/2020/01/06/movies/golden-globes-speeches-michelle-williams.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/arts/05globes-iran2/05globes-iran2-facebookJumbo.jpg", "publishedAt": "2020-01-06T05:38:50Z", "content": "She wasnt the first to bring up the dire situation in Australia. Early on, Russell Crowe won best actor in a limited series forThe Loudest Voice. But he wasnt there to accept: He opted to remain at his home in Australia out of concern for the fires. Instead, … [+1826 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Baker", "title": "To Fight Climate Change, One City May Ban Heating Homes With Natural Gas", "description": "Seeking to do their part to avert climate change, dozens of cities are exploring ways to limit natural gas heating in new homes. One city may also require existing homeowners to make a switch.", "url": "https://www.nytimes.com/2020/01/05/us/bellingham-natural-gas-ban.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/us/05naturalgas1/05naturalgas1-facebookJumbo.jpg", "publishedAt": "2020-01-06T05:24:11Z", "content": "Mr. Colson said he had spent about $28,000 to install a forced-air heat pump system in 2018. He is looking to spend about $8,000 to change the heating for his homes hot water to heat pump technology. With human life on Earth at risk, Mr. Colson said, the glob… [+1717 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nancy Coleman", "title": "Tom Hanks at the Golden Globes: Don’t Be Late", "description": "The actor, accepting the Cecil B. DeMille lifetime achievement award, spent his speech offering some advice.", "url": "https://www.nytimes.com/2020/01/06/movies/tom-hanks-golden-globes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/arts/05globes-hanks1/05globes-hanks1-facebookJumbo.jpg", "publishedAt": "2020-01-06T05:03:55Z", "content": "Hanks is certainly qualified to give his input: He has won eight Golden Globes throughout his career, and he has been nominated at the awards 16 times. Hanks has won best actor in a motion picture four times at the Globes, for his roles in Big, Philadelphia, … [+514 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Benjamin Hoffman", "title": "What We Learned in the N.F.L.’s Wild-Card Round - The New York Times", "description": "What We Learned in the N.F.L.’s Wild-Card Round The New York Times Bill Belichick called Tom Brady 'iconic,' but it's no guarantee that the QB will return to New England Yahoo Sports Glauber: Brady's best option is to stay with Patriots Newsday AFC playoffs: …", "url": "https://www.nytimes.com/2020/01/06/sports/football/nfl-scores-wild-card.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/sports/06nfl-recap-topper/06nfl-recap-topper-facebookJumbo.jpg", "publishedAt": "2020-01-06T05:01:00Z", "content": "Texans 22, Bills 19 Josh Allen beat himself up quite a bit in the aftermath of Buffalos loss, but the second-year quarterback may want to keep something in mind: According to Pro Football Reference, he was just the third player in N.F.L. history to have 250 o… [+483 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Australian Bushfires Hit Businesses, Damage Still Being Assessed - The New York Times", "description": "As Australia's deadly bushfires rage, many companies are reporting hits to business with resorts shutting their doors, cheesemakers struggling to secure milk supplies and insurance claims on the rise.", "url": "https://www.nytimes.com/reuters/2020/01/05/world/asia/05reuters-australia-bushfires-companies.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-06T04:48:00Z", "content": "SYDNEY As Australia's deadly bushfires rage, many companies are reporting hits to business with resorts shutting their doors, cheesemakers struggling to secure milk supplies and insurance claims on the rise.\r\nAs many as 5,850 fire-related insurance claims hav… [+822 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "James Poniewozik", "title": "Hollywood Sheds Its Cares at the Golden Globes, but Not All of Them", "description": "Ricky Gervais’s nihilism-by-the-numbers returned, along with podium passion and the usual bubbles.", "url": "https://www.nytimes.com/2020/01/05/arts/television/golden-globes-review.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/arts/05globes-watch3/05globes-watch3-facebookJumbo.jpg", "publishedAt": "2020-01-06T04:45:26Z", "content": "Hey, everyone: Did you know that Ricky Gervais doesnt care?\r\nIf you didnt, you do now. I dont care anymore, he said, kicking off his opening monologue at Sundays Golden Globes. Im joking: I never did. Declaring that this would be his final outing as host, he … [+1325 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nancy Coleman", "title": "Golden Globes: Awkwafina Becomes First Asian-American to Win Best Actress", "description": "Awkwafina’s award for her role in “The Farewell” was the film’s only win of the night.", "url": "https://www.nytimes.com/2020/01/05/movies/awkwafina-golden-globes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/arts/06globes-awkwafina1/06globes-awkwafina1-facebookJumbo.jpg", "publishedAt": "2020-01-06T04:39:53Z", "content": "It was a dry year at the Globes for films directed by or about women, with The Farewell director Lulu Wang  and all other women being left out of the directing category.You gave me this chance, the chance of a lifetime, and you taught me so much, Awkwafina sa… [+1020 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kai Schultz and Suhasini Raj", "title": "Masked Men Attack Students in Rampage at University in New Delhi", "description": "Dozens were hurt by attackers who shouted Hindu slogans. Some students said they belonged to a far-right Hindu group, which denied involvement.", "url": "https://www.nytimes.com/2020/01/05/world/asia/india-jawaharlal-nehru-university-attack.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/world/05india-attack/05india-attack-facebookJumbo.jpg", "publishedAt": "2020-01-06T03:36:24Z", "content": "By late Sunday, government officials across party lines denounced the attack at Jawaharlal Nehru University. Mr. Modis party characterized it as a desperate attempt by forces of anarchy who are determined to use students as cannon fodder. Indias foreign minis… [+1621 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alexandra Stevenson", "title": "Oil Surges Above $70 a Barrel as Asian Markets Digest Iran News", "description": "Harsh rhetoric between Tehran and Washington spooked investors, sending Asian stocks down and gold prices higher.", "url": "https://www.nytimes.com/2020/01/05/business/global-markets-iran-oil.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/business/06markets2/06markets2-facebookJumbo.jpg", "publishedAt": "2020-01-06T03:31:43Z", "content": "Analysts at Capital Economics have warned that the price of oil could spike to $150 a barrel if the bellicose rhetoric between the two countries turned into action. \r\nThe price of oil would soar in the event of full-blown military conflict in the Middle East,… [+422 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maya Salam and Nancy Coleman", "title": "Kate McKinnon Opens Up About Being Gay During Golden Globes", "description": "In an emotional speech, the comedian says the only thing that made being a lesbian less scary when she was younger was seeing Ellen DeGeneres on TV.", "url": "https://www.nytimes.com/2020/01/05/arts/television/kate-mckinnon-gay-golden-globes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/arts/05globes-mckinnon2/05globes-mckinnon2-facebookJumbo.jpg", "publishedAt": "2020-01-06T03:25:28Z", "content": "Heres McKinnons speech in its entirety. The Carol Burnett Award is given to someone who like its namesake, Carol Burnett, has given us decades of laughter, tears and a new sense of whats possible. So I would like to read a list of things that tonights recipie… [+1466 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maya Salam", "title": "In Golden Globes Monologue, Ricky Gervais Gets Bleeped, Twice", "description": "During jokes about “Cats” and the Golden Globes ceremony as a whole, Gervais, the host, used expletives that NBC had to censor.", "url": "https://www.nytimes.com/2020/01/05/movies/ricky-gervais-golden-globes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/arts/05globes-monologue1/05globes-monologue1-facebookJumbo.jpg", "publishedAt": "2020-01-06T02:57:52Z", "content": "If you do win an award tonight, dont use it as a platform to make a political speech; youre in no position to lecture the public about anything, you know nothing of the real world, he said. If you win, come up, accept your little award, thank your agent and y… [+1043 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "U.S. stops dozens of Iranian-Americans returning from Canada", "description": "Dozens of Iranians and Iranian-Americans were held for hours at Washington state’s border with Canada over the weekend as the Department of Homeland Security ramped up security at border ports after Iran threatened to retaliate against the United States for t…", "url": "http://www.nytimes.com/2020/01/05/us/politics/iranian-americans-border.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/01/299cdc01ed0b4ec59994e30f8c8c89fb.jpg?w=1024&h=683", "publishedAt": "2020-01-06T02:43:19Z", "content": "By Zolan Kanno-Youngs, Mike Baker and Mariel Padilla, The New York Times\r\nWASHINGTON — Dozens of Iranians and Iranian-Americans were held for hours at Washington states border with Canada over the weekend as the Department of Homeland Security ramped up secur… [+7716 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "It’s not just software. New safety risks under scrutiny on Boeing’s 737 Max.", "description": "Even as Boeing inches closer to getting the 737 Max back in the air, new problems with the plane are emerging that go beyond the software that played a role in two deadly crashes.", "url": "http://www.nytimes.com/2020/01/05/business/boeing-737-max.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/01/03777195-fff6-477c-8a55-3c35dfe9dd56.jpg?w=1024&h=697", "publishedAt": "2020-01-06T02:08:32Z", "content": "By Natalie Kitroeff and David Gelles, The New York Times\r\nEven as Boeing inches closer to getting the 737 Max back in the air, new problems with the plane are emerging that go beyond the software that played a role in two deadly crashes.\r\nAs part of the work … [+9278 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Haberman", "title": "A Typical Trump Vacation, With a Momentous Result", "description": "For three years, President Trump’s winter visits to Mar-a-Lago, his private club, have allowed him time to combine his personal and presidential business. But the juxtaposition this year was something quite different.", "url": "https://www.nytimes.com/2020/01/05/us/politics/trump-mar-a-lago-iran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/nyregion/05dc-memo/05dc-memo-facebookJumbo.jpg", "publishedAt": "2020-01-06T02:00:54Z", "content": "Mr. Lauder, the president of the World Jewish Congress who recently started a new $25 million effort to fight anti-Semitism that employs a pollster working for Mr. Bloomberg, listened as Mr. Trump ticked off a litany of administration actions. Mr. Trump said … [+2036 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sara Aridi", "title": "Golden Globe Award Winners 2020: The List", "description": "Here are the winning films, TV shows, actors and production teams at the 2020 Golden Globe Awards.", "url": "https://www.nytimes.com/2020/01/05/movies/golden-globes-winners-list.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/arts/05globes-list-fleabag/05globes-list-fleabag-facebookJumbo.jpg", "publishedAt": "2020-01-06T01:43:38Z", "content": "The 77th Golden Globe Awards are underway. Follow our live coverage and read our critics reactions and analysis.\r\nSee the list of winners below.\r\nBest Motion Picture, Foreign Language\r\nParasite (South Korea)\r\nBest Television Series, Drama\r\nSuccession\r\nBest Pe… [+277 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ben Shpigel", "title": "Seahawks Knock Out Carson Wentz and the Eagles", "description": "Seattle quarterback Russell Wilson passed for 325 yards and a touchdown and Philadelphia struggled after its starting quarterback, Carson Wentz, left the game with a head injury.", "url": "https://www.nytimes.com/2020/01/05/sports/football/seahawks-eagles-score-playoffs.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/sports/05eagles-seahawks-1/05eagles-seahawks-1-facebookJumbo.jpg", "publishedAt": "2020-01-06T01:41:34Z", "content": "PHILADELPHIA The prevailing reason the Philadelphia Eagles were even playing on Sunday why they won their last four games, why they clinched the N.F.C. East title, why they hosted a playoff game clashed with what has become their standard operating procedure … [+1186 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nick Corasaniti", "title": "Missing From Democratic 2020 Ad Wars: Attacks on Rivals", "description": "Candidates seem to be channeling voters so intent on defeating President Trump that they don’t want to see Democrats attacking other Democrats.", "url": "https://www.nytimes.com/2020/01/05/us/politics/democratic-ads-2020-negative.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/us/politics/00ads2020-01/00ads2020-01-facebookJumbo.jpg", "publishedAt": "2020-01-06T01:41:24Z", "content": "Also in play are memories of 2016, when the bitter campaign between Hillary Clinton and Bernie Sanders left many supporters of Mr. Sanders alienated enough to stay home or vote for a third-party candidate. \r\nIn place of any negativity has been a focus on gene… [+2322 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "Tom Brady’s last pass puts his Patriots future in doubt", "description": "When Brady at last rose from the bench, he was still unaccompanied. There would be no embrace with coach Bill Belichick, who had already hastily made his exit.", "url": "http://www.nytimes.com/2020/01/05/sports/football/tom-bradys-patriots-titans-playoffs.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2020/01/555e77cc9432447db733eb76ca813c07.jpg?w=1024&h=683", "publishedAt": "2020-01-06T01:41:13Z", "content": "FOXBOROUGH, Mass. — With nine seconds left in what might have been his last game as a New England Patriot, Tom Brady was still trying to figure out what went wrong. A moment earlier, in his final act on the Gillette Stadium field late Saturday night, Brady th… [+5945 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Zolan Kanno-youngs", "title": "U.S. Stops Dozens of Iranian-Americans Returning From Canada", "description": "More than 60 people were held for additional questioning in Washington State, according to advocacy groups and accounts from travelers.", "url": "https://www.nytimes.com/2020/01/05/us/politics/iranian-americans-border.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/us/politics/05dc-border1/05dc-border1-facebookJumbo.jpg", "publishedAt": "2020-01-06T01:25:13Z", "content": "Sepehr Ebrahimzadeh, 33, of Seattle said he was returning from Canada on Saturday afternoon with his girlfriend after they spent a week out of town for the holidays. \r\nWith his green card and a NEXUS pass that allows expedited processing, Mr. Ebrahimzadeh has… [+1348 chars]"}]}