{"status": "ok", "totalResults": 7, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Andrew Higgins", "title": "It’s 50 Below. The Past Is a Horror Show. You’d Dream of Escaping Too.", "description": "Best known as the most feared and frigid outpost of the Soviet gulag, Magadan struggles to keep its residents from fleeing. The ice cream isn’t enough to keep them.", "url": "https://www.nytimes.com/2019/12/31/world/europe/russia-magadan-siberia.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/world/xxmagadan/xxmagadan-facebookJumbo.jpg", "publishedAt": "2019-12-31T07:19:23Z", "content": "When the Soviet Union collapsed in 1991, Magadan had 155,000 people. They were a mix of locally born residents many of them descendants of former gulag prisoners, guards or administrators and outsiders attracted by salaries that had for years been far higher … [+748 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Daniel Victor", "title": "Officer Admits He Faked Claim About McDonald’s Coffee Cup Insult - The New York Times", "description": "Officer Admits He Faked Claim About McDonald’s Coffee Cup Insult The New York Times Kansas officer resigned after he 'fabricated' McDonald's coffee cup with 'F-----g pig' on it: police chief Fox News Chief: Local officer resigns after making up coffee cup inc…", "url": "https://www.nytimes.com/2019/12/31/us/police-mcdonalds-coffee.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/world/31xp-police-coffee-1/31xp-police-coffee-1-facebookJumbo.jpg", "publishedAt": "2019-12-31T06:41:00Z", "content": "Herington, about 150 miles west of Kansas City, has a population of roughly 2,300. Lenor Brazzi, the director of operations for the McDonalds franchise in nearby Junction City, said at a news conference that the restaurant had been transparent and fully coope… [+932 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David Waldstein", "title": "For N.F.L. Rookie, the 12th Man Is the Friend He Lost", "description": "On the night Corey Ballentine was drafted by the Giants, his college teammate and buddy was killed in a shooting. But Ballentine, who was wounded in the incident, has persevered.", "url": "https://www.nytimes.com/2019/12/31/sports/football/giants-ballentine-topeka-simmons-shooting.html", "urlToImage": "https://static01.nyt.com/images/2019/12/26/sports/30ballentine-lookback/30ballentine-lookback-facebookJumbo.jpg", "publishedAt": "2019-12-31T06:00:08Z", "content": "Even when Ballentine struggled for a stretch, the Giants retained their faith in him, as did Craig Schurig, Ballentines coach at Washburn. Schurig watched as many of Ballentines Giants games as he could this season. But he was also busy with his team and with… [+1131 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times News Service Syndicate", "title": "Inside China’s push to turn Muslim minorities into an army of workers", "description": "The labor bureau of Qapqal ordered that villagers should undergo military-style training to convert them into obedient workers, loyal to employers and the ruling Communist Party.", "url": "http://www.nytimes.com/2019/12/30/world/asia/china-xinjiang-muslims-labor.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2019/12/8af636f8-b90b-490b-ba3b-7ae875be4947-2.jpg?w=1024&h=684", "publishedAt": "2019-12-31T05:55:32Z", "content": "KASHGAR, China — The order from Chinese officials was blunt and urgent. Villagers from Muslim minorities should be pushed into jobs, willing or not. Quotas would be set and families penalized if they refused to go along.\r\nMake people who are hard to employ re… [+11940 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Ives", "title": "Your Tuesday Briefing", "description": "Carlos Ghosn, Brexit, Cyprus: Here’s what you need to know.", "url": "https://www.nytimes.com/2019/12/31/briefing/ghosn-brexit-cyprus.html", "urlToImage": "https://static01.nyt.com/images/2019/12/30/business/31ambriefing-europe-promo/30ghosn1-facebookJumbo.jpg", "publishedAt": "2019-12-31T05:47:21Z", "content": "In some ways, Magadan, Russia, is a loose analogue to the Gold Rush towns that lured American and Canadian miners in the 19th century. But the Russians who passed through this grim, cold seaport in the 1920s didnt come to make their fortunes; they were dragge… [+851 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "Judge Orders Alex Jones and Infowars to Pay $100,000 in Sandy Hook Legal Fees", "description": "The ruling was part of a defamation lawsuit against Mr. Jones, who has promoted conspiracy theories that the 2012 school shooting in Connecticut was a hoax.", "url": "https://www.nytimes.com/2019/12/31/us/Alex-Jones-sandy-hook.html", "urlToImage": "https://static01.nyt.com/images/2019/12/30/us/30xp-alexjones1/30xp-alexjones1-facebookJumbo.jpg", "publishedAt": "2019-12-31T05:12:55Z", "content": "A Texas judge has ordered the Infowars founder Alex Jones to pay $100,000 in legal fees in a defamation case brought against him by the father of a Sandy Hook school shooting victim, the latest court setback for the conspiracy theorist.\r\nIn a Dec. 20 ruling, … [+809 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Quotation of the Day: Business Got Big Tax Cut; Lobbyists Made It Bigger - The New York Times", "description": "Quotation of the Day: Business Got Big Tax Cut; Lobbyists Made It Bigger The New York Times", "url": "https://www.nytimes.com/2019/12/30/todayspaper/quotation-of-the-day-business-got-big-tax-cut-lobbyists-made-it-bigger.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-31T04:35:00Z", "content": "It is largely the top 1 percent that will disproportionately benefit the wealthiest people in the world.\r\nBRET WELLS, a tax law professor at the University of Houston on how the Trump administration is transforming a tax package that slashed taxes for big com… [+46 chars]"}]}