{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Richard G. Hatcher, Ex-Mayor of Gary, Ind., and Champion of Urban and Black Issues, Dies at 86 - The New York Times", "description": "Richard G. Hatcher, Ex-Mayor of Gary, Ind., and Champion of Urban and Black Issues, Dies at 86 The New York Times Richard Hatcher, one of 1st black mayors of major city, dead at 86 NBC News Richard Hatcher, one of the nation’s first black mayors of a major ci…", "url": "https://www.nytimes.com/2019/12/14/us/richard-hatcher-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/14/multimedia/14hatcher/merlin_165962433_b3f3372d-3427-42d0-ae85-c1fab9047227-facebookJumbo.jpg", "publishedAt": "2019-12-14T23:50:00Z", "content": "His persuasive manner and political pursuits beyond Gary kept him in that role even after black mayors were elected in the 1970s in Detroit, Los Angeles, Atlanta and Washington. (A black mayor had taken office in Washington shortly before Mr. Hatcher and Mr. … [+1752 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reid J. Epstein", "title": "Cory Booker Leads the Charge to Change Debate Rules That Excluded Him", "description": "Nine presidential candidates have signed a letter urging the D.N.C. to adjust its qualification criteria for January and February.", "url": "https://www.nytimes.com/2019/12/14/us/politics/democrats-2020-debates.html", "urlToImage": "https://static01.nyt.com/images/2019/12/14/us/14debates/14debates-facebookJumbo.jpg", "publishedAt": "2019-12-14T21:57:02Z", "content": "The D.N.C. will not change the threshold for any one candidate and will not revert to two consecutive nights with more than a dozen candidates, Ms. Hinojosa said. Our qualification criteria is extremely low and reflects where we are in the race.\r\nMr. Booker f… [+1532 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Haberman", "title": "Ex-Trump Aide Is Expected to Return to White House", "description": "The aide, John McEntee, had been dismissed in 2018 on the orders of the chief of staff at the time, John F. Kelly.", "url": "https://www.nytimes.com/2019/12/14/us/politics/john-mcentee-white-house.html", "urlToImage": "https://static01.nyt.com/images/2019/12/14/us/politics/14DC-MCENTEE/14DC-MCENTEE-facebookJumbo.jpg", "publishedAt": "2019-12-14T21:49:59Z", "content": "A close aide to President Trump who was dismissed last year by the White House chief of staff at the time is expected to rejoin the West Wing, according to three people familiar with the move. \r\nJohn McEntee, who shadowed Mr. Trump as his body man, is slated … [+1003 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jason Horowitz", "title": "Italy’s New ‘Sardines’ Movement Packs Piazzas to Protest Far-Right Leader", "description": "A liberal, grass-roots movement aims to support civility, equality and a candidate to undercut Matteo Salvini’s anti-migrant rhetoric.", "url": "https://www.nytimes.com/2019/12/14/world/europe/italy-sardines-salvini.html", "urlToImage": "https://static01.nyt.com/images/2019/12/15/world/15taly/14italy-facebookJumbo.jpg", "publishedAt": "2019-12-14T21:17:47Z", "content": "At the rally in Rome on Saturday, young and old alike sang the song repeatedly as Ismail Sylla, a 23-year-old from Mali, marched by with other migrants in a group called the Black Sardines.\r\nMr. Sylla said the group hoped for the repeal of Mr. Salvinis tough … [+1145 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "FRANCES ROBLES", "title": "A Woman, a Banana and a $120,000 Question About What a Life Is Worth", "description": "KEY WEST, Fla. — It was a photo of a photo, and it was too good to resist: an image of a buzz-haired woman using her cellphone to capture a bruised banana stuck to the wall with a piece of duct tape at Art Basel in Miami Beach. The news of Italian artist Maur…", "url": "https://www.nytimes.com/2019/12/14/us/art-basel-banana-cancer-florida.html", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2019/12/e02df5e7-9495-4872-86d1-128d9f41e65d-1200x630.jpg", "publishedAt": "2019-12-14T20:40:39Z", "content": "KEY WEST, Fla. It was a photo of a photo, and it was too good to resist: an image of a buzz-haired woman using her cellphone to capture a bruised banana stuck to the wall with a piece of duct tape at Art Basel in Miami Beach.\r\nThe news of Italian artist Mauri… [+4413 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sewell Chan", "title": "Felix G. Rohatyn, Financier Who Piloted New York’s Rescue, Dies at 91", "description": "An immigrant from war-ravaged Europe, Mr. Rohatyn reached the apex of Wall Street and the inner circles of government and commerce.", "url": "https://www.nytimes.com/2019/12/14/nyregion/felix-rohatyn-dead.html", "urlToImage": "https://static01.nyt.com/images/2017/09/16/business/rohatyn-obit/rohatyn-obit-facebookJumbo.jpg", "publishedAt": "2019-12-14T20:33:03Z", "content": "After returning from four years in Paris at the end of 2000, Mr. Rohatyn, a compact man of sober, occasionally stern rectitude, settled into the role of wise eminence. He began writing, often for The New York Review of Books. He denounced the foreign and fisc… [+3081 chars]"}]}