{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mark Landler", "title": "Going Rogue: Prince Harry and Meghan Caught the Palace Off Guard", "description": "The queen had yet to give her approval to their idea of becoming part-time royals, but word of the plan was about to leak.", "url": "https://www.nytimes.com/2020/01/09/world/europe/duchess-sussex-prince.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/world/09royals/09royals-facebookJumbo.jpg", "publishedAt": "2020-01-09T21:34:25Z", "content": "Nor does the site offer details about their plan to work to become financially independent. Royal watchers said each could sign multi-million-dollar book deals or earn tens of thousands of dollars on the lecture circuit. But to do that, they would likely be a… [+1700 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "11 New Books We Recommend This Week", "description": "Suggested reading from critics and editors at The New York Times.", "url": "https://www.nytimes.com/2020/01/09/books/review/new-books-we-recommend-this-week.html", "urlToImage": "https://static01.nyt.com/images/2020/01/12/books/12edchoice-covers/12edchoice-covers-facebookJumbo.jpg", "publishedAt": "2020-01-09T21:26:57Z", "content": "THE GIMMICKS,by Chris McCormick. (Harper, $27.99.) McCormicks novel begins in the early 1970s, nearly 60 years after the Armenian genocide conducted by the Ottoman Empire. The story follows two cousins in Soviet Armenia who consider themselves brothers: Ruben… [+3166 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Shannon Hall", "title": "Volcanoes on Venus Might Still be Smoking", "description": "Planetary science experiments on Earth suggest that the sun’s second planet might have ongoing volcanic activity.", "url": "https://www.nytimes.com/2020/01/09/science/venus-volcanoes-active.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/science/09TB-VENUS1/09TB-VENUS1-facebookJumbo.jpg", "publishedAt": "2020-01-09T21:23:34Z", "content": "Venus is our toxic twin. Its chemical makeup, size and density is similar to our worlds, although its hellish temperatures can melt lead, and its atmosphere is rife with sulfuric acid.\r\nBut it may be even more Earthlike that we knew. A paper published last we… [+981 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Edward Wong", "title": "Trump Administration’s Actions in Middle East Weaken Its Criticisms of China", "description": "President Trump’s use of military force against Iran gives Beijing ammunition to highlight failures of American policy, even as the Communist Party represses Muslims in China.", "url": "https://www.nytimes.com/2020/01/09/world/asia/trump-china-iran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/us/politics/09dc-chinairan-1/09dc-chinairan-1-facebookJumbo.jpg", "publishedAt": "2020-01-09T21:05:09Z", "content": "His aggressive push on Iran, which reached a new level of hostility with the killing of General Suleimani, has underscored that view of Washingtons policy, though officials argue that the Trump administration was seeking to deter Iran from attacking American … [+2473 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Christine Hauser", "title": "Teacher Is Charged With Battery After Throwing Student Out of Class - The New York Times", "description": "Teacher Is Charged With Battery After Throwing Student Out of Class The New York Times A teacher is charged with battery after video shows him grabbing and carrying a student, police say CNN International Teacher charged with battery after video shows middle …", "url": "https://www.nytimes.com/2020/01/09/us/buddy-taylor-middle-school-teacher-arrest.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/multimedia/09xp-florida/09xp-florida-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:32:00Z", "content": "On Tuesday, the student told his parents what happened and they contacted school administrators, the sheriffs statement said. Mr. Paffumi, who was arrested on Wednesday, did not reply to a voice mail message on Thursday. It was not immediately clear whether h… [+1414 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Matt Stevens", "title": "Competing for Sanders’s New Hampshire Voters: Yang and Gabbard - The New York Times", "description": "Competing for Sanders’s New Hampshire Voters: Yang and Gabbard The New York Times Buttigieg doubles and Warren drops in New Hampshire poll POLITICO Buttigieg, Biden, Sanders battle for lead in latest New Hampshire poll Fox News Mapping Out the Expectations Ga…", "url": "https://www.nytimes.com/2020/01/09/us/politics/bernie-sanders-andrew-yang-tulsi-gabbard.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/us/politics/09sanders-yang1/09sanders-yang1-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:25:00Z", "content": "Now Mr. Sanders is facing much stiffer competition for those voters, including from Ms. Gabbard and Mr. Yang. In Thursdays Monmouth poll, Mr. Sanders drew the support of 20 percent of non-Democrats, while Ms. Gabbard had 8 percent and Mr. Yang 3 percent.\r\nAnd… [+1706 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Melina Delkic", "title": "Your Friday Briefing", "description": "Iran, Ukrainian airline crash, Taiwan elections: Here’s what you need to know.", "url": "https://www.nytimes.com/2020/01/09/briefing/iran-ukraine-crash-taiwan-elections.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/briefing/10Briefing-Asia-promo/10Briefing-Asia-promo-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:23:04Z", "content": "As the Taiwan elections set for this Saturday approach, Chinas influence looms large but not in the way Beijing hoped.\r\nJust a year ago, President Tsai Ing-wens party suffered a humiliating defeat. Now, she has made a remarkable comeback by being Chinas least… [+769 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Christiaan Triebert, Malachy Browne, Sarah Stein Kerr and Ainara Tiefenthäler", "title": "Video Shows Ukrainian Airliner Being Hit Over Iran", "description": "The New York Times has obtained video that shows the moment a Ukrainian airliner was hit minutes after takeoff from Tehran.", "url": "https://www.nytimes.com/2020/01/09/video/iran-plane-missile.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/video/xxivid-iran-plane-2/xxivid-iran-plane-2-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:16:08Z", "content": "Video verified by The New York Times appears to show an Iranian missile hitting a plane above Parand, near Tehrans airport, the area where a Ukrainian airliner stopped transmitting its signal before it crashed on Wednesday. \r\nA small explosion occurred when a… [+381 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Caity Weaver and Elizabeth Paton", "title": "What to Know About Prince Harry and Meghan, Duchess of Sussex, Stepping Back", "description": "The Duke and Duchess of Sussex want to be “financially independent.” What does that mean? Also, can you quit being a “senior” royal?", "url": "https://www.nytimes.com/2020/01/09/style/royal-family.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/fashion/09RoyalFAQ-2/09RoyalFAQ-2-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:14:28Z", "content": "Not exactly. The last couple to reject senior royal life was Edward VIII and Wallis Simpson, the original divorced American duchess for whom he relinquished the throne in 1936. But he was, you know, the actual head of state, so the decision prompted a full-bl… [+1746 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Afua Hirsch", "title": "Black Britons Know Why Meghan Markle Wants Out", "description": "It’s the racism.", "url": "https://www.nytimes.com/2020/01/09/opinion/meghan-markle-prince-harry.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/opinion/09Hirsch/09Hirsch-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:11:34Z", "content": "Meghans decision to join the family that is the symbolic heart of the establishment responsible for this troubled history was perplexing to many black British people, as we wondered whether she fully appreciated the institution she had entered.\r\nBoth she and … [+2328 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ben Kenigsberg", "title": "Review: Two Battle Diaries from Iraq", "description": "In the documentaries “Peshmerga” and “The Battle of Mosul,” Bernard-Henri Lévy offers a portrait of the fighters trying to repel the Islamic State.", "url": "https://www.nytimes.com/2020/01/09/movies/peshmerga-battle-of-mosul-review.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/arts/09peshmerga/09peshmerga-facebookJumbo.jpg", "publishedAt": "2020-01-09T20:08:04Z", "content": "The city becomes the main front in The Battle of Mosul, a follow-up best seen after Peshmerga, not independently. Part sequel and part epilogue, it captures the citys liberation from the Islamic State in 2016 and 2017. The rubble of buildings is seen more cle… [+482 chars]"}]}