{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maria Cramer", "title": "Remains Found on California Mountain Belonged to Manzanar Detainee", "description": "In 1945, Giichi Matsumura left the infamous Japanese-American internment camp to paint in the Sierra Nevada and never returned.", "url": "https://www.nytimes.com/2020/01/04/us/giichi-matsumura-remains-manzanar-internment.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/us/04xp-remains-1/04xp-remains-1-facebookJumbo.jpg", "publishedAt": "2020-01-05T05:26:23Z", "content": "Giichi and Ito Matsumura had decided to stay.\r\nThe Matsumuras, like many families incarcerated during the war, had no home or business to return to and so they continued living in Manzanar, according to the joint statement.\r\nThe day Mr. Matsumura left with th… [+1081 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Islamist Group Al Shabaab Attacks Kenya Base Used by Kenyan, U.S. Forces - The New York Times", "description": "Somalia's Islamist group al Shabaab on Sunday attacked a military base in Lamu county in Kenya that is used by both U.S. and Kenyan forces, a source and al Shabaab said.", "url": "https://www.nytimes.com/reuters/2020/01/05/world/africa/05reuters-kenya-security.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-05T05:24:00Z", "content": "NAIROBI Somalia's Islamist group al Shabaab on Sunday attacked a military base in Lamu county in Kenya that is used by both U.S. and Kenyan forces, a source and al Shabaab said. \r\n\"They have attacked Manda airstrip in Lamu, which is just next to the military … [+589 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Livia Albeck-Ripka, Jamie Tarabay and Isabella Kwai", "title": "As Fires Rage, Australia Sees Its Leader as Missing in Action", "description": "The country is venting frustration with Prime Minister Scott Morrison over what many view as a nonchalant response to the disastrous blazes and his unwavering dismissal of climate change.", "url": "https://www.nytimes.com/2020/01/04/world/australia/fires-scott-morrison.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/world/00oz-politics-1/00oz-politics-1-facebookJumbo.jpg", "publishedAt": "2020-01-05T05:00:55Z", "content": "The government claims it has reduced emissions, Mr. Hare said. What theyre using are essentially accounting tricks to justify or explain their reasoning. \r\nIn his news conference on Thursday, Mr. Morrison framed the governments climate policy in a way he ofte… [+1091 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kurt Streeter", "title": "The Unbearable Lightness of Being Russell Wilson", "description": "Once derided as a goody-goody, the Seattle Seahawks quarterback has had to be perfect for his team to win this season. Can he keep it up and exorcise a Super Bowl ghost?", "url": "https://www.nytimes.com/2020/01/04/sports/football/russell-wilson-nfl-playoffs-2019.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/sports/03nfl-wilson-top-sub/03nfl-wilson-top-sub-facebookJumbo.jpg", "publishedAt": "2020-01-05T04:39:53Z", "content": "As usual,he was the last to speak with reporters after the game. It took nearly an hour for him to emerge from the locker room. Most of his teammates, who, to be fair, had played just as poorly, were already lining up for the Seahawks bus when Wilson walked b… [+1687 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "Congress, Stop President Trump’s Rush to War With Iran", "description": "Powerful Republican senators are the only people with the power to restrain the president.", "url": "https://www.nytimes.com/2020/01/04/opinion/editorials/trump-iran-threats-Suleimani.html", "urlToImage": "https://static01.nyt.com/images/2020/02/04/opinion/04trump/merlin_166664880_e8a357f2-e626-4e25-9af3-1c7439d6c602-facebookJumbo.jpg", "publishedAt": "2020-01-05T04:27:57Z", "content": "Mr. Trump cant keep an entire region from crossing his red line, making violent conflict all the more likely if the president holds to it. And Iran itself can respond less directly, but no less effectively, with cyberwarfare, attacking American allies in the … [+1431 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Bill Pennington", "title": "Tom Brady and the Patriots Are Upset by the Titans in a Stunner", "description": "A wild-card defeat stifled New England’s pursuit of a record-breaking seventh Super Bowl title. Did it also spell the end of the Belichick-Brady era?", "url": "https://www.nytimes.com/2020/01/04/sports/football/patriots-titans-upset-brady.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/sports/04nfl-patslose-brady/04nfl-patslose-brady-facebookJumbo.jpg", "publishedAt": "2020-01-05T04:23:22Z", "content": "FOXBOROUGH, Mass. The New England Patriots quest for a record seventh Super Bowl championship ended abruptly Saturday night at Gillette Stadium with a 20-13upset loss to the Tennessee Titans in the wild-card round of the N.F.L. playoffs. The defeat for the de… [+990 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elizabeth A. Harris", "title": "‘Surviving R. Kelly’ Recap: The Year Everything Changed - The New York Times", "description": "‘Surviving R. Kelly’ Recap: The Year Everything Changed The New York Times 'Surviving R. Kelly Part II': What Terrifying Promise Does Jerhonda Pace Say She Made to R. Kelly? Showbiz Cheat Sheet Dame Dash Claims Aaliyah Was Happy To Be Rid Of R Kelly Following…", "url": "https://www.nytimes.com/2020/01/04/arts/television/surviving-r-kelly-2.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/arts/04rkelly1/04rkelly1-facebookJumbo.jpg", "publishedAt": "2020-01-05T03:00:00Z", "content": "Ms. Gardner and Ms. Kramer describe him as not only enormously controlling but also physically abusive. Ms. Kramer said that Mr. Kelly would beat Ms. Gardner with extension cords, belts, shoes and whatever you could think of. Once when Ms. Gardner didnt come … [+1647 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jeanna Smialek, Jim Tankersley and Ben Casselman", "title": "Low Interest Rates Worry the Fed. Ben Bernanke Has Some Ideas.", "description": "Federal Reserve rates are still really low. Mr. Bernanke believes unconventional policies can make up for that — but with a caveat.", "url": "https://www.nytimes.com/2020/01/04/business/economy/low-interest-rates-ben-bernanke.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/business/04dc-fed/04dc-fed-facebookJumbo.jpg", "publishedAt": "2020-01-05T02:00:31Z", "content": "Under the leadership of the Fed chair, Jerome H. Powell, the central bank has been carrying out a review of its policy framework, researching and talking through how it might supplement its policy tool kit and keep inflation from drifting lower. That process … [+1344 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Helene Cooper, Eric Schmitt, Maggie Haberman and Rukmini Callimachi", "title": "As Tensions With Iran Escalated, Trump Opted for Most Extreme Measure", "description": "While senior officials argue the drone strike was warranted to prevent future attacks, some in the administration remain skeptical about the rationale for the attack.", "url": "https://www.nytimes.com/2020/01/04/us/politics/trump-suleimani.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/world/05dc-military-1/05iran-europe-facebookJumbo.jpg", "publishedAt": "2020-01-05T00:40:44Z", "content": "Secretary of State Mike Pompeo and Vice President Mike Pence were two of the most hawkish voices arguing for a response to Iranian aggression, according to administration officials. Mr. Pences office helped run herd on meetings and conference calls held by of… [+1721 chars]"}]}