{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Richard C. Paddock", "title": "Indonesia Lets Plastic Burning Continue Despite Warning on Toxins", "description": "The Indonesian government pushed back on an international study that found high levels of dioxin in a village where plastic is burned to produce tofu.", "url": "https://www.nytimes.com/2019/12/19/world/asia/indonesia-dioxin-plastic-tofu.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/world/19indonesia-toxin-1/19indonesia-toxin-1-facebookJumbo.jpg", "publishedAt": "2019-12-19T07:54:38Z", "content": "Some of the plastic trash burned by the tofu makers came from the United States and other countries, where it was initially intended for recycling but was improperly shipped to Indonesia as paper waste.\r\nIn an effort to reduce the amount of plastic being burn… [+885 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Trish Bendix", "title": "Trump Has Been Moved to America’s Spam Folder, Says Trevor Noah", "description": "The impeachment, of course, was the talk of late night on Wednesday. Noah said President Trump had gone through “all the stages of grief in one tweet.”", "url": "https://www.nytimes.com/2019/12/19/arts/television/late-night-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/arts/19latenight/19latenight-facebookJumbo.png", "publishedAt": "2019-12-19T07:18:35Z", "content": "Welcome to Best of Late Night, a rundown of the previous nights highlights that lets you sleep and lets us get paid to watch comedy. If youre interested in hearing from The Times regularly about great TV, sign up for our Watching newsletter and get recommenda… [+452 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "How the immigrant dream died in an automotive shantytown", "description": "In the heart of Queens lies one of New York City’s most curious and untamed neighbourhoods — a warren of squalid streets lined with flimsy auto repair shops that bustle with commerce and camaraderie.", "url": "https://www.nytimes.com/2019/12/18/nyregion/willets-point-development-queens.html ", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2019/12/19/immigrant-jobs-191219-01.jpg/ALTERNATES/w640/Immigrant-jobs-191219-01.jpg", "publishedAt": "2019-12-19T06:23:08Z", "content": "Mechanics delve deep under car hoods, and hawkers barrage drivers with quick, cheap repair offers. Pneumatic tools squeal over the banter of Spanish-speaking mechanics. The pungent aroma of epoxy wafts out of auto body shops and mingles with the savoury smell… [+11111 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Ives", "title": "Your Thursday Briefing", "description": "Impeachment, Brexit, China: Here’s what you need to know.", "url": "https://www.nytimes.com/2019/12/19/briefing/impeachment-brexit-china.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/world/19ambriefing-europe-promo/19ambriefing-europe4-facebookJumbo.jpg", "publishedAt": "2019-12-19T05:54:52Z", "content": "Todays speech comes a week after the Conservative Party won a landslide victory in a general election, and a day before Parliament begins debating legislation that would enable Britain to leave the European Union on Jan. 31 Mr. Johnsons central campaign promi… [+1190 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Erin McCann", "title": "‘Star Wars: The Rise of Skywalker’: A Spoiler-Free Review Roundup", "description": "It’s a film four decades in the making. Was it worth the wait?", "url": "https://www.nytimes.com/2019/12/19/movies/is-rise-of-skywalker-good.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/multimedia/18xp-starwarsreview3/18xp-starwarsreview3-facebookJumbo.jpg", "publishedAt": "2019-12-19T05:30:06Z", "content": "While lots of things occur, very little actually happens, writes Alissa Wilkinson at Vox. \r\nThe least possible amount of character development happens (except in one oddly shallow case), mostly because the movie which clocks in at about two hours and 20 minut… [+3147 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Fandos", "title": "Timing of Trump Impeachment Trial in Limbo as Pelosi Holds Out for Assurances", "description": "In declining to say when she might send the articles of impeachment to the Senate, Speaker Nancy Pelosi suggested she might keep them as leverage for negotiations on the rules for a trial.", "url": "https://www.nytimes.com/2019/12/18/us/politics/impeachment-trial.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/us/politics/18dc-articles-sub/merlin_166160871_1a86c796-dafb-4d7c-9c6e-4b7e05f12360-facebookJumbo.jpg", "publishedAt": "2019-12-19T04:43:08Z", "content": "This is what I dont consider a fair trial, Ms. Pelosi said on Wednesday.\r\nRepresentative Earl Blumenauer, Democrat of Oregon, said he had spoken to at least 40 Democrats who were concerned that Mr. McConnell would not conduct a fair trial, and who wanted Ms. … [+1595 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "How ‘Lev and Igor’ fuelled the Trump impeachment flames", "description": "On a warm summer evening last year, Lev Parnas stepped aboard a private cruise around New York Harbour for a gathering of some of Rudy Giuliani’s closest friends.", "url": "https://www.nytimes.com/2019/12/18/nyregion/parnas-fruman-giuliani-ukraine.html", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2016/05/31/bdnews24-icon.png/BINARY/bdnews24-icon.png", "publishedAt": "2019-12-19T04:37:33Z", "content": "Passengers sipped wine and cocktails while they sailed past the Statue of Liberty, singing along as another guest, entertainer Joe Piscopo, belted out Theme from New York, New York. Giuliani, a personal lawyer to President Donald Trump, relaxed on the open de… [+21231 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "What’s Next for Donald Trump? After impeachment by House, here’s how Senate trial is expected to play out", "description": "Now that the House has voted to impeach President Donald Trump, the matter moves to the Senate for a trial — the third for an American president The post What’s Next for Donald Trump? After impeachment by House, here’s how Senate trial is expected to play out…", "url": "https://www.nytimes.com/2019/12/18/us/politics/senate-impeachment-trial.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/large_file_plugin/2019/08/1566359361_trumpap.jpeg", "publishedAt": "2019-12-19T04:23:26Z", "content": "Now that the House has voted to impeach President Donald Trump, the matter moves to the Senate for a trial the third for an American president.\r\nA two-thirds majority 67 senators is required to convict and remove the president. Republicans control the Senate,… [+5415 chars]"}]}