{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Emily Flitter", "title": "Bernie Ebbers, WorldCom Chief Jailed for Fraud, Will Leave Prison Early", "description": "His daughter, in a court filing, said he was “experiencing full-blown dementia.”", "url": "https://www.nytimes.com/2019/12/18/business/bernard-ebbers-prison-release.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/business/18ebbers/18ebbers-facebookJumbo.jpg", "publishedAt": "2019-12-19T00:19:13Z", "content": "Bernard J. Ebbers, who was imprisoned in 2006 after his conviction in one of the biggest American frauds of the 20th century, will soon be free after serving a little over half of a 25-year sentence.\r\nMr. Ebbers, also known as Bernie, was sent to federal pris… [+878 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Miriam Pawel", "title": "Which Democrat Will Star in Hollywood’s Democratic Debate?", "description": "The candidates must know the quirks of California’s vast political geography.", "url": "https://www.nytimes.com/2019/12/18/opinion/los-angeles-debate.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/opinion/18pawel/18pawel-facebookJumbo.jpg", "publishedAt": "2019-12-19T00:04:32Z", "content": "California is a state of extremes. Angelenos like to boast that in normal weather, if such a thing ever returns, you can ski in the morning in the mountains east of the city and swim in the ocean in the afternoon. The political equivalent may be the jarring j… [+2971 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David Waldstein", "title": "With Nods to the Past, Gerrit Cole Embraces His Yankees Future - The New York Times", "description": "With Nods to the Past, Gerrit Cole Embraces His Yankees Future The New York Times Gerrit Cole - 'It was my dream' to pitch for Yankees ESPN Gerrit Cole's first interview as a Yankee YESNetwork New York Yankees designate RHP Chance Adams for assignment Elite S…", "url": "https://www.nytimes.com/2019/12/18/sports/baseball/gerrit-cole-yankees.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/sports/18cole-web1/18cole-web1-facebookJumbo.jpg", "publishedAt": "2019-12-19T00:04:00Z", "content": "I mean, its 18 years old, Cole said.\r\nBut perhaps it was most surprising when Cole took the opportunity to mention Marvin Miller, the longtime head of the players union who led the fight for free agency in the 1970s, and Curt Flood, the player who challenged … [+1107 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Trip Gabriel", "title": "Where Impeachment Crosses Party Lines, but Fixates on Trump", "description": "In the changing suburbs of Bucks County in Pennsylvania, where traditional party allegiances are scrambled, voters viewed impeachment through the prism of President Trump.", "url": "https://www.nytimes.com/2019/12/18/us/politics/trump-impeachment-republican-voters-bucks-county.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/us/politics/18impeach-buckscounty-top/18impeach-buckscounty-top-facebookJumbo.jpg", "publishedAt": "2019-12-19T00:01:32Z", "content": "Voters views on impeachment seemed to hew to their deeply dug-in feelings about Mr. Trump. But often, as in Ms. Broadheads case, those views were detached from voters longstanding party allegiances. \r\nIt reflected Mr. Trumps dueling influences in this critica… [+1249 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Dalmeet Singh Chawla", "title": "There’s No Winter Break From ‘Publish or Perish’", "description": "An analysis of submissions to two top journals showed that scientists in the U.S. were highly likely to be working during holidays.", "url": "https://www.nytimes.com/2019/12/18/science/scientists-holiday-work.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/science/18SCI-HOLIDAYS1/18SCI-HOLIDAYS1-facebookJumbo.jpg", "publishedAt": "2019-12-19T00:00:09Z", "content": "The study aiming to quantify some of the overwork and burnout experienced by researchers in the sciences examined nearly 50,000 manuscript submissions and more than 75,000 peer-review submissions to BMJ and its sister journal, BMJ Open. More than a tenth of U… [+1059 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Manohla Dargis", "title": "‘Cats’ Review: They Dance, They Sing, They Lick Their Digital Fur", "description": "Tom Hooper’s movie is not a catastrophe. It’s not even an epic hairball.", "url": "https://www.nytimes.com/2019/12/18/movies/cats-review.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/arts/00cats-1/00cats-1-facebookJumbo.jpg", "publishedAt": "2019-12-19T00:00:08Z", "content": "It is tough to pinpoint when the kitschapalooza called Cats reaches its zenith or its nadir, which are one and the same. The choices are legion: Judi Dench gliding in as Old Deuteronomy, a Yoda-esque fluff ball with a huge ruff who brings to mind the Cowardly… [+1613 chars]"}]}