{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Deb Amlen", "title": "Take for a Spin", "description": "— Now this is the way to slide into a weekend, particularly the last one of the year. Sam Trabucco debuts a whopping 10 entries and even the stuff we’ve seen before is delightful. It’s not the most difficult Friday puzzle I’ve ever solved, but that’s meant to…", "url": "https://www.nytimes.com/2019/12/26/crosswords/daily-puzzle-2019-12-27.html", "urlToImage": "https://static01.nyt.com/images/2019/12/27/crosswords/27wordplay-racecar/merlin_24220895_b7bfa44b-4bd5-4dae-bde4-b4fb294e1bab-facebookJumbo.jpg", "publishedAt": "2019-12-27T03:56:00Z", "content": "8D. Nicely done. A Father figure? is a DAD BOD.\r\n46D. The clue Wedding circle? sounds as if it might be hinting at a wedding ring, but not in this puzzle. This is a Jewish wedding, and we are dancing the HORA, which is performed in a circle.\r\n52D. I love this… [+956 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Daniel Victor", "title": "At Least 7 Killed in Plane Crash in Kazakhstan - The New York Times", "description": "At Least 7 Killed in Plane Crash in Kazakhstan The New York Times Kazakhstan plane crash: Bek Air plane comes down near Almaty airport BBC News Almaty plane crash: Bek Air flight crashes in Kazakstan CNN Airliner carrying 100 passengers crashes near Kazakhsta…", "url": "https://www.nytimes.com/2019/12/26/world/asia/plane-crash-almaty-kazakhstan.html", "urlToImage": "https://static01.nyt.com/images/2019/12/26/us/26alamaty-crash/26alamaty-crash-facebookJumbo.jpg", "publishedAt": "2019-12-27T03:48:00Z", "content": "At 7:22 a.m., the plane, a Fokker 100,bound for Nur-Sultan, the Kazakhstan capital, lost altitude and crashed into a two-story building, officials said."}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Heather Murphy", "title": "The F.A.A. Wants to Start Tracking Drones’ Locations", "description": "A proposal would require most drones flying in American airspace to include technology that would allow the government to keep tabs on them.", "url": "https://www.nytimes.com/2019/12/26/business/drones-faa-tracking.html", "urlToImage": "https://static01.nyt.com/images/2019/12/26/multimedia/26xp-drone/26xp-drone-facebookJumbo.jpg", "publishedAt": "2019-12-27T03:25:18Z", "content": "Search and rescue missions often require going at least four times that distance, he said. People will literally die from these rules, he said, adding that other industries that are thriving with drones like utility inspection, precision agriculture, land sur… [+1421 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Associated Press", "title": "Louisiana Tech Beats Miami 14-0 in Independence BowlLouisiana Tech Beats Miami 14-0 in Independence Bowl - The New York Times", "description": "J'Mar Smith threw a touchdown pass and had a late scoring run to help Louisiana Tech beat Miami 14-0 on Thursday night in the only shutout in the Independence Bowl’s 44-game history.", "url": "https://www.nytimes.com/aponline/2019/12/26/sports/ncaafootball/bc-fbc-independence-bowl.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-27T01:24:00Z", "content": "The teams set the game record for punts at 18, with both tying the single-club record of nine.\r\nTHE TAKEAWAY\r\nLouisiana Tech: The season will forever be tainted by what if for the Bulldogs. Following a season-opening loss at Texas, Louisiana Tech rattled off … [+692 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katharine Q. Seelye", "title": "William Greider, Journalist Who Focused on Economy, Dies at 83", "description": "In interviews with Reagan’s budget director, David Stockman, he exposed doubts about the supply-side economics that the administration had embraced.", "url": "https://www.nytimes.com/2019/12/26/business/media/william-greider-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/27/obituaries/27greider/27greider-facebookJumbo.jpg", "publishedAt": "2019-12-27T00:48:32Z", "content": "None of us really understands whats going on with all these numbers, Mr. Stockman told Mr. Greider in one of several damning passages.\r\nThe essay won the George Polk Award for magazine writing and was reprinted as part of Mr. Greiders subsequent book, The Edu… [+1243 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ed Shanahan", "title": "E-Bikes and E-Scooter Rentals Won’t Be Allowed in N.Y. Anytime Soon", "description": "Gov. Andrew Cuomo vetoed a bill that would have legalized both types of transport, angering supporters of the measure.", "url": "https://www.nytimes.com/2019/12/26/nyregion/Ebikes-scooters-Bill-ny.html", "urlToImage": "https://static01.nyt.com/images/2019/12/27/nyregion/27ebikes-print1/27ebikes-facebookJumbo.jpg", "publishedAt": "2019-12-27T00:38:36Z", "content": "Danny Harris, the executive director of Transportation Alternatives, an advocacy organization, said in a statement that Governor Cuomo, a supposed champion for immigrants and the working poor, has failed to protect 40,000 low-wage, mostly immigrant workers in… [+1449 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Rory Smith", "title": "In Premier League, Everyone Is Talking Title Except Liverpool", "description": "A victory at Leicester extended its advantage atop the Premier League, but the team’s players and fans are reluctant to tempt fate this time.", "url": "https://www.nytimes.com/2019/12/26/sports/soccer/liverpool-leicester-premier-league.html", "urlToImage": "https://static01.nyt.com/images/2019/12/27/sports/26onsoccer-liverpool-print/26onsoccer1-facebookJumbo.jpg", "publishedAt": "2019-12-27T00:08:55Z", "content": "There is a reason. Liverpools fans know more than most about tempting fate. They sang the line in 2009, after a last-minute, pulse-quickening win against Fulham in the spring, only to see Manchester United slip into another gear and roar past in the last few … [+856 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Debora Spar", "title": "The Rise of Fertility Start-ups", "description": "For Green and the Forerunner team, whose previous investments include retail companies like Warby Parker, Glossier and Dollar Shave Club, the appeal came from recognizing that low customer satisfaction in health care, and a dearth of investment in women’s hea…", "url": "https://parenting.nytimes.com/becoming-a-parent/fertility-startups-kindbody", "urlToImage": "https://static01.nyt.com/images/2019/12/19/multimedia/19-parenting-babybusiness/19-parenting-babybusiness-facebookJumbo.jpg", "publishedAt": "2019-12-27T00:00:00Z", "content": "CreditArmando Veve\r\nOver the course of 2019 alone, investors have put more than $150 million into companies like Modern Fertility and EverlyWell, which make at-home fertility-testing kits for women (each $159); Dadi, which provides sperm testing, freezing and… [+4100 chars]"}]}