{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Glueck", "title": "Joe Biden, Seeking Commander-in-Chief Moment, Denounces Trump’s Iran Aggression", "description": "Because the president “refuses to level with the American people” about the dangers United States troops and civilians now face in the Middle East, Joe Biden said, “I will attempt to do that.”", "url": "https://www.nytimes.com/2020/01/07/us/politics/joe-biden-elizabeth-warren-foreign-policy.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/us/politics/07Dems/07Dems-facebookJumbo.jpg", "publishedAt": "2020-01-07T21:01:49Z", "content": "Mr. President, he urged, you have to explain your decision and your strategy to the American people. Thats your job as president, Mr. President. Not Dear Leader. Not Supreme Leader. Democracy runs on accountability, and nowhere is it more important than the p… [+1275 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jonah Engel Bromwich", "title": "Donate $10 to Australia, Get a Nude Photo", "description": "Nude models are raising money for wildfire relief in Australia with the promise of personal pictures.", "url": "https://www.nytimes.com/2020/01/07/style/kaylen-ward-donations-australia-fires.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/fashion/07firenude-2/07firenude-2-facebookJumbo.jpg", "publishedAt": "2020-01-07T21:01:04Z", "content": "Ms. Wards mission was tabloid catnip, covered in The Mirror,The New York Post, The Sun and The Daily Mail. The author of the Mirror story, Milo Boyd, said that he knew fairly quickly that it would be popular with the tabloids audience, as it offered a new way… [+1628 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "T’s Favorite Nourishing Recipes for a More Healthful 2020", "description": "A roundup of vibrant dishes for the new year, from a vegetable-packed green soup to a comforting persimmon porridge.", "url": "https://www.nytimes.com/2020/01/07/t-magazine/clean-eating-recipes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/t-magazine/07tmag-recipepromo/07tmag-recipepromo-facebookJumbo.jpg", "publishedAt": "2020-01-07T20:58:51Z", "content": "The New York-based chef Camille Becerra works with fresh, seasonal, vibrantly hued ingredients golden kabocha squash, brilliant red barberries, purple ninja radishes but not in a manner that, as she puts it, feels excessively healthy. Becerra, who was born in… [+665 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael M. Grynbaum", "title": "Tucker Carlson Dissents as Right-Wing Media Weighs Trump’s Iran Strike", "description": "Cracks in the conservative commentariat as the White House struggles to form a clear narrative.", "url": "https://www.nytimes.com/2020/01/07/business/media/tucker-carlson-iran-trump-media.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/business/07IRANMEDIA-02/merlin_166793529_5e878431-1a85-4e7b-a6a1-6c59060a751f-facebookJumbo.jpg", "publishedAt": "2020-01-07T20:27:05Z", "content": "On Fox &amp; Friends the next morning, the co-host Brian Kilmeade said he was elated by the news, only to be scolded by Geraldo Rivera, who pointed to false intelligence peddled by the George W. Bush administration to justify the Iraq War. Dont for a minute s… [+1898 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Frank Bruni", "title": "Trump and This Moment Are a Terrifying Mismatch", "description": "He lacks the counsel, character and credibility to lead us into war.", "url": "https://www.nytimes.com/2020/01/07/opinion/trump-iran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/opinion/07bruniWeb/07bruniWeb-facebookJumbo.jpg", "publishedAt": "2020-01-07T20:25:29Z", "content": "Limited cognition? Dubious character? Those may not matter when youre choosing the gilt for a golf resort or skyscraper. They do when youre deciding whether to put American lives on the line.\r\nTrump is on his fourth national security adviser, Robert OBrien, w… [+1369 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neal K. Katyal and George T. Conway III", "title": "Why Is Mitch McConnell So Afraid of John Bolton?", "description": "The Senate must hear his testimony in an impeachment trial.", "url": "https://www.nytimes.com/2020/01/07/opinion/john-bolton-testify.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/opinion/07kaytal-conway/07kaytal-conway-facebookJumbo.jpg", "publishedAt": "2020-01-07T20:17:10Z", "content": "Marco Rubio deserves particular opprobrium. He has said Mr. Bolton cannot testify, reasoning that the Senate inquiry should be based on the testimony heard by the House. We are acting on articles of impeachment, he declared. We should be constrained by the in… [+1806 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Julia Jacobs", "title": "Greatest of All Time on ‘Jeopardy!’? This Should Settle It", "description": "Brad Rutter has the most money. Ken Jennings has the longest streak. James Holzhauer won the most in one game. For this tournament, the slate has been wiped clean.", "url": "https://www.nytimes.com/2020/01/07/arts/television/jeopardy-greatest.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/arts/07jeopardy1/07jeopardy1-facebookJumbo.jpg", "publishedAt": "2020-01-07T20:12:56Z", "content": "Twenty years ago, Brad Rutter left the Jeopardy! studio having won more than $55,000 and two Chevy Camaros. Rutter hadnt lost a match, but at that time in the game shows history, contestants were kicked off after winning five straight games.\r\nSo Rutter went b… [+1062 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Thorin Klosowski", "title": "Why You Should Take a Close Look at What Tracks You", "description": "It might help you manage your privacy.", "url": "https://www.nytimes.com/2020/01/07/opinion/location-tracking-privacy.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/opinion/07privacyWeb/07privacyWeb-facebookJumbo.jpg", "publishedAt": "2020-01-07T20:00:05Z", "content": "After we read these types of stories, we might take a step back and nod thoughtfully about how bad it all seems. Maybe we install an ad blocker. Many people shrug it off as an inevitability of modern life. The tools that monitor ad trackers are growing increa… [+2134 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Derrick Bryson Taylor", "title": "Two Milwaukee Children Shot After Throwing Snowballs at Cars, Police Say - The New York Times", "description": "Two Milwaukee Children Shot After Throwing Snowballs at Cars, Police Say The New York Times Two Children Shot After Milwaukee Driver Opens Fire On Group Throwing Snowballs At Cars | TIME TIME 2 Children Shot By Driver After Throwing Snowballs At Passing Cars …", "url": "https://www.nytimes.com/2020/01/07/us/milwaukee-snowball-shooting.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/multimedia/07xp-snowballSUB/07xp-snowballSUB-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:53:00Z", "content": "The investigation is active, Sergeant Grant said, adding that the department is still seeking an unknown suspect. She did not respond to further questions.\r\nRepresentative Gwen Moore, a Democrat who represents Wisconsins Fourth District, said in a statement s… [+598 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "John Bolton’s Offer to Testify", "description": "Readers discuss whether the former national security adviser might defend the president. Also: Iranian cultural sites; war fears among the young; online hate; legal help for tenants.", "url": "https://www.nytimes.com/2020/01/07/opinion/letters/bolton-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/us/07dc-impeach-print/merlin_154196247_fe508ae5-a08f-49cb-95a2-918b15a17a20-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:52:14Z", "content": "To the Editor:\r\nRe Eviction Crises That a Few Hundred Dollars Could Solve (Business, Dec. 18):\r\nWhile the holiday season brought tidings of joy for some, many people go through the cold winter months facing eviction and homelessness. Many are renters who are … [+1081 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Deborah Solomon", "title": "John Baldessari: An Artist in a Class by Himself", "description": "His visual style derives from a corner of life that we never even knew had a style — that is, the classroom.", "url": "https://www.nytimes.com/2020/01/07/arts/design/john-baldessari-art.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/arts/07baldessari-appreciation1/07baldessari-appreciation1-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:49:53Z", "content": "Unlike Duchamp, whose work can be difficult and arcane, Baldessari is a conceptualist with a common touch. Or rather a common non-touch. His work is accessible, unpretentious and occasionally glib, and it has proved irritating to some of his more theoreticall… [+1379 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jack Nicas", "title": "F.B.I. Asks Apple to Help Unlock Two iPhones", "description": "The request could reignite a fight between the Silicon Valley giant and law enforcement over access to encrypted technology.", "url": "https://www.nytimes.com/2020/01/07/technology/apple-fbi-iphone-encryption.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-07T19:48:39Z", "content": "The official said the F.B.I. is not asking Apple to create a so-called backdoor or technological solution to get past its encryption that must be shared with the government. Instead, the government is seeking the data that is on the two phones, the official s… [+1824 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Fandos", "title": "McConnell Says He Will Proceed on Impeachment Trial Without Witness Deal", "description": "The Senate majority leader said he had the votes to begin President Trump’s trial without committing to calling witnesses or admitting new evidence, over Democrats’ objections.", "url": "https://www.nytimes.com/2020/01/07/us/politics/impeachment-trial-witnesses.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/us/politics/07dc-impeach1/07dc-impeach1-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:40:58Z", "content": "Mr. McConnells plan mirrors the procedures used during the impeachment trial of President Bill Clinton in 1999, the Senates only modern precedent. But unlike then, when all 100 senators agreed to adopt them and begin a trial without resolving the question of … [+768 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ana Vanessa Herrero and Julie Turkewitz", "title": "Scuffles, Tear Gas and Doused Lights: Venezuela’s National Assembly Opens for Business", "description": "Opposition lawmakers had to push aside security forces to gain entry to the chamber. Then it really got tense.", "url": "https://www.nytimes.com/2020/01/07/world/americas/venezuela-national-assembly-juan-guaido.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/world/07venezuela-sub/07venezuela-sub-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:30:53Z", "content": "The confrontation on Tuesday followed a weekend in which Venezuelas opposition accused forces loyal to the countrys authoritarian president, Nicolás Maduro, of staging a takeover of the assembly in a bid to consolidate Mr. Maduros grip on the country.\r\nOn Sun… [+982 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Tiny Love Stories: ‘Our Best Selves, Even If It’s Too Late’", "description": "Modern Love in miniature, featuring reader-submitted stories of no more than 100 words.", "url": "https://www.nytimes.com/2020/01/07/style/tiny-modern-love-stories-our-best-selves-even-if-its-too-late.html", "urlToImage": "https://static01.nyt.com/images/2020/01/01/arts/01ML-TINYLOVE-ILLO2/01ML-TINYLOVE-ILLO2-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:00:08Z", "content": "Your sister is in the hospital, my mother said over the phone. You need to come home. I had no idea that Jenny, a 44-year-old suburban mother, would be dead from prescription opioids just six days later. Although blindsided by her fatal addiction, I was grate… [+293 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Eddie S. Glaude Jr.", "title": "When White Supremacists Overthrew an Elected Government", "description": "David Zucchino’s “Wilmington’s Lie” tells the forgotten history of a coup against a multiracial government in North Carolina.", "url": "https://www.nytimes.com/2020/01/07/books/review/wilmingtons-lie-david-zucchino.html", "urlToImage": "https://static01.nyt.com/images/2020/01/26/books/review/26glaude/26glaude-facebookJumbo.jpg", "publishedAt": "2020-01-07T19:00:03Z", "content": "WILMINGTONS LIEThe Murderous Coup of 1898 and the Rise of White SupremacyBy David Zucchino\r\nToday we Americans find ourselves struggling with the ghosts of our past. Some among us reach for histories that affirm the established view of who we are as a nation.… [+2282 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Glenn Kenny", "title": "‘System K’ Review: Art in the Streets of Desperation", "description": "The poverty and chaos of Kinshasa drive an art scene that’s vivid, unrelenting and genuinely dangerous.", "url": "https://www.nytimes.com/2020/01/07/movies/system-k-review.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/arts/systemk1/systemk1-facebookJumbo.jpg", "publishedAt": "2020-01-07T18:47:20Z", "content": "I know I may end up being sick eventually, says Géraldine Tobe, who, like many of the artists in this film, works with melted plastic and other materials that are potentially toxic. At the movies end, one artist, who is rolled through the streets in a tub ful… [+397 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Concepción de León", "title": "Romance Writers of America Cancels Awards Program", "description": "The organization, criticized for its handling of a racism accusation, said it wouldn’t hold its annual contest after entrants and judges pulled out.", "url": "https://www.nytimes.com/2020/01/07/books/romance-writers-cancel-ritas.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/books/07ritas1/07ritas1-facebookJumbo.jpg", "publishedAt": "2020-01-07T18:45:17Z", "content": "The R.W.A.s punishment was widely criticized on social media and by other writers, and the organization quickly reversed course on its decision. Still, eight board members resigned in protest, as did the former president Carolyn Jewel, and a petition calling … [+1232 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kevin Roose", "title": "Don’t Tilt Scales Against Trump, Facebook Executive Warns", "description": "In an internal memo, Andrew Bosworth said he “desperately” wanted the president to lose. But, he said, the company should avoid hurting Mr. Trump’s campaign.", "url": "https://www.nytimes.com/2020/01/07/technology/facebook-trump-2020.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/business/07boz/07boz-facebookJumbo.jpg", "publishedAt": "2020-01-07T18:45:08Z", "content": "A Facebook spokeswoman provided a statement from Mr. Bosworth in which he said that the post wasnt written for public consumption, but that he hoped this post would encourage my coworkers to continue to accept criticism with grace as we accept the responsibil… [+2157 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Lord of the Rings, 2020 and Stuffed Oreos: Read the Andrew Bosworth Memo", "description": "Mr. Bosworth, a Facebook executive, weighed in on the platform’s role in political polarization.", "url": "https://www.nytimes.com/2020/01/07/technology/facebook-andrew-bosworth-memo.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/business/07bozmemo/07bozmemo-facebookJumbo.jpg", "publishedAt": "2020-01-07T18:40:11Z", "content": "On Dec. 30, Andrew Bosworth, a longtime Facebook executive and confidant of Mark Zuckerberg, wrote a long memo on the companys internal network. In the post, titled Thoughts for 2020, Mr. Bosworth who oversaw Facebooks advertising efforts during the 2016 elec… [+15378 chars]"}]}