{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Singapore's Puma Energy to Sell Fuels Business to Chevron Australia for $288 Million - The New York Times", "description": "Singapore's Puma Energy, the retail and midstream arm of global commodities trader Trafigura, said on Thursday it would sell its Australian commercial and retail fuels business to Chevron Australia for A$425 million (£219.7 million).", "url": "https://www.nytimes.com/reuters/2019/12/30/business/30reuters-puma-energy-fuels-business-chevron.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-30T08:18:00Z", "content": "(Reuters) - Singapore's Puma Energy, the retail and midstream arm of global commodities trader Trafigura, said on Thursday it would sell its Australian commercial and retail fuels business to Chevron Australia for A$425 million (£219.7 million).\r\nPuma Energy … [+432 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Bryant Rousseau", "title": "In 2019, We Were There: 12 Favorite Dispatches From the Earth’s 4 Corners", "description": "This year, we delivered 125 dispatches from 44 countries and six continents, each one offering an immersive experience of one of the world’s most noteworthy places. Here are the highlights.", "url": "https://www.nytimes.com/2019/12/30/world/nyt-best-dispatches.html", "urlToImage": "https://static01.nyt.com/images/2019/12/07/world/07bari-dispatch3/merlin_165512487_6b450054-7f8a-4c01-9b89-1e708bfd757b-facebookJumbo.jpg", "publishedAt": "2019-12-30T08:00:14Z", "content": "Being there makes all the difference. When our correspondents are on the ground or underground or on the ice or at sea they, and you, can get up close to the story, sometimes uncomfortably so, uncovering essential details that no phone interview could ever ca… [+918 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ben Dooley and Hisako Ueno", "title": "A 7-Eleven in Japan Might Close for a Day. Yes, That’s a Big Deal.", "description": "In a dispute captivating a country of workaholics, Mitoshi Matsumoto says the company is threatening to rescind his franchise after he complained about draconian work hours.", "url": "https://www.nytimes.com/2019/12/30/business/7-eleven-japan-work.html", "urlToImage": "https://static01.nyt.com/images/2019/12/28/business/00SevenElevenJapan-1/00SevenElevenJapan-1-facebookJumbo.jpg", "publishedAt": "2019-12-30T08:00:10Z", "content": "Hungry for growth, 7-Eleven and its competitors began a war of attrition, flooding the country with more locations in an attempt to steal market share. Each new shop cut into its neighbors profits. \r\nAt the same time, Japans labor pool was shrinking, driving … [+1195 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jeremy W. Peters and Sydney Ember", "title": "The Stock Market Is Booming, but Democrats Say, Look Who’s Been Left Out", "description": "In Iowa, Democratic candidates sought to undercut Trump’s core message of a strong economy by making the case that it isn’t working for the right people.", "url": "https://www.nytimes.com/2019/12/30/us/politics/stock-market-democrats.html", "urlToImage": "https://static01.nyt.com/images/2019/12/29/us/politics/29dems1/29dems1-facebookJumbo.jpg", "publishedAt": "2019-12-30T08:00:09Z", "content": "The economic arguments are resonating, in Iowa and elsewhere, with voters like Max Goldman, a 53-year-old technology consultant from Kansas City, Iowa. Mr. Goldman, who traveled to Ms. Warrens event in Clarinda, said he wished Democrats talked more about the … [+1721 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Karen Crouse", "title": "Gracie Gold Embraces a Rugged Comeback Path", "description": "To rebuild her figure skating career after a reckoning with mental health struggles, the Olympian has focused on redefining what success means.", "url": "https://www.nytimes.com/2019/12/30/sports/figure-skating-gracie-gold.html", "urlToImage": "https://static01.nyt.com/images/2019/12/30/sports/00gracie-lookback-print/00gracie-lookback01-facebookJumbo.jpg", "publishedAt": "2019-12-30T08:00:09Z", "content": "Gold looks back on this last year as a gritty figure eight. Her forward progression includes losing the bulk of the extra 40 pounds that she had added to her 5-foot-5 frame and graduating from the jumping harness system that she needed at one point to help he… [+1023 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alan Blinder and Billy Witz", "title": "L.S.U. and Clemson Reached the Championship on Opposite Tracks", "description": "L.S.U. had college football’s best offense this season. Clemson, the defending national champion, had the best defense. They’ll settle which one matters more in a title showdown on Jan. 13.", "url": "https://www.nytimes.com/2019/12/30/sports/ncaafootball/lsu-clemson-football-playoff.html", "urlToImage": "https://static01.nyt.com/images/2019/12/30/sports/30cfp-folo/merlin_166431543_17413e6a-0952-4b45-8d03-570c524094b2-facebookJumbo.jpg", "publishedAt": "2019-12-30T08:00:08Z", "content": "Two games stand out: On Sept. 28, the Clemson defense stuffed a 2-point conversion to preserve a 21-20 win at North Carolina, and on Saturday night Ohio State ventured into the red zone five times and left with one touchdown, three field goals and the interce… [+1513 chars]"}]}