{"status": "ok", "totalResults": 43, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alejandra Rosa and Patricia Mazzei", "title": "Earthquake Strikes Puerto Rico, Toppling a Well-Known Natural Wonder", "description": "A 5.8-magnitude quake damaged some homes and destroyed an unusual natural rock formation known as Punta Ventana.", "url": "https://www.nytimes.com/2020/01/06/us/puerto-rico-earthquake.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/us/06earthquake-01sub/06earthquake-01sub-facebookJumbo.jpg", "publishedAt": "2020-01-06T18:17:44Z", "content": "In Guayanilla, emergency workers helped a couple and two children whose elevated house collapsed, burying three cars that had been parked underneath. The man who lived inside, identified only by his first name, Alan, described to NotiCentro the harrowing mome… [+1212 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Florence Fabricant", "title": "A Food Historian Discusses Italy’s Motor Valley", "description": "Francine Segan will talk about Modena and its environs at the 92nd Street Y.", "url": "https://www.nytimes.com/2020/01/06/dining/modena-auto-food-talk.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/dining/06burner7/06burner7-facebookJumbo.jpg", "publishedAt": "2020-01-06T18:16:00Z", "content": "Modena, and its surroundings in north-central Italy, are known as the home of balsamic vinegar and Massimo Botturas highly esteemed Osteria Francescana. But in some circles, the region is famous as Motor Valley, where high-end cars, like Ferrari, Lamborghini,… [+569 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Eric Asimov", "title": "Wine Business Fears a Possible Disaster in Potential Trump Tariffs", "description": "A move meant to impose pain on the European Union may jeopardize many American jobs and businesses, while putting popular wines out of reach.", "url": "https://www.nytimes.com/2020/01/06/dining/drinks/trump-wine-tariff-eu.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/dining/07pour1/07pour1-facebookJumbo.jpg", "publishedAt": "2020-01-06T18:11:41Z", "content": "The potential tariffs may be damaging as well to small producers in Europe whose businesses are focused on the American market. Luxury-goods corporations, with wine divisions and big wine companies, have the resources to adapt and find other markets. But tiny… [+1332 chars]"}]}