{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jason Farago", "title": "Cecilia Alemani Named Curator of Next Venice Biennale", "description": "The curator of the High Line will be the first Italian woman to organize the show.", "url": "https://www.nytimes.com/2020/01/10/arts/design/venice-biennale-cecilia-alemani.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/arts/10venice-item/10venice-item-facebookJumbo.jpg", "publishedAt": "2020-01-10T17:19:35Z", "content": "The Venice Biennale, the worlds longest-running large-scale survey of contemporary art, looked locally and internationally to find a curator for its next edition and selected a leader who personifies both. She is Cecilia Alemani, the curator of New Yorks High… [+1641 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Fandos", "title": "Pelosi Alerts House to Be Ready to Send Impeachment Articles Next Week", "description": "In a letter to lawmakers, Ms. Pelosi appeared to be moving to end an impasse but did not offer a more specific timeline.", "url": "https://www.nytimes.com/2020/01/10/us/politics/trump-impeachment-pelosi.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/us/politics/10dc-impeach/10dc-impeach-facebookJumbo.jpg", "publishedAt": "2020-01-10T17:04:31Z", "content": "WASHINGTON Speaker Nancy Pelosi alerted lawmakers on Friday that she would move next week to transmit to the Senate articles of impeachment against President Trump.\r\nIn a letter to colleagues Friday morning, the speaker appeared to be moving to end a weekslon… [+746 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elaina Plott", "title": "He Was Cruising in a G.O.P. Primary. Then Trump Endorsed an Ex-Democrat.", "description": "David Richter had been the front-runner in his House primary in New Jersey. That changed when the Democratic incumbent announced he was becoming a Republican, with the president’s support.", "url": "https://www.nytimes.com/2020/01/10/us/politics/david-richter-jeff-van-drew-trump-nj.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/us/politics/10richter-promo/10richter-promo-facebookJumbo.jpg", "publishedAt": "2020-01-10T16:56:46Z", "content": "Of course there will be those who simply follow the presidents lead, he noted. But I think most people probably have a wait-and-see attitude, which is, Well, hes got to prove to me that hes really Republican now, and this just wasnt done opportunistically, wh… [+1456 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mekado Murphy", "title": "How ‘Just Mercy’ Gets Close to Its Characters", "description": "The director Destin Daniel Cretton narrates a scene from his drama featuring Jamie Foxx as a man on death row who asserts his innocence.", "url": "https://www.nytimes.com/2020/01/10/movies/just-mercy-clip.html", "urlToImage": "https://static01.nyt.com/images/2020/01/09/arts/justmercy-anatomy1/justmercy-anatomy1-facebookJumbo.jpg", "publishedAt": "2020-01-10T16:02:47Z", "content": "Hi, my name is Destin Cretton. Im the director of Just Mercy. This is a scene between Walter McMillian. Played by Jamie Foxx, and Herbert Richardson, played by Rob Morgan. And they are in cells on death row in Alabama. They share a wall. Theyre directly next … [+2016 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Melissa Clark", "title": "A Roast Chicken With Even More Crispy Bits", "description": "You can rub your bird down with salt, or you can try Melissa Clark’s latest trick for an exterior that crackles like a potato chip.", "url": "https://www.nytimes.com/2020/01/10/dining/parmesan-roast-chicken-recipe.html", "urlToImage": "https://static01.nyt.com/images/2020/01/15/dining/10Appe1/merlin_166828719_ab2d8ab2-77ea-46c7-a29c-b9ebee55d8ab-facebookJumbo.jpg", "publishedAt": "2020-01-10T16:01:59Z", "content": "The meat of a roast chicken is all well and good, but its the skin that I really adore. Getting it as crisp and burnished as possible is my goal for every bird; if I can hear it crackle like a potato chip, I know Ive gotten close.\r\nStrategies for achieving th… [+593 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sharon Buccino", "title": "Trump’s Weakening of Environmental Rules Would Leave the Public in the Dark", "description": "His proposal would threaten scrutiny of big projects that could put communities and the environment at risk.", "url": "https://www.nytimes.com/2020/01/10/opinion/trump-environment.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/opinion/10Buccino/10Buccino-facebookJumbo.jpg", "publishedAt": "2020-01-10T16:00:06Z", "content": "The law lays out a process designed to expose a projects potential pitfalls in advance, identify common ground and open the door to innovative solutions that can benefit all parties. It also requires the federal government to consider alternatives and mitigat… [+2438 chars]"}]}