{"status": "ok", "totalResults": 21, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Livia Albeck-Ripka", "title": "2 Firefighters Die in Australia Fires and Scott Morrison Ends Vacation", "description": "Facing harsh criticism for his absence, the prime minister said he would return from a Hawaii trip following the deaths of two volunteer firefighters.", "url": "https://www.nytimes.com/2019/12/19/world/australia/fires-firefighters-killed-scott-morrison.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/world/20oz-fires-2/20oz-fires-2-facebookJumbo.jpg", "publishedAt": "2019-12-20T03:58:50Z", "content": "In a statement released on Friday, Mr. Morrison said that given the most recent tragic events he would be returning to Sydney as soon as possible and deeply regretted the offense caused to any of the many Australians affected by the terrible bushfires by my t… [+653 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Damien Cave", "title": "What to Eat and Drink This Australian Summer", "description": "It’s the holiday season and we’re hot and hungry. A roundup of our favorite food, wine and restaurants of late.", "url": "https://www.nytimes.com/2019/12/19/world/australia/food-wine-whiskey.html", "urlToImage": "https://static01.nyt.com/images/2019/10/29/dining/20australialetter138-3/29fare-winebars01-facebookJumbo.jpg", "publishedAt": "2019-12-20T03:58:08Z", "content": "Many of Australias small whisky distilleries are now turning heads around the world, for a reason worth noting: theyre not copying what others are doing, but forging ahead with something new.\r\nThe existing cohort, bourbon and Scotch, didnt appeal to us, said … [+1683 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Glueck and Alexander Burns", "title": "After Rebuking Trump, Democratic Candidates Attack One Another", "description": "In a smaller debate field, the tension between Elizabeth Warren and Pete Buttigieg, building for weeks, broke into the open.", "url": "https://www.nytimes.com/2019/12/19/us/politics/debate-recap.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19debate-ledeall-new1/19debate-ledeall-new1-facebookJumbo.jpg", "publishedAt": "2019-12-20T03:20:19Z", "content": "I very much agree with Senator Warren on raising more tax revenue from millionaires and billionaires, Mr. Buttigieg said. I just dont agree on the part about spending it on millionaires and billionaires when it comes to their college tuition.\r\nMs. Warren, who… [+2513 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nick Corasaniti", "title": "Buttigieg and Warren Clash Over ‘Wine Cave’ Fund-Raiser", "description": "Pete Buttigieg and Elizabeth Warren have assailed each other over transparency issues in the last weeks. Their sparring intensified at the debate on Thursday.", "url": "https://www.nytimes.com/2019/12/19/us/politics/wine-cave.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19live-briefing-warren2/merlin_166203822_965d78fd-98df-4205-900e-e61d73587959-facebookJumbo.jpg", "publishedAt": "2019-12-20T02:58:22Z", "content": "WARREN: I do not sell access to my time. I dont do call time with millionaires and billionaires.\r\nBUTTIGIEG: As of when, Senator?\r\nWARREN: I dont meet behind closed doors with big-dollar donors. Look, I have taken one that ought to be an easy step for anyone … [+2260 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "Live Debate Stream: Full Analysis - The New York Times", "description": "Watch the live stream of tonight’s Democratic presidential debate and follow along with our reporters in real time.", "url": "https://www.nytimes.com/interactive/2019/12/19/us/politics/debate-live-analysis.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/multimedia/19debate-livechat-promo13/19debate-livechat-promo13-facebookJumbo.jpg", "publishedAt": "2019-12-20T02:30:09Z", "content": "To Matts point, reporters have asked Warren over and over this year to respond to her rivals. She has been extraordinarily disciplined at not taking the bait (and the few times she has offered sharp criticism, like when she suggested Biden was running in the … [+82 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "Fact-Checking the December Democratic Debate - The New York Times", "description": "Fact-Checking the December Democratic Debate The New York Times December Democratic Debate: A Smaller, Whiter Stage The New York Times Everyone failed the Democratic debate's last question Washington Examiner Democrats should raise the debate a notch The Wash…", "url": "https://www.nytimes.com/2019/12/19/us/politics/fact-check-december-debate.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19dc-debate-factcheck/19dc-debate-factcheck-facebookJumbo.jpg", "publishedAt": "2019-12-20T02:16:00Z", "content": "Mr. Rendell said that Ms. Warren sent him a glowing thank-you letter.\r\nWhat the facts are\r\nWhat Mr. Biden said: \r\nI got in a big fight for a long time with the Pentagon because I strongly opposed the nation-building notion we set about. Rebuilding that countr… [+2629 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Peter Baker, Maggie Haberman, Jeremy W. Peters and Elaina Plott", "title": "On the Day After, an Angry Trump Looks to Vindication in November", "description": "Stung by impeachment, President Trump, barring the unforeseen, will be the first American president to face voters after being charged with high crimes and misdemeanors.", "url": "https://www.nytimes.com/2019/12/19/us/politics/trump-reacts-to-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19dc-trump/19dc-trump-facebookJumbo.jpg", "publishedAt": "2019-12-20T02:12:05Z", "content": "For that matter, President Richard M. Nixon was also in his second term when he resigned after the approval of articles of impeachment by the House Judiciary Committee in 1974. His vice president and successor, Gerald R. Ford, ended up losing in 1976.\r\nMr. Tr… [+1702 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mariel Padilla", "title": "C.D.C. Links Deadly Listeria Outbreak to Hard-Boiled Egg Plant in Georgia", "description": "Seven people in five states have been infected with the listeria strain, resulting in several hospitalizations and one death.", "url": "https://www.nytimes.com/2019/12/19/us/listeria-eggs.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/multimedia/19xp-listeria2/merlin_137343066_97e6441a-af52-47e9-b171-31c4d32a5881-facebookJumbo.jpg", "publishedAt": "2019-12-20T02:05:27Z", "content": "The regulatory agency collected 105 swab samples from the plant, Almark Foods said. Two of the swabs tested positive for listeria, prompting the agency to issue a warning letter to Almark on July 22, according to the F.D.A. The listeria contamination was foun… [+1052 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Astor", "title": "Watch Andrew Yang Talk About Racial Representation at Democratic Debate - The New York Times", "description": "Watch Andrew Yang Talk About Racial Representation at Democratic Debate The New York Times Andrew Yang: Disappointing to be only candidate of color on stage CNN At Democratic debate, Andrew Yang makes a good case for a basic income Vox.com Andrew Yang doesn't…", "url": "https://www.nytimes.com/2019/12/19/us/politics/andrew-yang-democratic-debate.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19live-briefing-yang2/19live-briefing-yang2-facebookJumbo.jpg", "publishedAt": "2019-12-20T02:03:00Z", "content": "SANDERS: I can, because people of color, in fact, are going to be the people suffering most if we do not deal with climate change. And by the way, we have an obligation up here, if there are not any of our African-American brothers and sisters up here, to spe… [+2154 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "John Branch", "title": "Kelly Slater Misses Olympic Surfing Berth as John John Florence Qualifies", "description": "Slater’s loss in the semifinals of the Billabong Pipe Masters gave the last spot on the American men’s team to Florence, who has been Slater’s longtime protégé, rival and neighbor.", "url": "https://www.nytimes.com/2019/12/19/sports/kelly-slater-john-john-florence-olympics.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/sports/19pipeline/merlin_166197120_e754473c-9746-4119-bf0d-b703dd42da64-facebookJumbo.jpg", "publishedAt": "2019-12-20T01:57:20Z", "content": "After the loss, he was asked about his plans to compete in 2020. He will be 48 in February.\r\nI might have to do one more lap, he said with a laugh. Well see. I dont know.\r\nThe womens Olympics spots were determined earlier this month in the season-ending event… [+1017 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "IMF Board Approves Financing Package to Pave Way for Somalia Debt Relief", "description": "The International Monetary Fund's executive board has approved a financing plan that will help the IMF cover its share of debt relief for Somalia, IMF Managing Director Kristalina Georgieva said in a statement on Wednesday.", "url": "https://www.nytimes.com/reuters/2019/12/18/business/18reuters-imf-somalia.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-20T01:56:56Z", "content": "The African nation has about $5 billion in external debt, accounting for about 100% of its GDP, which the Fund has declared to be unsustainable.\r\nSomali's finance minister, Abdirahman Duale Beileh, welcomed the news in a posting on Twitter, adding, \"We are gr… [+665 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "The Legal Threat to Obamacare Is Back. Again.", "description": "An appeals court, after rejecting the law’s insurance requirement, entertains the idea that the whole law should now fall.", "url": "https://www.nytimes.com/2019/12/19/opinion/editorials/obamacare-court-unconstitutional.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/opinion/19aca/19aca-facebookJumbo-v4.jpg", "publishedAt": "2019-12-20T01:40:20Z", "content": "But the 2017 Congress, for all its anti-Obamacare animus, left all of the laws operative provisions intact. It even left the mandate in place, Judge King noted, even though it could no longer have any effect.\r\nThis insight, that the coverage requirement now d… [+1021 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Elizabeth Dias", "title": "Christianity Today Calls for Trump’s Removal", "description": "The evangelical magazine published an editorial saying that the president had abused his power and violated the Constitution.", "url": "https://www.nytimes.com/2019/12/19/us/christianity-today-trump.html", "urlToImage": "https://static01.nyt.com/images/2020/01/18/us/18evangelical/merlin_162600882_406e6d54-9551-4f8b-8ccb-6f3d3f145f59-facebookJumbo.jpg", "publishedAt": "2019-12-20T01:17:33Z", "content": "Christianity Today, a prominent evangelical magazine, called for President Trump to be removed from office in an editorial on Thursday, a day after Mr. Trump was impeached by the House of Representatives. \r\nThe editorial was a surprising move for a publicatio… [+762 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The Editorial Board", "title": "President Trump Deserves a Real Trial", "description": "Mitch McConnell’s plan to rush to an acquittal is an affront to the Constitution and a disservice to the nation.", "url": "https://www.nytimes.com/2019/12/19/opinion/donald-trump-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/opinion/19trial1/19trial1-facebookJumbo.jpg", "publishedAt": "2019-12-20T01:07:46Z", "content": "This time, Mr. McConnell is disinclined to have any witnesses testify at all. His goal is to keep the trial as perfunctory as possible, based on the presidents and the Republicans insistence that the process has been illegitimate and should be dispatched as q… [+2595 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Weiyi Cai, Jasmine C. Lee, Charlie Smart", "title": "Which Candidates Got the Most Speaking Time in the Democratic Debate - The New York Times", "description": "Which Candidates Got the Most Speaking Time in the Democratic Debate The New York Times The Democratic debate is time to look at Amy Klobuchar again Vox.com Klobuchar releases $1 trillion housing, poverty reduction plan | TheHill The Hill Amy Klobuchar is wro…", "url": "https://www.nytimes.com/interactive/2019/12/19/us/elections/debate-speaking-time.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/debate-speaking-time-promo-1576793481797/debate-speaking-time-promo-1576793481797-facebookJumbo.jpg", "publishedAt": "2019-12-20T00:52:00Z", "content": "Note: Each bar segment represents the length of a candidates response to a question.\r\nSenator Bernie Sanders of Vermont and Senator Amy Klobuchar of Minnesota got the most speaking time in the sixth Democratic presidential debate.\r\nThe candidates sparred on p… [+387 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Katie Benner", "title": "Durham Is Scrutinizing Ex-C.I.A. Director’s Role in Russian Interference Findings", "description": "The federal prosecutor investigating the origins of the Russia inquiry is examining testimony by the former C.I.A. director John Brennan and seeking his communications records.", "url": "https://www.nytimes.com/2019/12/19/us/politics/durham-john-brennan-cia.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19dc-Durham-1/merlin_163597278_30cedbe4-30b2-4ab1-aaa1-f7d99505c76e-facebookJumbo.jpg", "publishedAt": "2019-12-20T00:23:27Z", "content": "Mr. Brennan has repeatedly said, including in his 2017 congressional testimony, that the C.I.A. did not rely on the dossier when it helped develop the assessment, and the former director of national intelligence, James Clapper, has also testified before lawma… [+2105 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Catie Edmondson and Maggie Haberman", "title": "Pledging 'Undying Support' for Trump, Jeff Van Drew Becomes a Republican", "description": "The day after voting against impeaching President Trump, the New Jersey representative appeared with him in the Oval Office to announce he would leave the Democratic Party for the Republicans.", "url": "https://www.nytimes.com/2019/12/19/us/politics/jeff-van-drew-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19dc-vandrew/19dc-vandrew-facebookJumbo.jpg", "publishedAt": "2019-12-20T00:22:18Z", "content": "Just how much Mr. Trumps backing will help Mr. Van Drew, a former dentist and state legislator, remains to be seen. Several Republican candidates already planning on running for the districts Republican nomination have warily eyed Mr. Van Drews defection whil… [+2190 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Paul Krugman", "title": "Democrats May Save Us Yet", "description": "America’s defenders of democracy take a stand.", "url": "https://www.nytimes.com/2019/12/19/opinion/impeachment-democrats-trump.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/opinion/19krugmanWeb/19krugmanWeb-facebookJumbo.jpg", "publishedAt": "2019-12-20T00:20:25Z", "content": "One of the depressing aspects of the rise of authoritarian parties like Hungarys Fidesz and Polands Law and Justice has been the fecklessness of their opposition disunited, disorganized, unable to make an effective challenge even to unpopular autocrats as the… [+2707 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Tara Siegel Bernard", "title": "Senate Opens Door to New Options in Your 401(k)", "description": "A series of changes tucked into the $1.4 trillion spending deal passed Thursday could affect savers including retirees and recent graduates.", "url": "https://www.nytimes.com/2019/12/19/business/ira-401k-changes.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-20T00:18:06Z", "content": "Perhaps the most significant change was the easing of rules regarding retirement plans and annuities, which, in their simplest form, enable workers to convert their savings into a guaranteed income stream.\r\nMany employers have long been reluctant to include a… [+1376 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ian Austen", "title": "Husband in Taliban Hostage Couple Acquitted of Assaulting Wife", "description": "Saying neither Joshua Boyle nor Caitlin Coleman, who were held captive for five years in Afghanistan, were credible, a judge dismissed all charges.", "url": "https://www.nytimes.com/2019/12/19/world/americas/joshua-boyle-caitlin-coleman-taliban.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/world/19canada-boyle/19canada-boyle-facebookJumbo.jpg", "publishedAt": "2019-12-20T00:12:00Z", "content": "Mr. Boyle denied the charges, saying they never happened.\r\nMs. Coleman described a series of assaults, some of which she said had been punishments for not following Mr. Boyles orders once they were back in Canada. \r\nMr. Boyle and Ms. Coleman both testified th… [+1402 chars]"}]}