{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Noah Weiland", "title": "Your Impeachment Questions, Answered - The New York Times", "description": "Your Impeachment Questions, Answered The New York Times Alan Dershowitz, Rep. Louie Gohmert on Nancy Pelosi's failed attempt to control Senate impeachment t Fox News Pelosi: House will move to transmit impeachment articles next week Fox News Pelosi caves on a…", "url": "https://www.nytimes.com/2020/01/10/us/politics/impeachment-questions-answers.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-11T00:20:00Z", "content": "As for barring Mr. McConnell, the short answer is no. The thing to remember is that Chief Justice Roberts is the presiding officer in the same way that a vice president is, and a vice president cant tell the Senate what a senator should do. The Senate itself … [+2145 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Bret Stephens", "title": "Of Course Bernie Can Win", "description": "To say Sanders is unelectable is indefensible.", "url": "https://www.nytimes.com/2020/01/10/opinion/bernie-sanders-2020.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/opinion/10stephensWeb/10stephensWeb-facebookJumbo.jpg", "publishedAt": "2020-01-11T00:11:51Z", "content": "So it is, and would be, with Sanders. Depth of conviction? Check. Contempt for conventional norms? Check. Opposed by all the right people? Check. Running against a crooked opponent? Check.Commitment to drastic change? Check. Like Trump, too, he isnt so much c… [+2310 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Andrea Salcedo", "title": "She Was 92 and Loved Cats. An Attack Left Her Dead on the Street. - The New York Times", "description": "She Was 92 and Loved Cats. An Attack Left Her Dead on the Street. The New York Times Suspect In Custody In Killing Of 92-Year-Old Maria Fuertes In Queens CBS New York 92-Year-Old Choked, Left to Die on NYC Sidewalk | News 4 Now NBC New York Queens man arreste…", "url": "https://www.nytimes.com/2020/01/10/nyregion/92-year-old-woman-queens-murder.html", "urlToImage": "https://static01.nyt.com/images/2020/01/11/nyregion/11catlady-print/10catlady-facebookJumbo.jpg", "publishedAt": "2020-01-11T00:06:00Z", "content": "Ms. Ram, who has lived in South Richmond Hill for nine years, said she would often advise Ms. Fuertes not to leave her house at night. \r\nShe said she had to go for the cats, Ms. Ram said. \r\nNeighbors said they took it upon themselves to help care for her. If … [+1144 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Wu Jieh-min", "title": "Taiwan’s Election is a Vote About China", "description": "The race for president is a proxy contest about national identity.", "url": "https://www.nytimes.com/2020/01/10/opinion/taiwans-election-is-a-vote-about-china.html", "urlToImage": "https://static01.nyt.com/images/2020/01/10/opinion/10wu/merlin_166873989_8aa4a80c-ecca-4135-be55-1b657099390d-facebookJumbo.jpg", "publishedAt": "2020-01-11T00:00:09Z", "content": "Some of the Chinese governments efforts became mired in red tape, were exposed as veiled indoctrination efforts or were hijacked by people in Taiwan who collaborated only out of opportunism. But also, Beijing itself has unwittingly forged a new brand of patri… [+2240 chars]"}]}