{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Genzlinger", "title": "Larry Heinemann, Novelist of the Vietnam War, Dies at 75", "description": "His “Paco’s Story” was the surprise winner of the National Book Award for fiction in 1987, beating books by Toni Morrison and Philip Roth.", "url": "https://www.nytimes.com/2019/12/17/books/larry-heinemann-dead.html", "urlToImage": "https://static01.nyt.com/images/2019/12/18/obituaries/17Heinemann1/17Heinemann1-facebookJumbo.jpg", "publishedAt": "2019-12-17T23:53:36Z", "content": "Larry Curtis Heinemann was born on Jan. 18, 1944, in Chicago. His father, John, owned a small bus company, and his mother, Dorothy (Denton) Heinemann, was a homemaker who also owned a babysitting business.\r\nMr. Heinemann received an associates degree at Kenda… [+1665 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Matthew B. Crawford", "title": "The case for working with your hands (2009)", "description": "Changes in the economy have had the surprising effect of making the manual trades more attractive as careers.", "url": "https://www.nytimes.com/2009/05/24/magazine/24labor-t.html", "urlToImage": "https://static01.nyt.com/images/2009/05/24/magazine/24labor-75.jpg", "publishedAt": "2019-12-17T23:47:13Z", "content": "A gifted young person who chooses to become a mechanic rather than to accumulate academic credentials is viewed as eccentric, if not self-destructive. There is a pervasive \r\nanxiety\r\n among parents that there is only one track to success for their children. I… [+25618 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Victoria Shannon and Hiroko Masuike", "title": "Trump Letter, F.B.I., Bitcoin: Your Tuesday Evening Briefing", "description": "Here’s what you need to know at the end of the day.", "url": "https://www.nytimes.com/2019/12/17/briefing/trump-letter-fbi-bitcoin.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/briefing/121719evening-briefing-promo/121719evening-briefing-promo-facebookJumbo.jpg", "publishedAt": "2019-12-17T23:36:21Z", "content": "4. A big step toward avoiding a government shutdown. \r\nThe House approved two spending packages allocating $1.4 trillion for the federal budget, designating priorities like raising the tobacco purchase age to 21.\r\nThe measures were designed to have enough goo… [+641 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Liam Stack", "title": "Brian Tarantina, ‘Marvelous Mrs. Maisel’ Actor, Died of Overdose, Medical Examiner Says", "description": "His publicist had blamed a “health crisis” for the actor’s death last month. On Tuesday, the authorities cited fentanyl, heroin, diazepam and cocaine.", "url": "https://www.nytimes.com/2019/12/17/us/brian-tarantina-death-overdose.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/multimedia/17xp-taratina/17xp-taratina-facebookJumbo.jpg", "publishedAt": "2019-12-17T23:27:27Z", "content": "The death of the Marvelous Mrs. Maisel actor Brian Tarantina last month was caused by an accidental drug overdose, the medical examiners office in New York said on Tuesday. \r\nMr. Tarantina, 60, was found in his apartment in Manhattan on Nov. 2. At the time, h… [+662 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Lisa Friedman", "title": "A Coal Baron Funded Climate Denial as His Company Spiraled Into Bankruptcy", "description": "Robert E. Murray, the former chairman of Murray Energy, gave nearly $1 million to climate denial groups and other organizations seeking to undo environmental regulations.", "url": "https://www.nytimes.com/2019/12/17/climate/murray-energy-climate-denial-coal.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/climate/17cli-coal01/17cli-coal01-facebookJumbo.jpg", "publishedAt": "2019-12-17T23:18:54Z", "content": "He and others noted that the bankruptcy filing was the first public disclosure of funding to Government Accountability &amp; Oversight, which has sought emails through the Freedom of Information Act from state attorneys generals who have sued the Trump admini… [+1493 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Spencer Bokat-Lindell", "title": "Fifty-One Percent of the Population, Zero Nominations", "description": "Once again, female directors were shut out of the Golden Globes. Two years after #MeToo caught fire, how much has Hollywood changed?", "url": "https://www.nytimes.com/2019/12/17/opinion/golden-globes-women.html", "urlToImage": "https://static01.nyt.com/images/2020/01/12/opinion/1217debatable/1217debatable-facebookJumbo.jpg", "publishedAt": "2019-12-17T22:55:03Z", "content": "Thats shocking because theres a ton of female directors who come through Sundance, the countrys pre-eminent independent film festival. Theres also the example of Anne Fletcher, whos directed more top-grossing films than any other woman. Shes never brought up … [+1849 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Abby Goodnough", "title": "A New Drug Scourge: Deaths Involving Meth Are Rising Fast", "description": "Today’s meth is far more potent than earlier versions, but because it isn’t an opioid, many federal addiction treatment funds can’t be used to fight it.", "url": "https://www.nytimes.com/2019/12/17/health/meth-deaths-opioids.html", "urlToImage": "https://static01.nyt.com/images/2019/12/04/science/00METH1/00METH1-facebookJumbo.jpg", "publishedAt": "2019-12-17T22:47:27Z", "content": "Provisional data from the C.D.C. shows there were about 13,000 deaths involving meth nationwide in 2018, more than twice as many as in 2015. That is still far fewer than opioid deaths overall, which passed 47,000, but the pace is accelerating while opioid fat… [+1948 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alisha Haridasani Gupta", "title": "California Companies Are Rushing to Find Female Board Members", "description": "A law mandating that every public company in the state should have a woman on the board by the end of the year has redefined the qualifications of a director.", "url": "https://www.nytimes.com/2019/12/17/us/california-boardroom-gender-quota.html", "urlToImage": "https://static01.nyt.com/images/2019/12/10/us/00IHWBOARDROOMQUOTA/00IHWBOARDROOMQUOTA-facebookJumbo.jpg", "publishedAt": "2019-12-17T22:20:58Z", "content": "In the U.S., women hold about 20 percent of board seats at companies listed in the Russell 3000 stock index, up from 17 percent in 2018, according to the nonprofit 2020 Women on Boards. Of the more than 600 companies based in California that are listed on a m… [+2135 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David McCabe, Kate Conger", "title": "Online Sex Trafficking Law Shows Difficulty of Reining In Big Tech - The New York Times", "description": "A change in a law to hold tech platforms accountable had almost universal support in Congress last year. Now, some are revisiting their decision.", "url": "https://www.nytimes.com/2019/12/17/technology/online-sex-trafficking-law-big-tech.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/business/17trafficking-sub/17trafficking-sub-facebookJumbo.jpg", "publishedAt": "2019-12-17T22:19:00Z", "content": "Senator Richard Blumenthal, a Democrat from Connecticut who sponsored the 2018 law, said in a statement that the sex trafficking carve-out was written to change tech industry practices, and that it had succeeded. \r\nAny website that closed down because of the … [+1027 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nick Corasaniti", "title": "Republicans Attack House Democrats on Impeachment, and Democrats Change the Subject", "description": "One party is running ads about what’s happening in Congress. The other is happy to stick to health care.", "url": "https://www.nytimes.com/2019/12/17/us/politics/impeachment-ads-Democrats-2020.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/us/politics/17impeachmentads1/17impeachmentads1-facebookJumbo.jpg", "publishedAt": "2019-12-17T22:02:45Z", "content": "For example, 18 different ads from the American Action Network, a Republican super PAC that has spent $5.4 million on TV ads so far, all begin with an appearance of Ms. Ocasio-Cortez on CNN where she warns of foreign interference in the 2020 election, and hop… [+1346 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ana Swanson", "title": "Trump’s Trade Deals Raise, Rather Than Remove, Economic Barriers", "description": "The president’s China and North American trade pacts reverse a trend of making markets more open that was decades in the making.", "url": "https://www.nytimes.com/2019/12/17/business/trump-trade-deals-free-markets.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/business/17dc-chinatrade-01/17dc-chinatrade-01-facebookJumbo.jpg", "publishedAt": "2019-12-17T21:57:50Z", "content": "Mr. Lighthizer left government in 1985, but the Reagan administration continued with a managed trade approach, pushing Japan and South Korea to agree to import a certain amount of products. The Clinton administration also considered the tactic, but faced crit… [+1628 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Rachel Abrams", "title": "A Female ‘60 Minutes’ Producer Sues CBS, Claiming Discrimination", "description": "She claims she was sidelined after reporting that her boss, an Emmy-winning producer, texted her an inappropriate photo.", "url": "https://www.nytimes.com/2019/12/17/business/media/60-minutes-producer-cbs-lawsuit.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/business/17CBS/17CBS-facebookJumbo.jpg", "publishedAt": "2019-12-17T21:44:12Z", "content": "Days later, Ms. Vinograd sent an email to CBS executives, including Susan Zirinsky, the head of CBS News, and the networks human resources division, saying that she wanted to make a complaint about highly inappropriate, unprofessional and upsetting events, bu… [+1186 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Hiroko Tabuchi", "title": "Eastern States Introduce a Plan to Cap Tailpipe Pollution", "description": "Twelve states and the District of Columbia released a draft plan for an ambitious cap-and-trade program to curb planet-warming emissions on the region’s roads.", "url": "https://www.nytimes.com/2019/12/17/climate/tailpipe-emissions-cap-and-trade.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/science/17cli-cars01/17cli-cars01-facebookJumbo.jpg", "publishedAt": "2019-12-17T21:34:33Z", "content": "A coalition of twelve mid-Atlantic and Northeastern states and the District of Columbia on Tuesday released a draft plan for an ambitious cap-and-trade program to curb tailpipe emissions from cars, trucks and other forms of transportation, tackling what has f… [+847 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Salim Valji, Étienne Lajoie", "title": "Amid Blackface and Abuse Allegations, Hockey Wonders Why Young Canadians Don’t Play - The New York Times", "description": "Amid Blackface and Abuse Allegations, Hockey Wonders Why Young Canadians Don’t Play The New York Times 'Road to the Winter Classic,' which began filming the day after Stars fired Jim Montgomery, debuts Dec. 23 The Dallas Morning News Facts and Figures: Huberd…", "url": "https://www.nytimes.com/2019/12/17/sports/hockey/akim-aliu-nhl-diversity.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/sports/16nhl-canada/merlin_165065514_2cc7052b-1627-45ec-b4ce-1d77100013b6-facebookJumbo.jpg", "publishedAt": "2019-12-17T21:17:00Z", "content": "Bettmans latest initiative comes at a time when the sport is grappling with both its culture and a decline in popularity in Canada, the country of its birth.\r\nAt all levels, concerns about ice hockeys head injuries, scant diversity and costs are rankling pare… [+2068 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Adam Nossiter and Mélissa Godin", "title": "Amid Chaos of Daily Commutes, Strikers and Macron Compete for the Commuters", "description": "The government is banking that anger at the strikers for making life miserable will tip the scales of public opinion in its favor. So far that is not happening.", "url": "https://www.nytimes.com/2019/12/17/world/europe/france-strikes-protest.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/world/17france-strikes/17france-strikes-facebookJumbo.jpg", "publishedAt": "2019-12-17T21:09:57Z", "content": "Musicians and dancers with the workers, read one banner; Girls just wanna have a good salary, a good career, a good retirement, read another. Make Our Retirements Great Again, read a third. \r\nAll had come out to express their fury at the government for daring… [+1332 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ben Proudfoot", "title": "‘Girls Don’t Play Guitar’: The Band That Proved John Lennon Wrong", "description": "In the mid-1960s, four teenagers from Liverpool were changing the face of pop music. Their names were Mary, Sylvia, Pam and Val.", "url": "https://www.nytimes.com/2019/12/17/opinion/liverbirds-john-lennon.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/opinion/opdoc-liverbirds-img/opdoc-liverbirds-img-facebookJumbo.jpg", "publishedAt": "2019-12-17T20:59:30Z", "content": "Oh, I dont know. My god, were talking about maybe 60 years ago. Yeah. The Birds and The Beatles meet The Liverbirds from Merseyside, teenagers who have teamed up to try and break the male monopoly of the beat world. Boyfriends have had to have the brush-off, … [+12267 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Matt Apuzzo", "title": "E.U. Lawmakers Condemn Subsidy Corruption but Disagree on What to Do", "description": "A Times investigation showed how oligarchs and political patrons make millions in farm subsidies. But the program is all but sacrosanct.", "url": "https://www.nytimes.com/2019/12/17/world/europe/EU-farm-subsidies-corruption.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/world/17farms/17farms-facebookJumbo.jpg", "publishedAt": "2019-12-17T20:38:04Z", "content": "European lawmakers are now debating the renewal of the blocs next seven-year farm bill. National leaders want more discretion on how to spend the money, and farmers want fewer administrative requirements. In Brussels, there is little appetite for a major refo… [+1169 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Julie Turkewitz", "title": "Two Teenage Employees Die at McDonald’s in Peru", "description": "The workers were electrocuted by a loose cable over the weekend, raising questions about labor conditions at the franchise.", "url": "https://www.nytimes.com/2019/12/17/world/americas/mcdonalds-deaths-peru.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/world/17peru/17peru-facebookJumbo.jpg", "publishedAt": "2019-12-17T20:33:24Z", "content": "In 2016, a fire in a cinema at a mall called Larcomar, owned by a Chilean company, killed four workers who were trapped inside. Some were found just feet from blocked exits. \r\nMore recently, a worker was killed by an explosion at a mall called Jockey Plaza, a… [+1758 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Melina Delkic", "title": "Your Wednesday Briefing", "description": "India’s internet crackdown, swine fever, the Vatican: Here’s what you need to know.", "url": "https://www.nytimes.com/2019/12/17/briefing/india-protests-swine-fever-china-impeachment.html", "urlToImage": "https://static01.nyt.com/images/2019/12/02/business/18AsiaBrief-1-promo/00chinapigs-1-facebookJumbo.jpg", "publishedAt": "2019-12-17T20:33:22Z", "content": "He and a photographer spent three months, at all hours and in all weather, talking to dozens of residents of a homeless encampment in Oakland. Many fled natural disasters, and all are afraid of being pushed out, with nowhere to go. \r\nChina: The country commis… [+1398 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Parul Sehgal", "title": "In ‘The Factory,’ a Mysterious Company Manufactures Fear", "description": "Hiroko Oyamada’s novel, which follows three workers employed at a large corporation, has things to say about financial insecurity, alienation and climate change.", "url": "https://www.nytimes.com/2019/12/17/books/review-factory-hiroko-oyamada.html", "urlToImage": "https://static01.nyt.com/images/2019/12/17/books/17bookoyamada/17bookoyamada-facebookJumbo.jpg", "publishedAt": "2019-12-17T20:26:50Z", "content": "The voices, and attitudes, of the three are identical: puzzled, passive and melancholy. Only a sudden pronoun shift or small detail indicates a shift in perspective. Its an alertness Oyamada inculcates in her reader. She is fond of jump cuts and scenes that d… [+2459 chars]"}]}