{"status": "ok", "totalResults": 49, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Trish Bendix", "title": "Late Night Is Back and Ready for War", "description": "Stephen Colbert returned from his holiday break to find that President Trump is “still mad about the Iranian hostage crisis.”", "url": "https://www.nytimes.com/2020/01/07/arts/television/trump-iran-stephen-colbert.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/arts/07latenight/07latenight-facebookJumbo.png", "publishedAt": "2020-01-07T08:11:38Z", "content": "So heres how it went down Trumps advisers went to Mar-a-Lago and military officials put the option of killing Suleimani which they viewed as the most extreme response on the menu they presented President Trump. They didnt think hed do it they tacked on the ch… [+1184 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Ben Casselman, Jim Tankersley and Jeanna Smialek", "title": "Economists Grapple With Bias and Harassment in Their Ranks", "description": "After a year of revelations about racism and sexism, the profession’s annual meeting reflected signs of progress, but also work to be done.", "url": "https://www.nytimes.com/2020/01/07/business/economy/economics-race-gender.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/business/06econ3/merlin_166618347_9a446ea5-216a-49ab-b2dc-708bb86d8819-facebookJumbo.jpg", "publishedAt": "2020-01-07T08:00:11Z", "content": "In an interview, Mr. Bernanke and the new president, Janet L. Yellen, his successor as Fed chair, said the association would soon finalize procedures for investigating violations of its code of conduct and for punishing violators. One formal complaint has alr… [+1929 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Iliana Magra", "title": "British Woman Who Accused Israeli Men of Rape Is Given a Suspended Sentence", "description": "The woman retracted her statement after telling the police that a dozen young men had raped her in a resort town in Cyprus, but then said she had done so under pressure.", "url": "https://www.nytimes.com/2020/01/07/world/europe/cyprus-uk-rape.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/world/07cyprus-trial-1/07cyprus-trial-1-facebookJumbo.jpg", "publishedAt": "2020-01-07T07:51:42Z", "content": "The chief investigating officer in the case, Marios Christou, testified during her trial for public mischief that she had admitted reporting the episode because the young men were recording her having sex and she felt insulted. He also cited inconsistencies b… [+1111 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Amos Zeeberg", "title": "The Superpowers of Super-Thin Materials", "description": "In materials science, 2-D is the new 3-D.", "url": "https://www.nytimes.com/2020/01/07/science/physics-materials-electronics.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/science/00SCI-FLAT1/00SCI-FLAT1-facebookJumbo.jpg", "publishedAt": "2020-01-07T07:50:15Z", "content": "Researchers quickly set out to make all kinds of new and improved gadgets from it. Recently several companies released headphones with diaphragms the vibrating membranes that produce sound in audio devices made of graphene. Some paint manufacturers are adding… [+2020 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "UBS Overhauls European Wealth Management Business-Memo - The New York Times", "description": "UBS Group is reorganising its flagship wealth management business in the Europe, Middle East and Africa region and streamlining management, according to a staff memo seen by Reuters and confirmed by the Swiss bank.", "url": "https://www.nytimes.com/reuters/2020/01/07/business/07reuters-ubs-group-wealth.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-07T07:24:00Z", "content": "ZURICH UBS Group is reorganising its flagship wealth management business in the Europe, Middle East and Africa region and streamlining management, according to a staff memo seen by Reuters and confirmed by the Swiss bank.\r\nChristl Novakovic will continue to l… [+522 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "A Sea of Mourners in Iran, and New Threats From Both Sides", "description": "Vast crowds thronged the streets of Tehran as a funeral was held for Maj. Gen. Qassim Suleimani, who was killed in an American drone strike on Friday.", "url": "https://www.nytimes.com/2020/01/06/world/middleeast/iran-soleimani.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06Iran-briefing1-promo/06Iran-briefing1-promo-facebookJumbo-v2.jpg", "publishedAt": "2020-01-07T07:07:02Z", "content": "Mr. Esper acknowledged that striking Iranian cultural sites with no military value would be a war crime, putting him at odds with the president, who insisted such places would be legitimate targets. Mr. Trumps threats generated condemnation at home and abroad… [+1742 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Intel's Mobileye Demos Autonomous Car Equipped Only With Cameras, No Other Sensors", "description": "Intel Corp on Monday released a video of its Mobileye autonomous car navigating the streets of Jerusalem for about 20 minutes with the help of 12 on-board cameras and, unusually, no other sensors.", "url": "https://www.nytimes.com/reuters/2020/01/06/technology/06reuters-tech-ces-intel.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-07T06:47:21Z", "content": "LAS VEGAS Intel Corp on Monday released a video of its Mobileye autonomous car navigating the streets of Jerusalem for about 20 minutes with the help of 12 on-board cameras and, unusually, no other sensors.\r\nThe development comes as chipmakers and machine-vis… [+578 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "U.S. Embassies on Alert as Iran Threatens Reprisals: Live Updates", "description": "Ayatollah Ali Khamenei has told advisers that any retaliation for Maj. Gen. Qassim Suleimani’s killing should be carried out openly by Iran.", "url": "https://www.nytimes.com/2020/01/07/world/middleeast/trump-iran-qassem-soleimani.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/world/07iran-briefing-1/07iran-briefing-1-facebookJumbo.jpg", "publishedAt": "2020-01-07T06:30:26Z", "content": "That is a startling departure for the Iranian leadership, which has typically cloaked its attacks behind the actions of proxies it has cultivated around the region. But in the fury generated by the killing of General Suleimani, a close ally and personal frien… [+941 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Ives", "title": "Iran, Spain, Carlos Ghosn: Your Tuesday Briefing", "description": "Here’s what you need to know.", "url": "https://www.nytimes.com/2020/01/07/briefing/iran-spain-carlos-ghosn.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/world/07ambriefing-europe-promo2/07ambriefing-europe-promo2-facebookJumbo.jpg", "publishedAt": "2020-01-07T06:25:12Z", "content": "Follow our live updates here.\r\nThe calls for revenge came as millions poured into the streets of Tehran to mourn the general, according to state-run news outlets. Irans supreme leader, Ayatollah Ali Khamenei, has told advisers that any reprisals must be direc… [+1249 chars]"}]}