{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "David McCabe and Davey Alba", "title": "Facebook Says It Will Ban ‘Deepfakes’", "description": "The company said it would remove videos altered by artificial intelligence in ways meant to mislead viewers.", "url": "https://www.nytimes.com/2020/01/07/technology/facebook-says-it-will-ban-deepfakes.html", "urlToImage": "https://static01.nyt.com/images/2020/01/07/world/07facebook-1/07facebook-1-facebookJumbo.jpg", "publishedAt": "2020-01-07T05:56:06Z", "content": "The companys new policy was first reported by The Washington Post.\r\nFacebook was heavily criticized last year for refusing to take down an altered video of Speaker Nancy Pelosi that had been edited to make it appear as though she was slurring her words. At th… [+1129 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Micaela Marini Higgs", "title": "Go Ahead and Complain. It Might Be Good for You.", "description": "A mantra to embrace: “This sucks I’m unhappy with what’s going on.”", "url": "https://www.nytimes.com/2020/01/06/smarter-living/how-to-complain-.html", "urlToImage": "https://static01.nyt.com/images/2019/12/12/smarter-living/00sl-complain/00sl-complain-facebookJumbo.jpg", "publishedAt": "2020-01-07T04:57:33Z", "content": "But the most obvious reason we complain? Life isnt perfect. Thats why expressing negative feelings is not only normal, but also healthy, Dr. Kowalski said, adding that the unrealistic expectation that we should always be happy can make us feel worse. Inhibiti… [+1714 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Quotation of the Day: Trolled, Taiwan Sees China’s Meddling", "description": "Supported by Continue reading the main story Quotation of the Day: Trolled, Taiwan Sees China’s Meddling. “The ultimate goal, just like what Russia tried to do in the United States, is to crush people’s confidence in the democratic system.”, a cybersecurity s…", "url": "https://www.nytimes.com/2020/01/06/todayspaper/quotation-of-the-day-trolled-taiwan-sees-chinas-meddling.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-07T03:55:00Z", "content": "The ultimate goal, just like what Russia tried to do in the United States, is to crush peoples confidence in the democratic system.\r\nTZENG YI-SUO, a cybersecurity specialist in Taiwan, where officials suspect election meddling by China."}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Neil Vigdor", "title": "Ikea Will Pay $46 Million to Parents of Toddler Crushed to Death by a Dresser", "description": "The 70-pound Malm dresser had been the subject of a safety recall when it tipped over on Jozef Dudek, killing the 2-year-old.", "url": "https://www.nytimes.com/2020/01/06/us/ikea-dresser-lawsuit-settlement.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/multimedia/06xp-ikeaSUB/06xp-ikeaSUB-facebookJumbo.jpg", "publishedAt": "2020-01-07T03:53:20Z", "content": "Consumer product safety groups say that Jozefs death was not an isolated case. They have pressed members of Congress to pass the Stop Tip-overs of Unstable, Risky Dressers on Youth Act or STURDY Act, which would require the United States Consumer Product Safe… [+1254 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "Inside the Golden Globes after-parties: What Brad Pitt, Awkwafina, Olivia Colman et al got upto after the final gong", "description": "Joaquin Phoenix, Olivia Colman, Awkwafina, Brian Cox and Michelle Williams were among the winners at this year's Golden Globes. Here's what happened after the awards show drew to a close The post Inside the Golden Globes after-parties: What Brad Pitt, Awkwafi…", "url": "https://www.nytimes.com/2020/01/06/style/globes-after-parties.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2020/01/GOLDEN-GLOBES-PARTIES-4-SOC.jpg", "publishedAt": "2020-01-07T03:40:51Z", "content": "Michelle Williams knows how to time an exit.\r\nWilliams, who is pregnant, won her second Golden Globe on Sunday night for her performance in Fosse/Verdon. But she ducked out 20 minutes before the end of the ceremony, heading to the Hollywood Foreign Press Asso… [+4947 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Crowley", "title": "For Some Never Trumpers, Killing Suleimani Was Finally Something to Like - The New York Times", "description": "For Some Never Trumpers, Killing Suleimani Was Finally Something to Like The New York Times US and Iran trade new threats CBS This Morning Trump’s motivation for Suleimani assassination The Guardian Trump doubles down on targeting cultural sites, Iranian gene…", "url": "https://www.nytimes.com/2020/01/06/us/politics/never-trumpers-suleimani.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/us/politics/06dc-hawks1/06dc-hawks1-facebookJumbo.jpg", "publishedAt": "2020-01-07T02:55:00Z", "content": "Although it remains far from clear that Mr. Trump wants a full-scale conflict with Iran as he kicks off an election year  speaking to reporters on Sunday, he repeated his view that invading Iraq was the worst decision ever made in the history of our country t… [+2315 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "NYT: Iran Leader Wants Retaliation to Be Carried Out Directly...", "description": "NYT: Iran Leader Wants Retaliation to Be Carried Out Directly... (Second column, 2nd story, link ) Related stories: COULTER: WE THOUGHT TRUMP WOULD BE DIFFERENT... White House awaits next move... BAKER: High-risk gambles with much at stake... 'Completely coin…", "url": "https://www.nytimes.com/2020/01/06/world/middleeast/khamenei-wants-to-put-irans-stamp-on-reprisal-for-us-killing-of-top-general.html?partner=msn", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBYG1oN.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg", "publishedAt": "2020-01-07T02:52:37Z", "content": "The funeral procession for Major General Qasim Suleimani in Tehran on Monday.\r\nArmy cadets in Iran at the funeral procession in Tehran.\r\nPrime Minister Adel Abdul Mahdi, center right, met with United States Ambassador to Iraq Matthew Tueller on Monday, as see… [+18628 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "BAKER: High-risk gambles with much at stake...", "description": "BAKER: High-risk gambles with much at stake... (Second column, 4th story, link ) Related stories: COULTER: WE THOUGHT TRUMP WOULD BE DIFFERENT... NYT: Iran Leader Wants Retaliation to Be Carried Out Directly... White House awaits next move... 'Completely coin…", "url": "https://www.nytimes.com/2020/01/05/us/politics/trump-iran.html?partner=msn", "urlToImage": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BBYFDCK.img?h=630&w=1200&m=6&q=60&o=t&l=f&f=jpg&x=2067&y=770", "publishedAt": "2020-01-07T02:52:37Z", "content": "President Trump departing West Palm Beach, Fla., on Sunday. Mr. Trump did not retreat from his vow to respond to any Iranian provocations with overwhelming force.\r\nSenator Christopher S. Murphy, Democrat of Connecticut, called Mr. Trumps actions on Iran a nig… [+8383 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aidan Gardiner", "title": "We’re Hoping to Hear From Iranians on Suleimani’s Killing and Rising Tensions", "description": "If you’re in Iran, please share with us how the killing of Maj. Gen. Qassim Suleimani and its aftermath has affected you and your family.", "url": "https://www.nytimes.com/2020/01/06/reader-center/suleimani-killing-iran-reactions.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06readers-suleimani-reax/06readers-uleimani-reax-facebookJumbo.jpg", "publishedAt": "2020-01-07T02:30:40Z", "content": "The New York Times has been following the latest developments in Iran and Iraq closely, and were hoping to hear from more Iranians about how last weeks killing of Maj. Gen. Qassim Suleimani and rising tensions with the United States are affecting their day-to… [+636 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Zolan Kanno-Youngs", "title": "Mexican Asylum Seekers Could Now Be Deported to Guatemala", "description": "A plan that homeland security officials once praised as a deterrent for Central Americans considering the long journey through Mexico is being expanded.", "url": "https://www.nytimes.com/2020/01/06/us/politics/mexican-asylum-seekers-guatemala.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/us/politics/06dc-dhs/06dc-dhs-facebookJumbo.jpg", "publishedAt": "2020-01-07T01:30:55Z", "content": "Border arrests have declined by 70 percent since May, the height of crossings last year, driven by multiple policies aiming to prevent Central Americans from seeking asylum in the United States. \r\nBut as violence has driven many to flee north, about 17,000 Me… [+1538 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Farnaz Fassihi and David D. Kirkpatrick", "title": "Khamenei Wants to Put Iran’s Stamp on Reprisal for U.S. Killing of Top General", "description": "In a departure from Iran’s usual tactics of hiding behind proxies, the country’s supreme leader wants any retaliation for the killing of a top military commander to be carried out openly by Iranian forces.", "url": "https://www.nytimes.com/2020/01/06/world/middleeast/khamenei-wants-to-put-irans-stamp-on-reprisal-for-us-killing-of-top-general.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06iran/06iran-facebookJumbo.jpg", "publishedAt": "2020-01-07T01:20:01Z", "content": "For its part, Iran simultaneously continued a months-long push against the Trump administration over its demands that Tehran submit to a more restrictive renegotiation of a 2015 accord with the Western powers over its nuclear research. The Trump administratio… [+1664 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Peter Baker and Maggie Haberman", "title": "Pentagon Rules Out Striking Iranian Cultural Sites, Contradicting Trump", "description": "The defense secretary acknowledged that “the laws of armed conflict” prohibited attacking antiquities and said the military had no plans to do so, even though the president declared them targets.", "url": "https://www.nytimes.com/2020/01/06/us/politics/trump-esper-iran-cultural-sites.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06dc-antiquities/06dc-antiquities-facebookJumbo.jpg", "publishedAt": "2020-01-07T01:19:02Z", "content": "Mr. Graham, a retired military lawyer in the Air Force Reserve, said he delivered that message to Mr. Trump in a telephone call on Monday. I think the president saying we will hit you hard is the right message, he said. Cultural sites is not hitting them hard… [+2131 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Farnaz Fassihi, David D. Kirkpatrick", "title": "Khamenei Wants to Put Iran’s Stamp on Reprisal for U.S. Killing of Top General - The New York Times", "description": "Khamenei Wants to Put Iran’s Stamp on Reprisal for U.S. Killing of Top General The New York Times US and Iran trade new threats CBS This Morning It’s 2003 All Over Again The Atlantic A war with Iran is awful, and Iraq knows it. Why doesn't America — especiall…", "url": "https://www.nytimes.com/2020/01/06/world/middleeast/iran-khamenei-general-soleimani.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06iran/06iran-facebookJumbo.jpg", "publishedAt": "2020-01-07T01:09:00Z", "content": "For its part, Iran simultaneously continued a monthslong push against the Trump administration over its demands that Tehran submit to a more restrictive renegotiation of a 2015 accord with the Western powers over its nuclear research. The Trump administration… [+1659 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michelle Goldberg", "title": "The Nightmare Stage of Trump’s Rule Is Here", "description": "Unstable and impeached, the president pushes the U.S. toward war with Iran.", "url": "https://www.nytimes.com/2020/01/06/opinion/trump-iran.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/opinion/06goldberg/06goldberg-facebookJumbo.jpg", "publishedAt": "2020-01-07T01:04:09Z", "content": "Rather than self-defense, the Suleimani killing seems like the dreadful result of several intersecting dynamics. Theres the influence of rapture-mad Iran hawks like Pompeo and Vice President Mike Pence. Defense officials who might have stood up to Trump have … [+2181 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Baker and Caitlin Dickerson", "title": "Iranian-Americans Questioned at the Border: ‘My Kids Shouldn’t Experience Such Things’", "description": "Up to 200 people were held by border agents, with some of them reportedly asked to share their opinions about the situation in Iran and Iraq.", "url": "https://www.nytimes.com/2020/01/06/us/border-iranians-washington-patrol.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/us/06BORDER/06BORDER-facebookJumbo.jpg", "publishedAt": "2020-01-07T00:54:06Z", "content": "John Ghazvinian, a historian who specializes in the history of Irans relationship with the United States, said he was returning from a trip to Egypt through Kennedy International Airport in New York on Sunday when an officer asked him about his most recent tr… [+1406 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Paulina Villegas", "title": "A New Toll in Mexico’s Drug War: More than 61,000 Vanished", "description": "The government said 61,637 people have disappeared since 1964, the vast majority since 2006, when then-president Felipe Calderón began cracking down on drug cartels.", "url": "https://www.nytimes.com/2020/01/06/world/americas/mexico-drug-war-death-toll.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06mexico/06mexico-facebookJumbo.jpg", "publishedAt": "2020-01-07T00:51:48Z", "content": "More than 61,000 people have been forcibly disappeared in Mexico in recent years, government officials announced on Monday, a drastic increase of an earlier estimate of the toll of the countrys endemic drug-related violence and cartel warfare. \r\nThese are dat… [+704 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Niraj Chokshi", "title": "Dairy Giant Borden Files for Bankruptcy Protection", "description": "The Dallas company, which employs 3,300, had been trying to renegotiate its debt agreements for months, but talks fell through.", "url": "https://www.nytimes.com/2020/01/06/business/borden-milk-bankruptcy.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/business/06borden1/06borden1-facebookJumbo.jpg", "publishedAt": "2020-01-07T00:46:08Z", "content": "Just two months ago, Dean Foods, the largest milk company in the United States and one of Bordens biggest competitors, also said it was seeking bankruptcy protection.\r\nBordens financial troubles extend to 2017. After arranging for about $275 million in loans … [+799 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Florence Fabricant", "title": "A Perfect Cheese for Raclette", "description": "The new wheels of L’Etivaz cheese, made in the Swiss canton of Vaud, may be the best yet.", "url": "https://www.nytimes.com/2020/01/06/dining/levitaz-cheese-eli-zabar.html", "urlToImage": "https://static01.nyt.com/images/2020/01/08/dining/06burner4/06burner4-facebookJumbo.jpg", "publishedAt": "2020-01-07T00:34:05Z", "content": "LEtivaz is a type of Swiss Gruyère thats made according to more traditional, higher standards than regular Gruyère, and its sold in a number of better cheese stores. James Coogan, the cheese buyer at Elis Manhattan food market, says the cheese made in 2018 (t… [+1031 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Jason Farago", "title": "Targeting Cultural Sites in War Is Illegal. It’s Also Barbaric. - The New York Times", "description": "Targeting Cultural Sites in War Is Illegal. It’s Also Barbaric. The New York Times The president didn’t threaten just Iran’s culture sites. He threatened culture. The Washington Post Trump Doubles Down On Iranian Strike HuffPost The strategic stupidity of thr…", "url": "https://www.nytimes.com/2020/01/06/arts/design/trump-iran-cultural-sites.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/arts/06iran-culture3/06iran-culture3-facebookJumbo.jpg", "publishedAt": "2020-01-07T00:15:00Z", "content": "Museum directors, including the leaders of the Metropolitan Museum of Art in New York and the Victoria &amp; Albert Museum in London, have naturally voiced their disapproval. Threatening cultural sites in Iran, said Thomas P. Campbell, the director of the Fin… [+1213 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Julie Turkewitz, Lara Jakes and Ana Vanessa Herrero", "title": "The United States Bet Guaidó Could Transform Venezuela. It Hasn’t Happened.", "description": "The United States threw its might behind Juan Guaidó when he claimed the presidency, a direct challenge to President Nicolás Maduro. A year later, the Trump administration has little to show for its efforts.", "url": "https://www.nytimes.com/2020/01/06/world/americas/guaido-venezuela-trump.html", "urlToImage": "https://static01.nyt.com/images/2020/01/06/world/06venezuela/06venezuela-facebookJumbo.jpg", "publishedAt": "2020-01-07T00:13:48Z", "content": "He spent one of last days of 2019 delivering presents to children around Caracas, trailed by two government minders on motorbikes. In a lengthy interview between toy drops, he said his wife, Fabiana Rosales, and their toddler are followed even to their daught… [+1286 chars]"}]}