{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Trish Bendix", "title": "Late Night Wonders if Trump Understands Why He Was Impeached - The New York Times", "description": "Late Night Wonders if Trump Understands Why He Was Impeached The New York Times McConnell: 'Impasse' over Trump impeachment trial, as Dems depart from precedent Fox News The debate reminds us that the only way to remove Trump from office is at the ballot box …", "url": "https://www.nytimes.com/2019/12/20/arts/television/trump-impeachment-rally.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/arts/20latenight/20latenight-facebookJumbo.png", "publishedAt": "2019-12-20T07:37:00Z", "content": "Thats right: the president attacked security guards, Democrats, the media and dishwashers. Normally when someone rambles that long you have to take away their keys. SETH MEYERS\r\nTrump also lashed out viciously at Representative Debbie Dingell from Michigan. D… [+1036 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Astor", "title": "Who Won the Democratic Debate? Experts Weigh In. - The New York Times", "description": "Who Won the Democratic Debate? Experts Weigh In. The New York Times Chris Cillizza's winners and losers from the 6th Democratic presidential debate CNN Democrats' debate erupts as candidates spar over donors; Yang slams Trump 'obsession' Fox News Everyone fai…", "url": "https://www.nytimes.com/2019/12/20/us/politics/who-won-democratic-debate.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-20T07:32:00Z", "content": "One of the fiercest exchanges was between Senator Amy Klobuchar of Minnesota and Mayor Pete Buttigieg of South Bend, Ind. Ms. Klobuchar challenged Mr. Buttigieg on his experience and electability noting that she has repeatedly won in conservative parts of Min… [+1738 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Steven Lee Myers", "title": "China’s Leader Warns Against ‘External Forces’ in Macau and Hong Kong", "description": "Xi Jinping celebrated the 20th anniversary of the return of Macau to Chinese rule and said Beijing would brook no challenges to its sovereignty.", "url": "https://www.nytimes.com/2019/12/20/world/asia/china-xi-jinping-macau-hong-kong-protest.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/world/20china-macau-1sub/20china-macau-1sub-facebookJumbo.jpg", "publishedAt": "2019-12-20T06:48:39Z", "content": "In the days leading up to the anniversary, state television and newspapers lavished coverage on the territory, citing the rising prosperity of the citys 670,000 residents, the stewardship of the citys leadership and most of all, Macaus loyalty to the Communis… [+1580 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sarah Lyall", "title": "Nice Wine Cave You Got There, Pete", "description": "The Democrats keep things fresh with a fight over credentials, crystals and who can beat Donald Trump.", "url": "https://www.nytimes.com/2019/12/20/us/politics/wine-cave-buttigieg-warren.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/us/politics/20debate-moment/20debate-moment-facebookJumbo.jpg", "publishedAt": "2019-12-20T06:26:40Z", "content": "It was that kind of evening. The Democratic candidates vying for their partys presidential nomination agreed that their main goal is to defeat Mr. Trump in the general election next November. But to win the nomination, they have to find ways of differentiatin… [+1830 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "KENNETH CHANG", "title": "What to expect from the Boeing Starliner launch", "description": "NASA and Boeing will conduct a test flight of a capsule that could soon carry astronauts to the International Space Station.", "url": "https://www.nytimes.com/2019/12/19/science/boeing-starliner-launch.html", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2019/12/starlinerReady_tzr-780x501.jpg", "publishedAt": "2019-12-20T06:11:06Z", "content": "Just before sunrise on the East Coast Friday, an Atlas 5 rocket will launch from Cape Canaveral in Florida. On top of the rocket is Boeings Starliner capsule, designed for taking astronauts to and from the International Space Station. This mission will not ha… [+4687 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Alex Niven", "title": "The Labour Party’s Spectacular Defeat Had Been Coming for Decades", "description": "The British party’s collapse in its heartlands goes back much further than last week’s election.", "url": "https://www.nytimes.com/2019/12/20/opinion/uk-election-labour.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/opinion/20Niven1/20Niven1-facebookJumbo.jpg", "publishedAt": "2019-12-20T06:00:07Z", "content": "What has happened fairly decisively at the close of the 2010s is that the combination of vanishing Labour heritage in the postindustrial areas and a feeling of anger about socio-economic marginalization have dovetailed to finally sever the bonds between the p… [+2794 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Anjali Mody", "title": "India Awakens to Fight for Its Soul", "description": "Authoritarian and divisive polices of the Modi government have pushed Indians across the country to the streets in protest.", "url": "https://www.nytimes.com/2019/12/20/opinion/india-citizenship-law-protests.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/opinion/20Mody/20Mody-facebookJumbo.jpg", "publishedAt": "2019-12-20T06:00:06Z", "content": "The sense is that even Indian Muslims, particularly in border states, may fall through the N.R.C. cracks if they cannot produce the documents required, while Hindus, Sikhs, Buddhists, Christians and Zoroastrians can claim citizenship through the new citizensh… [+3157 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Ives", "title": "Your Friday Briefing", "description": "Malta, Club World Cup, Airbnb: Here’s what you need to know.", "url": "https://www.nytimes.com/2019/12/20/briefing/Malta-Club-World-Cup-Airbnb.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/nyregion/20AMbriefing-eu-promo/parnas-fruman-facebookJumbo.jpg", "publishedAt": "2019-12-20T05:44:17Z", "content": "Photo editors at The Times have pored over images of moments both fresh and faded to tell the story of the 2010s, a decade of seemingly ceaseless upheaval.\r\nAbove, migrants arriving in Greece in 2015, when more than one million entered Europe, many fleeing wa… [+1433 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Maggie Astor", "title": "The Candidates Were Told to Give a Gift or Ask Forgiveness. Guess What the Women Chose. - The New York Times", "description": "The Candidates Were Told to Give a Gift or Ask Forgiveness. Guess What the Women Chose. The New York Times Chris Cillizza's winners and losers from the 6th Democratic presidential debate CNN Why the sixth debate is so important POLITICO Mary Anne Marsh: Decem…", "url": "https://www.nytimes.com/2019/12/20/us/politics/klobuchar-warren-democratic-debate.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/us/politics/19breakout-forgiveness1/19breakout-forgiveness1-facebookJumbo.jpg", "publishedAt": "2019-12-20T05:05:00Z", "content": "It was the last question of the debate, traditionally a softball, and the candidates on Thursday were thrown a curveball. They could give a gift to someone else onstage. Or, in the spirit of the season, they could ask for forgiveness.\r\nThe five men chose to g… [+2460 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mike Hale", "title": "Review: Netflix Sends ‘The Witcher’ Into the Fantasy Fray - The New York Times", "description": "Review: Netflix Sends ‘The Witcher’ Into the Fantasy Fray The New York Times The Witcher's Henry Cavill just wants to stay home and play games PC Gamer The Witcher: How Does Magic Work for Geralt and Yennefer? - IGN First - IGN IGN The Witcher Takes Way Too D…", "url": "https://www.nytimes.com/2019/12/20/arts/television/review-netflix-the-witcher.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/arts/19witcher/19witcher-facebookJumbo-v3.jpg", "publishedAt": "2019-12-20T05:01:00Z", "content": "The more salient point for fantasy fans is that the eight episodes of the first season of The Witcher (available on Friday) are at a level of production value and writing somewhere south of Thrones and somewhere north, but not too far north, of a Syfy channel… [+1637 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kenneth Chang", "title": "What to Expect From the Boeing Starliner Launch", "description": "NASA and Boeing will conduct a test flight of a capsule that could soon carry astronauts to the International Space Station.", "url": "https://www.nytimes.com/2019/12/20/science/boeing-starliner-launch.html", "urlToImage": "https://static01.nyt.com/images/2019/12/20/science/20starliner01/20starliner01-facebookJumbo.jpg", "publishedAt": "2019-12-20T05:00:07Z", "content": "NASA officials have been careful not to promise a launch date yet, saying that the schedule depends on how well Starliner performs during its flight test and how long it takes to ensure safety for its astronauts. (The losses of the space shuttles Challenger i… [+1832 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "By Zoe Fishman", "title": "The Subway Crush Who Crushed Me", "description": "We met on the train, married and had two boys who resembled him. I had no idea how much that resemblance would rebuild me.", "url": "https://www.nytimes.com/2019/12/20/style/modern-love-subway-crush-crushed-me.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/fashion/22MODERNLOVE/22MODERNLOVE-facebookJumbo.jpg", "publishedAt": "2019-12-20T05:00:06Z", "content": "So there is a difference. Just because I failed to foresee Ronens untimely and unjust death does not mean I cant listen to (once in a while, when its especially loud) that inner voice in my head, that fluttering of recognition in my chest. I may be heartbroke… [+1364 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "UK Consumer and Business Morale Touched Five-Month High Before Election-Surveys - The New York Times", "description": "Confidence among British consumers and businesses rose to the highest level in five months in the run-up to Prime Minister Boris Johnson's emphatic election victory last week, surveys showed on Friday.", "url": "https://www.nytimes.com/reuters/2019/12/19/business/19reuters-britain-economy-consumers.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-20T04:16:00Z", "content": "\"Despite official warning signs about the flatlining of Britain's economy, we know that record-high employment and below-target levels of inflation are helping to boost consumers' expectations for the year ahead,\" Joe Staton, client strategy director at GfK, … [+603 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Emily S. Rueb", "title": "Critics’ Claws Are Out for ‘Cats’: A Roundup of Reviews", "description": "The trailer sent shock waves through the internet this summer. Now that they’ve seen it, what do critics have to say about the new big-screen adaptation?", "url": "https://www.nytimes.com/2019/12/19/arts/cats-movie-reviews.html", "urlToImage": "https://static01.nyt.com/images/2019/12/19/multimedia/19xp-cats2/merlin_166030263_b98a275a-130c-49cc-841b-6fbe7fe0f4f4-facebookJumbo.jpg", "publishedAt": "2019-12-20T04:02:23Z", "content": "Peter Debruge, Varietys chief film critic,said the director Tom Hoopers outlandishly tacky interpretation seems destined to become one of those once-in-a-blue-moon embarrassments that mars the résumés of great actors and trips up the careers of promising newc… [+2641 chars]"}]}