{"status": "ok", "totalResults": 44, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Aimee Ortiz", "title": "Leader of Right-Wing Border Militia Pleads Guilty to Federal Gun Charge", "description": "The head of a group that detained migrants at gunpoint in New Mexico faces up to 10 years in prison.", "url": "https://www.nytimes.com/2020/01/03/us/militia-border-migrants-guilty.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/us/03xp-militiaplea/merlin_153783294_a70ba7e6-6746-4cd8-9c0b-80aa39961566-facebookJumbo.jpg", "publishedAt": "2020-01-03T23:52:23Z", "content": "The leader of a right-wing militia that was detaining migrant families at gunpoint near the border in southern New Mexico pleaded guilty this week to a federal gun charge, Justice Department officials said.\r\nThe leader, Larry Mitchell Hopkins, who has also op… [+778 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Knvul Sheikh", "title": "Dr. Heather Ashton, 90, Dies; Helped People Quit Anxiety Drugs", "description": "Her “Ashton Manual,” published in 1999, has become a cornerstone for people all over the world dealing with benzodiazepine dependence.", "url": "https://www.nytimes.com/2020/01/03/science/dr-heather-ashton-dead.html", "urlToImage": "https://static01.nyt.com/images/2020/01/05/obituaries/05Ashton-obit1/20Ashton-facebookJumbo.jpg", "publishedAt": "2020-01-03T23:46:50Z", "content": "Basically, we now recommend using the same kind of interventions that are used to address the opioid crisis to address the benzodiazepine overprescribing crisis, Dr. Lembke said. Dr. Ashton was the vanguard of that change.\r\nChrystal Heather Champion was born … [+1750 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sarah Maslin Nir and Jeffrey E. Singer", "title": "They Once Were Attacked for Their Cash. Now It’s Their E-Bikes.", "description": "Food deliverers in New York City are facing a crime wave: Since September, at least 24 e-bikes have been reported stolen.", "url": "https://www.nytimes.com/2020/01/03/nyregion/stolen-ebikes-food-delivery.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/nyregion/04ebikes-print2/00ebikes-facebookJumbo.jpg", "publishedAt": "2020-01-03T23:37:15Z", "content": "Of those, 59 percent said they never reported the theft to the police, Professor Lee said. They would often say, When I have done it in the past, nothing ever happened, so why bother?\r\n According to workers and advocates, some delivery workers mistakenly conf… [+990 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "Trump Administration Officials to Talk Tech Policy at Las Vegas Confab - The New York Times", "description": "Trump Administration Officials to Talk Tech Policy at Las Vegas Confab The New York Times Tech Tent - tech trends for 2020 BBC News CES 2020: What Major Trends Will Emerge At The Big Tech Show? Investor's Business Daily CES 2020: The business tech news you ne…", "url": "https://www.nytimes.com/reuters/2020/01/03/technology/03reuters-tech-ces-washington.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2020-01-03T23:16:00Z", "content": "WASHINGTON The Trump administration will send a big contingent of senior officials to an annual technology gathering in Las Vegas next week as the tech industry faces increased scrutiny in Washington.\r\nTransportation Secretary Elaine Chao, Commerce Secretary … [+1028 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Vivian Yee and Hwaida Saad", "title": "Carlos Ghosn, at Home but Waiting for the Next Move", "description": "The fugitive from Japan has put Lebanon in an awkward position.", "url": "https://www.nytimes.com/2020/01/03/business/carlos-ghosn-lebanon.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/business/03jpghosn-beirut-print/03ghosn-beirut-1-facebookJumbo.jpg", "publishedAt": "2020-01-03T23:02:37Z", "content": "Mr. Ghosn has promised to talk to the media and defend himself publicly next week.\r\nYoull see he will not be cornered. He has an answer to everything, said Ricardo Karam, a Lebanese television host who has interviewed Mr. Ghosn several times and considers him… [+1269 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Remy Tumin and Marcus Payadue", "title": "Iraq, Methodist Church, Oscars: Your Friday Evening Briefing", "description": "Here’s what you need to know at the end of the day.", "url": "https://www.nytimes.com/2020/01/03/briefing/qassem-soleimani-methodist-church-oscars.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/briefing/c03Pmbriefing-us-promo/03Pmbriefing-us-ss-slide-8T0L-facebookJumbo-v2.jpg", "publishedAt": "2020-01-03T22:53:51Z", "content": "8. And the 2020 Oscar nominees should be \r\nOur film critics Manohla Dargis and A.O. Scott shared their lists of Oscar-worthy performances, and while their picks share similar titles like Little Women, The Irishman and Us for best picture, theyre far from iden… [+392 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nancy Coleman", "title": "Curtain Goes Down on New York Musical Festival", "description": "Faced with staff resignations and significant debt, the organization declared bankruptcy after 15 years.", "url": "https://www.nytimes.com/2020/01/03/theater/new-york-musical-festival-ending.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/arts/03nymf/03nymf-facebookJumbo.jpg", "publishedAt": "2020-01-03T22:19:52Z", "content": "Its success as a launching pad had flagged in recent years, however. (Though the musical Emojiland, which played the 2018 festival, is about to begin previews for a commercial Off Broadway run.) And financial problems were growing: The festivals most recent t… [+1124 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Lisa Friedman", "title": "Trump Rule Would Exclude Climate Change in Infrastructure Planning", "description": "The  administration will propose that federal agencies be allowed to disregard climate change when  assessing the environmental effects of  major  projects.", "url": "https://www.nytimes.com/2020/01/03/climate/trump-nepa-climate-change.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/climate/04CLI-CLIMATEPLANNING1/04CLI-CLIMATEPLANNING1-facebookJumbo.jpg", "publishedAt": "2020-01-03T22:15:48Z", "content": "A state analysis concluded that the terminal would allow 22 million more tons of carbon dioxide emissions into the atmosphere over its projected 20-year life span. Mr. Bridges said he wanted strong environmental laws, but ones that take the local economy into… [+1792 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "The New York Times", "title": "How Have Australia’s Wildfires Affected You?", "description": "Fires continue to rage in southeast Australia. If you’re safe, we would like to hear from residents and tourists and see your photos or videos.", "url": "https://www.nytimes.com/2020/01/03/reader-center/australia-wildfires-evacuation.html", "urlToImage": "https://static01.nyt.com/images/2020/01/04/world/04readers-australia-fires2/04readers-australia-fires2-facebookJumbo.jpg", "publishedAt": "2020-01-03T21:52:32Z", "content": "As wildfires continue to devastate southeast Australia, thousands of residents and tourists have evacuated. The fires, fed by strong winds and triple-digit temperatures, have killed at least 18 people and destroyed more than 1,000 homes and millions of acres … [+424 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Emily Cochrane", "title": "Phil Roe, Tennessee Republican, Announces Retirement from Congress - The New York Times", "description": "Phil Roe, Tennessee Republican, Announces Retirement from Congress The New York Times Tennessee Rep. Phil Roe says he'll retire at end of year CNN GOP Rep. Phil Roe won't seek reelection | TheHill The Hill Tennessee Rep. Phil Roe announces retirement at end o…", "url": "https://www.nytimes.com/2020/01/03/us/politics/phil-roe-retirement-congress.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/us/politics/03dc-roe/03dc-roe-facebookJumbo.jpg", "publishedAt": "2020-01-03T21:33:00Z", "content": "Mr. Roes district, which Mr. Trump won by 57 points in 2016, is expected to remain firmly in Republican control. \r\nIn his statement, Mr. Roe cited the V.A. Mission Act, an overhaul of veterans health care, as one of his signature accomplishments in Congress, … [+833 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Fears of War After Killing of Iranian General", "description": "Readers worry that President Trump’s action was taken to distract from his domestic woes and without a clear path forward.", "url": "https://www.nytimes.com/2020/01/03/opinion/letters/iran-united-states-conflict.html", "urlToImage": "https://static01.nyt.com/images/2020/02/02/us/02iraq-airport-sub2/02iraq-airport-sub2-facebookJumbo-v2.jpg", "publishedAt": "2020-01-03T21:18:38Z", "content": "To the Editor:\r\nRe U.S. Strike in Iraq Kills Commander of Iranian Force (front page, Jan. 3):\r\nIs it any surprise that, as the case for President Trumps removal from office grows stronger, the headlines announce presidential actions that essentially represent… [+704 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nadja Popovich", "title": "Millions of Australians Are Choking on Smoke From Wildfires - The New York Times", "description": "Millions of Australians Are Choking on Smoke From Wildfires The New York Times Australia's wildfires are still raging. Here's what you need to know. Washington Post Why Cal Fire isn’t yet sending firefighters as Australia battles historic wildfires Sacramento…", "url": "https://www.nytimes.com/interactive/2020/01/03/climate/australia-fires-air.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/climate/03cli-ausfires/03cli-ausfires-facebookJumbo.jpg", "publishedAt": "2020-01-03T21:16:00Z", "content": "Away from the flames, millions of Australians are breathing unhealthy air this summer as smoke from the countrys disastrous wildfires clouds skies from Sydney to Canberra to Melbourne.\r\nAustralias capital, Canberra, has been blanketed by a thick haze of smoke… [+4648 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Timothy Egan", "title": "Guest Commentary: The case for a one-term Joe", "description": "A one-term president is certainly not powerless. Free from overreacting to the swings of daily tracking polls, the lame duck can fly to great heights.", "url": "http://www.nytimes.com/2020/01/03/opinion/joe-biden-age.html", "urlToImage": "https://www.denverpost.com/wp-content/uploads/2019/08/APTOPIX_Election_2020_Joe_Biden_98499.jpg?w=1024&h=719", "publishedAt": "2020-01-03T21:12:34Z", "content": "You may have heard an old crank in a big house ranting about appliances and unflushable toilets the other day. Remember the dishwasher, youd press it, boom — thered be like an explosion, he said, apropos of nothing. Now you press it 12 times.\r\nThe bathroom is… [+5190 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "Amy Klobuchar’s ‘Doggedness and Diligence’", "description": "A Des Moines reader notes, “As the field winnows, she is still standing.” Also: Better pay for household help; dealing with hearing loss.", "url": "https://www.nytimes.com/2020/01/03/opinion/letters/klobuchar-presidency.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/us/03Klobuchar-money/merlin_166208985_29661b81-d222-4f57-8cea-e724ef7732d7-facebookJumbo.jpg", "publishedAt": "2020-01-03T21:10:40Z", "content": "To the Editor:\r\nRe Amy Klobuchar Raised $11.4 Million in Fourth Quarter, Her Campaign Says (nytimes.com, Jan. 3):\r\nLast fall my brother and sister-in-law hosted an event for Amy Klobuchar. It overflowed their small home. \r\nPeople left impressed, though not ev… [+673 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Victor Mather", "title": "After Year of Uncertainty, Cowboys’ Jason Garrett Seems Out of Time - The New York Times", "description": "After Year of Uncertainty, Cowboys’ Jason Garrett Seems Out of Time The New York Times Cowboys part ways with Jason Garrett after disappointing season | SportsCenter ESPN Jason Garrett wasn't the guy to stand up to Jerry Jones, and that's what the Cowboys nee…", "url": "https://www.nytimes.com/2020/01/03/sports/football/cowboys-jason-garrett-fired.html", "urlToImage": "https://static01.nyt.com/images/2020/01/02/sports/00garrett/merlin_166478490_8b42299d-d16d-48c7-89f0-62010acf7c83-facebookJumbo.jpg", "publishedAt": "2020-01-03T21:03:00Z", "content": "The Cowboys were not able to keep it up, losing three straight: two reasonable losses to the Saints and Packers followed by a shocking defeat against a winless Jets team. \r\nDespite the Jets debacle, Jerry Jones had good things to say about Garrett in the afte… [+1716 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Sarah Mervosh", "title": "Will There Be a Draft? After Iran Strike, Fears of World War III", "description": "For decades, American men over the age of 18 have gone through the ritual of registering with the government in case of a military draft. In recent years, that ritual has felt like routine paperwork, a simple checking of the box. But Friday, after a United St…", "url": "https://www.nytimes.com/2020/01/03/us/military-draft-world-war-3.html", "urlToImage": "https://static.seattletimes.com/wp-content/uploads/2020/01/088afa29-b09e-481e-aa1c-31eb1b1712ba-1200x630.jpg", "publishedAt": "2020-01-03T21:00:56Z", "content": "For decades, American men over the age of 18 have gone through the ritual of registering with the government in case of a military draft. In recent years, that ritual has felt like routine paperwork, a simple checking of the box.\r\nBut Friday, after a United S… [+3552 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Stephanie Goodman", "title": "How to Watch the Golden Globes on Sunday", "description": "Here’s a quick guide with everything you need to know for the Hollywood Foreign Press Association film and television awards.", "url": "https://www.nytimes.com/2020/01/03/movies/golden-globes-2020-date.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/arts/03globes-info1/merlin_166610691_bf4e54c2-fdf0-4b4f-964e-a6c6a5977f8a-facebookJumbo.jpg", "publishedAt": "2020-01-03T20:50:11Z", "content": "The 77th annual Golden Globes will be handed out Sunday at the Beverly Hilton in Beverly Hills. With Ricky Gervais returning for a fifth time as the host and the awards general reputation for being unpredictable, it should be an interesting night. Heres how t… [+761 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Josh Katz, Kevin Quealy", "title": "The New York Times Asked You To Name These Athletes, Politicians And Celebrities. Here's How You Did", "description": "No, not THAT Justin. What facial recognition tells us about how memory works (or doesn't).", "url": "https://www.nytimes.com/interactive/2020/01/03/upshot/who-do-you-recognize-quiz-results.html", "urlToImage": "https://static01.nyt.com/images/2019/12/31/upshot/who-do-you-recognize-quiz-results-1578009708624/who-do-you-recognize-quiz-results-1578009708624-facebookJumbo.png", "publishedAt": "2020-01-03T20:42:22Z", "content": "The Upshot recently published a quiz that asked readers to identify up to 52 politicians, athletes and celebrities. (If you havent taken it yet, we encourage you to do so now.)\r\nHundreds of thousands of readers took the quiz, submitting millions of guesses. T… [+4447 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Nicholas Fandos", "title": "Impeachment Impasse Deepens in Senate, Leaving Trump’s Trial in Doubt - The New York Times", "description": "On the first day of a new legislative session, Senate leaders indicated they had made no progress in resolving their logjam over how to proceed.", "url": "https://www.nytimes.com/2020/01/03/us/politics/trump-impeachment-senate-trial.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/us/politics/03dc-impeach1-sub/03dc-impeach1-sub-facebookJumbo.jpg", "publishedAt": "2020-01-03T20:40:00Z", "content": "In his floor speech on Friday, Mr. McConnell emphatically rejected that strategy. He denounced Democrats in both the House and Senate for degrading the impeachment process with what he called a historically weak case. Calling additional witnesses during a Sen… [+1897 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Margot Sanger-Katz", "title": "Why Democrats Want the Supreme Court to Act Quickly on a Case That Could End Obamacare", "description": "Seeking a verdict before the election, they seem to want to keep the issue in the public eye, which may help them politically.", "url": "https://www.nytimes.com/2020/01/03/upshot/democrats-obamacare-supreme-court.html", "urlToImage": "https://static01.nyt.com/images/2020/01/03/upshot/03up-aca/merlin_156945948_b7fe7330-f131-4b74-84de-2bba4bd5cd2d-facebookJumbo.jpg", "publishedAt": "2020-01-03T20:23:05Z", "content": "The case was originally brought by a group of Republican state officials, who argued that changes to the Affordable Care Act made by Congress in 2017 rendered the laws requirement that most Americans obtain health insurance unconstitutional. The Trump adminis… [+1804 chars]"}]}