{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Fatima Faizi and Thomas Gibbons-Neff", "title": "For Women in Kabul, ‘It Is Just Me and the Water’", "description": "Since 2001, 23 public and private pools have appeared in Kabul, but only two allow women. They’re a welcome refuge from suicide bombings and the threat of a Taliban takeover.", "url": "https://www.nytimes.com/2019/12/22/world/asia/afghanistan-kabul-women-swimming.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/world/22afghan-swimming-dispatch1/00afghan-swimming-dispatch1-facebookJumbo.jpg", "publishedAt": "2019-12-22T07:32:05Z", "content": "KABUL, Afghanistan When Fatema Saeedi is in the pool, she cannot hear the crowded, chaotic noise of the city around her. She does not think about suicide bombings or Taliban attacks. She concentrates on her breathing as she moves through the water. One hand i… [+658 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mujib Mashal", "title": "Afghan President Declared in Lead of Disputed Vote as Opposition Protests", "description": "Initial results of the September elections, which had been delayed, show President Ashraf Ghani leading with 50.64 percent of the vote.", "url": "https://www.nytimes.com/2019/12/22/world/asia/afghanistan-election-ghani.html", "urlToImage": "https://static01.nyt.com/images/2019/12/13/world/13afghanistan/13afghanistan-facebookJumbo.jpg", "publishedAt": "2019-12-22T07:17:38Z", "content": "No results, whether preliminary or initial or final, that is filled with fraud we will not accept it, Mr. Abdullah said recently. No one should dream of ruling again with fraudulent votes, like 2014.\r\nA similar election dispute between Mr. Abdullah and Mr. Gh… [+1391 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Reuters", "title": "The Best Year Financial Markets Have Ever Had?", "description": "For all the angst about trade wars, geopolitics and a sputtering and overly indebted global economy, 2019 might just be the best year investors have ever had.", "url": "https://www.nytimes.com/reuters/2019/12/22/business/22reuters-global-markets-2019-graphic.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-22T06:55:09Z", "content": "U.S. Treasuries, the world's benchmark government IOU, have made a whopping 9.4 percent after yields plunged as much as 120 basis points. That followed a near 40 basis point fall the last quarter of 2018, after five quarters in which they had consistently ris… [+1317 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": null, "title": "A rare place in Afghanistan where women feel free to exhale", "description": "When Fatema Saeedi is in the pool, she cannot hear the crowded, chaotic noise of the city around her. She does not think about suicide bombings or Taliban attacks. She concentrates on her breathing as she moves through the water. One hand in front of the othe…", "url": "https://www.nytimes.com/2019/12/20/world/asia/afghanistan-kabul-women-swimming.html", "urlToImage": "https://d30fl32nd2baj9.cloudfront.net/media/2019/12/22/afghan-swimming-221219-01.jpg/ALTERNATES/w640/afghan-swimming-221219-01.jpg", "publishedAt": "2019-12-22T06:48:02Z", "content": "For Saeedi, 26, the swimming pool is a refuge. The clean water, the walls and the women around her all sealed off from the male patrons nearby are a welcome respite from Kabul, Afghanistans capital.\r\nThough the city has become markedly more politically progre… [+5284 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Charlie Warzel, Stuart A. Thompson", "title": "How Your Phone Betrays Democracy", "description": "You protest, they watch.", "url": "https://www.nytimes.com/interactive/2019/12/21/opinion/location-data-democracy-protests.html", "urlToImage": "https://static01.nyt.com/images/2019/12/16/opinion/16tracked-protests-1576194568098/16tracked-protests-1576194568098-facebookJumbo.jpg", "publishedAt": "2019-12-22T06:31:35Z", "content": "Protesters in Hong Kong hold their phones to the sky. Video courtesy of Phoebe Kong\r\nIn footage from drones hovering above, the nighttime streets of Hong Kong look almost incandescent, a constellation of tens of thousands of cellphone flashlights, swaying in … [+13976 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "drewcaldwell", "title": "Letter to the Editor: Historians Critique The 1619 Project, and We Respond - The New York Times", "description": "The letter below will be published in the Dec. 29 issue of The New York Times Magazine. We write as historians to express our strong reservations about important aspects of The 1619 Project. via Pocket", "url": "https://www.nytimes.com/2019/12/20/magazine/letter-to-the-editor-historians-critique-the-1619-project-and-we-respond.html", "urlToImage": "https://static01.nyt.com/newsgraphics/images/icons/defaultPromoCrop.png", "publishedAt": "2019-12-22T05:47:01Z", "content": "The work of various historians, among them David Waldstreicher and Alfred W. and Ruth G. Blumrosen, supports the contention that uneasiness among slaveholders in the colonies about growing antislavery sentiment in Britain and increasing imperial regulation he… [+5936 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Michael Schwirtz", "title": "How a Poisoning in Bulgaria Exposed Russian Assassins in Europe", "description": "For years, members of a secret team, Unit 29155, operated without Western security officials having any idea about their activities. But an attack on an arms dealer in Sofia helped blow their cover.", "url": "https://www.nytimes.com/2019/12/22/world/europe/bulgaria-russia-assassination-squad.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/world/22bulgaria1/22bulgaria1-facebookJumbo.jpg", "publishedAt": "2019-12-22T05:01:12Z", "content": "The poison took effect slowly. \r\nMr. Gebrev first realized something was wrong on the evening of April 27, 2015, when his right eye suddenly turned as red as the red on the Russian flag. It felt, he said, as if someone had dumped a bucket of sand into his pup… [+1086 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Mélissa Godin", "title": "In France, Holiday Skating Rinks Are an Unlikely Climate Battleground", "description": "The attractions have prompted environmental concerns, and some cities have canceled them, citing the size of the carbon footprint needed to maintain the sites.", "url": "https://www.nytimes.com/2019/12/22/world/europe/france-christmas-rinks.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/world/22France-Xmas-Skating/France-icerinks1-facebookJumbo.jpg", "publishedAt": "2019-12-22T05:01:11Z", "content": "In St.-Malo, Damien Chalmet, 34, was skating with his 5-year-old son. \r\nI think before canceling the skating rink, we should deal with cars in cities and gasoline-powered buses, he said. Skating rinks, he added, are part of tradition and the magic of Christma… [+584 chars]"}, {"source": {"id": "the-new-york-times", "name": "The New York Times"}, "author": "Kenneth Chang", "title": "Boeing Starliner Landing: What You Need to Know", "description": "The new ride to orbit built for NASA is returning to Earth early after problems during its first trip to space on Friday.", "url": "https://www.nytimes.com/2019/12/22/science/boeing-starliner-landing.html", "urlToImage": "https://static01.nyt.com/images/2019/12/22/science/22starliner1/22starliner1-facebookJumbo.jpg", "publishedAt": "2019-12-22T05:00:07Z", "content": "For NASA, attempting to put a capsule down on land is unusual. All previous landings of its capsules the Mercury, Gemini and Apollo programs of the 1960s and 1970s were in the ocean. After all, you might be safer diving into water than an expanse of sand.\r\nRu… [+951 chars]"}]}