{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Falcons' Mularkey retiring, Joe Whitt to coach secondary", "description": "FLOWERY BRANCH, Ga. (AP) — Atlanta Falcons tight end coach Mike Mularkey, the former Tennessee Titans coach, is retiring.", "url": "https://apnews.com/65e0938b0bc1bf9b952e4f46f4873fde", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-09T20:11:02Z", "content": "FLOWERY BRANCH, Ga. (AP) Atlanta Falcons tight end coach Mike Mularkey, the former Tennessee Titans coach, is retiring.\r\nMularkey's retirement came after he returned for his second stint in Atlanta, lasting only one season, to cap 25 years of coaching. He als… [+964 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By RON HARRIS Associated Press", "title": "ML King Day activities to emphasize voters and nonviolence", "description": "ATLANTA (AP) — As the nation prepares for the Martin Luther King Jr. national holiday amid a “dire” election year, the Atlanta center named for him will offer nonviolence training, voter registration and visits from politicians, entertainers and sports figure…", "url": "https://apnews.com/8c689b1857912bcd26a94949ccbe679e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/8/58/85899a81-9bba-5aab-9813-b727e8e74dcd/5e178dd1692aa.image.jpg?crop=1778%2C1000%2C0%2C82&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T20:07:38Z", "content": "ATLANTA (AP) As the nation prepares for the Martin Luther King Jr. national holiday amid a dire election year, the Atlanta center named for him will offer nonviolence training, voter registration and visits from politicians, entertainers and sports figures, K… [+1704 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Mexico's Popocatepetl volcano spews ash, glowing rock", "description": "MEXICO CITY (AP) — An explosion at the crater of Mexico's Popocatepetl volcano hurled incandescent rock about a mile (1.6 kilometers) down its slopes Thursday.", "url": "https://apnews.com/988fa7b5beeb9d0fe1b3374e4598863a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:05:40Z", "content": "MEXICO CITY (AP) An explosion at the crater of Mexico's Popocatepetl volcano hurled incandescent rock about a mile (1.6 kilometers) down its slopes Thursday.\r\nThe blast early also sent a column of ash 2 miles (3 kilometers) into the sky near the nation's capi… [+488 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Mississippi House passes bill to cover gap in teacher raise", "description": "JACKSON, Miss. (AP) — The Mississippi House voted Thursday to pay the full cost for this year's teacher pay raise.", "url": "https://apnews.com/f826a0bb44a5978fc3e519ce351eaf24", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:04:44Z", "content": "JACKSON, Miss. (AP) The Mississippi House voted Thursday to pay the full cost for this year's teacher pay raise.\r\nThe $1,500-per-person raise was approved during the 2019 session. But, officials later discovered a bureaucratic error that resulted in too few t… [+501 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Rhode Island Senate president pushes for plastic bag ban", "description": "PROVIDENCE, R.I. (AP) — Rhode Island's Senate president said Thursday that he has introduced a bill to ban single-use plastic bags at checkout counters statewide.", "url": "https://apnews.com/7058fd3b7ab9530b972c71e8739890a0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:04:36Z", "content": "PROVIDENCE, R.I. (AP) Rhode Island's Senate president said Thursday that he has introduced a bill to ban single-use plastic bags at checkout counters statewide.\r\nDemocratic Senate President Dominick Ruggerio, of North Providence, said plastic pollution is dan… [+1145 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By SAMYA KULLAB and QASSEM ABDUL-ZAHRA Associated Press", "title": "Iraqis from top brass to street decry breach of sovereignty", "description": "BEIRUT (AP) — In the span of weeks, Iraqis watched with deepening anxiety as their country, long the site of proxy fighting between Iran-backed militias and U.S. forces, has turned into an open battlefield.", "url": "https://apnews.com/a83bcfc82cc6c2c080e73ecddcd1b849", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/1/4d/14d928e0-dbca-5b12-9979-9c9c06da35c6/5e178dd722b21.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T20:02:42Z", "content": "BEIRUT (AP) In the span of weeks, Iraqis watched with deepening anxiety as their country, long the site of proxy fighting between Iran-backed militias and U.S. forces, has turned into an open battlefield.\r\nThe tit-for-tat violence was set off when a rocket at… [+5559 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Donald Glover's 'Atlanta' set for two more seasons in 2021", "description": "PASADENA, Calif. (AP) — Donald Glover’s “Atlanta” is returning with new episodes, but not for another year.", "url": "https://apnews.com/11f250666ede67b9ac01e10d1994a8b1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/c/ca/ccad4ffc-a0fe-5c58-9b14-739d9a5cdb6b/5e1786ea082ab.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T20:00:38Z", "content": "PASADENA, Calif. (AP) Donald Glovers Atlanta is returning with new episodes, but not for another year.\r\nFX Networks Chairman John Landgraf said Thursday that star and creator Glover is making a total of 18 new episodes. Ten of them will air in January 2021, w… [+902 chars]"}]}