{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "\"Prozac Nation\" author Elizabeth Wurtzel dies at age 52", "description": "NEW YORK (AP) — Elizabeth Wurtzel, whose blunt and painful confessions of her struggles with addiction and depression in the best-selling “Prozac Nation” made her a voice and a target for an anxious generation, died Tuesday at age 52.", "url": "https://apnews.com/3bc202902e8baa8b479d39acbee38102", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T19:57:21Z", "content": "NEW YORK (AP) Elizabeth Wurtzel, whose blunt and painful confessions of her struggles with addiction and depression in the best-selling Prozac Nation made her a voice and a target for an anxious generation, died Tuesday at age 52.\r\nWurtzel's husband, Jim Free… [+2529 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By CHRISTOPHER SHERMAN and COLLEEN LONG Associated Press", "title": "Mexico upset by US plan to send Mexicans to Guatemala", "description": "MEXICO CITY (AP) — As the United States moved aggressively over the past year to sharply reduce the number of asylum seekers arriving at its southwest border, Mexicans were spared. But now Mexico is expressing its displeasure at U.S. plans…", "url": "https://apnews.com/10155c2416e21268926fc829b4450e8f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T19:57:19Z", "content": "MEXICO CITY (AP) As the United States moved aggressively over the past year to sharply reduce the number of asylum seekers arriving at its southwest border, Mexicans were spared. But now Mexico is expressing its displeasure at U.S. plans to send Mexican asylu… [+5416 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-doctor enters plea deal in attempted murder, drug deals", "description": "TUCSON, Ariz. (AP) — A former doctor has reached a plea agreement after illegally dealing OxyContin and plotting to kill a woman he suspected of reporting him to the state medical board.", "url": "https://apnews.com/51e31d885837928f471b82eff642f3c7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:56:49Z", "content": "TUCSON, Ariz. (AP) A former doctor has reached a plea agreement after illegally dealing OxyContin and plotting to kill a woman he suspected of reporting him to the state medical board.\r\nThe Arizona attorney general's office announced the Dec. 16 plea agreemen… [+1828 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Commission recommends raises for governor, judges, lawmakers", "description": "AUGUSTA, Maine (AP) — A Maine commission has recommended increasing the compensation for the governor, lawmakers and judges.", "url": "https://apnews.com/b47f8a04218a23938e4ccc3c6c417139", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T19:48:58Z", "content": "AUGUSTA, Maine (AP) A Maine commission has recommended increasing the compensation for the governor, lawmakers and judges.\r\nIn a report approved Monday, the State Compensation Commission said the governor's salary was \"embarrassingly low, suggesting a disresp… [+1570 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MINA CORPUZ Brockton Enterprise", "title": "Visually impaired man finds ‘different path’ as an engineer", "description": "EASTON, Mass. (AP) — Jack Duffy-Protentis is less than a year away from graduating and starting a career as an engineer, a field that he enjoys because it allows him to work with his hands.", "url": "https://apnews.com/035b9de0cf2be4af45e6139451ed81a2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:47:23Z", "content": "EASTON, Mass. (AP) Jack Duffy-Protentis is less than a year away from graduating and starting a career as an engineer, a field that he enjoys because it allows him to work with his hands.\r\nIn addition to being a college student and learning concepts from chem… [+4978 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Remains found in Wisconsin in '82 ID'ed as Minnesota man", "description": "BARRON, Wis. (AP) — Remains found in western Wisconsin in 1982 have been identified as those of a Minnesota man, authorities said Tuesday.", "url": "https://apnews.com/9d224b2bffdb48bd0108d575e62e0f60", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:46:45Z", "content": "BARRON, Wis. (AP) Remains found in western Wisconsin in 1982 have been identified as those of a Minnesota man, authorities said Tuesday.\r\nThe Barron County Sheriff's Department said the remains are those of Kraig King from White Bear Lake, a suburb of St. Pau… [+819 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By GRAHAM DUNBAR AP Sports Writer", "title": "Court date set for UAE appeal against Qatar's Asian Cup win", "description": "GENEVA (AP) — A legal challenge by the United Arab Emirates soccer federation that threatens Qatar’s 2019 Asian Cup title will be heard at sport’s highest court.", "url": "https://apnews.com/231fc196b2bc19fe485f501e005ce346", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-07T19:46:41Z", "content": "GENEVA (AP) A legal challenge by the United Arab Emirates soccer federation that threatens Qatars 2019 Asian Cup title will be heard at sports highest court.\r\nThe Court of Arbitration for Sport said Tuesday it will hear the UAE's appeal on March 12 in a case … [+1018 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JIM MUSTIAN and ALAN SUDERMAN Associated Press", "title": "Trump donor charged with obstructing inauguration inquiry", "description": "NEW YORK (AP) — Federal prosecutors on Tuesday charged a major donor to President Donald Trump’s inaugural committee with obstructing a federal investigation into whether foreign nationals unlawfully contributed to the inaugural celebrations.", "url": "https://apnews.com/0310f2dc07b1b047e86301042db6bd7c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T19:46:13Z", "content": "NEW YORK (AP) Federal prosecutors on Tuesday charged a major donor to President Donald Trumps inaugural committee with obstructing a federal investigation into whether foreign nationals unlawfully contributed to the inaugural celebrations.\r\nThe donor, Imaad Z… [+2061 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "19-year-old charged in killing during marijuana deal", "description": "KANSAS CITY, Mo. (AP) — A teenager is charged with second-degree murder in the fatal shooting of a man during a marijuana deal that was allegedly arranged over Snapchat.", "url": "https://apnews.com/325056e468f337da265efffa26b22bcf", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:44:32Z", "content": "KANSAS CITY, Mo. (AP) A teenager is charged with second-degree murder in the fatal shooting of a man during a marijuana deal that was allegedly arranged over Snapchat.\r\nThe Jackson County prosecutor's office on Tuesday announced charges against 19-year-old Jo… [+963 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "KRISTA LARSON Associated Press", "title": "WHO: Death toll from measles outbreak in Congo hits 6,000", "description": "DAKAR, Senegal (AP) — The death toll from a measles epidemic in Congo has surpassed 6,000, the World Health Organization said Tuesday as it warned that more funds are needed to save lives during the world's worst outbreak of the…", "url": "https://apnews.com/29e06f31c05690b1f5af167c54123050", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T19:41:02Z", "content": "DAKAR, Senegal (AP) The death toll from a measles epidemic in Congo has surpassed 6,000, the World Health Organization said Tuesday as it warned that more funds are needed to save lives during the world's worst outbreak of the infectious disease.\r\nMeasles has… [+1250 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "House speaker could be called to testify in ex-aide's trial", "description": "PROVIDENCE, R.I. (AP) — Rhode Island's House speaker could be called as a witness if one of his former campaign aides goes on trial in a money laundering case.", "url": "https://apnews.com/7429ca28c1d1307e714c3f9e7848eebb", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:39:49Z", "content": "PROVIDENCE, R.I. (AP) Rhode Island's House speaker could be called as a witness if one of his former campaign aides goes on trial in a money laundering case.\r\nThe aide, Jeff Britt, pleaded not guilty in November to charges of money laundering and making a pro… [+1080 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Sheriff: 1 dead, 2 injured in car chase", "description": "NEW ORLEANS (AP) — One person was killed and two others were injured in a crash while fleeing from authorities in a stolen car, according to Louisiana deputies.", "url": "https://apnews.com/10dc139a9bb3caa6ce55f9722c63c1c7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:38:27Z", "content": "NEW ORLEANS (AP) One person was killed and two others were injured in a crash while fleeing from authorities in a stolen car, according to Louisiana deputies.\r\nEarly Monday morning, license plate readers captured the plate of a stolen vehicle and alerted the … [+875 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Connecticut man who threatened Trump, others, pleads guilty", "description": "BRIDGEPORT, Conn. (AP) — A Connecticut man who threatened to kill President Donald Trump, sent letters containing a white powder to several people and organizations, and threatened to set off a series of explosions has pleaded guilty, federal prosecutors said.", "url": "https://apnews.com/a8216b8e55048b7bcf71f2a50eef0989", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:37:27Z", "content": "BRIDGEPORT, Conn. (AP) A Connecticut man who threatened to kill President Donald Trump, sent letters containing a white powder to several people and organizations, and threatened to set off a series of explosions has pleaded guilty, federal prosecutors said.\r… [+1038 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MARCELO DE SOUSA and DAVID BILLER Associated Press", "title": "Brazil says Iran summoned its chargé d'affaires after note", "description": "RIO DE JANEIRO (AP) — Iran's foreign ministry summoned Brazil's chargé d'affaires in Tehran following an official Brazilian statement that some experts interpreted as backing the U.S. killing of Iranian general Qassem Soleimani.", "url": "https://apnews.com/cd2d9bb8a50885413cb9388659bcdf97", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/e/a7/ea74c55e-9231-5383-b8f2-3d06f861890d/5e14e0086bdb5.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T19:37:24Z", "content": "RIO DE JANEIRO (AP) Iran's foreign ministry summoned Brazil's chargé d'affaires in Tehran following an official Brazilian statement that some experts interpreted as backing the U.S. killing of Iranian general Qassem Soleimani.\r\nThe conversation with Brazil's … [+3502 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "August trial set for Louisiana man accused of killing 5", "description": "LIVINGSTON, La. (AP) — An August trial date has been set for a man accused of a killing five people in Louisiana last year.", "url": "https://apnews.com/e67e2cdfe0f5a794a4d16ddadfa3b186", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:35:20Z", "content": "LIVINGSTON, La. (AP) An August trial date has been set for a man accused of a killing five people in Louisiana last year.\r\nDakota Theriot, 22, appeared Monday in state district court in Livingston Parish where a judge set trial for Aug. 10. But the trial migh… [+2750 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DAVID GINSBURG AP Sports Writer", "title": "Ravens TE Andrews flourishes as Jackson's favorite target", "description": "OWINGS MILLS, Md. (AP) — The Baltimore Ravens were preparing for the 2018 NFL draft when coach John Harbaugh began studying tape of a pretty good tight end at Oklahoma by the name of Mark Andrews.", "url": "https://apnews.com/f81339aeac9cedb4275a69259f188164", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/0/bd/0bd7cda3-a61d-572c-9c07-707ece35a8f3/5de810a4b220f.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T19:35:02Z", "content": "Andrews is the biggest threat among the receivers, and that's not just because of his 6-foot-5, 256-pound frame.\r\nThe quarterback has a lot of confidence in him,\" Tennessee coach Mike Vrabel said Tuesday. He's got great length, good body control, good hands, … [+1236 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "North Carolina health system restricts visitation due to flu", "description": "GREENVILLE, N.C. (AP) — Vidant Health says it is imposing visitor restrictions at its hospitals in North Carolina in response to a high number of flu cases.", "url": "https://apnews.com/d3edf5d6d1616263c246d5301ab82e79", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:31:43Z", "content": "GREENVILLE, N.C. (AP) Vidant Health says it is imposing visitor restrictions at its hospitals in North Carolina in response to a high number of flu cases.\r\nIn a statement posted on its webpage on Tuesday, Vidant Health says that beginning Thursday, its hospit… [+691 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JACQUELYN VOGHEL Daily Hampshire Gazette", "title": "Unitarian Society offers racial justice class for all ages", "description": "NORTHAMPTON, Mass. (AP) — Racial justice can be a topic that people of any age find challenging to discuss. But at the Unitarian Society of Northampton and Florence, children as young as kindergarteners will begin learning about the tenets of…", "url": "https://apnews.com/21b14e49733ebae0bfd6d758f90de03c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T19:30:41Z", "content": "NORTHAMPTON, Mass. (AP) Racial justice can be a topic that people of any age find challenging to discuss. But at the Unitarian Society of Northampton and Florence, children as young as kindergarteners will begin learning about the tenets of racial justice in … [+4521 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Nationals sign INF Starlin Castro for $12 million, 2 years", "description": "WASHINGTON (AP) — Infielder Starlin Castro finalized a two-year contract with the Washington Nationals on Tuesday, one of a flurry of recent moves by the World Series champions.", "url": "https://apnews.com/92ca3d0385caae68135ca79b9a145d81", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-07T19:30:02Z", "content": "WASHINGTON (AP) Infielder Starlin Castro finalized a two-year contract with the Washington Nationals on Tuesday, one of a flurry of recent moves by the World Series champions.\r\nCastro's deal gives the club someone who can start at second base and maybe also p… [+1151 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ANDREW SELSKY Associated Press", "title": "Man charged with hate crimes in beating of 70-year-old woman", "description": "SALEM, Ore. (AP) — A man was charged with attempted murder and hate crimes after breaking into a motel office and attacking a 70-year-old immigrant from India who owns the business with her husband, also an immigrant, prosecutors said Tuesday.", "url": "https://apnews.com/e1c16921263e90bf80dec6e7f8efcd1a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/c/8c/c8c274d4-18b8-5e09-9c5d-d99304adeeb8/5e14dc4ea722c.image.jpg?crop=1305%2C734%2C0%2C426&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T19:26:09Z", "content": "SALEM, Ore. (AP) A man was charged with attempted murder and hate crimes after breaking into a motel office and attacking a 70-year-old immigrant from India who owns the business with her husband, also an immigrant, prosecutors said Tuesday.\r\nMeena Puri remai… [+1917 chars]"}]}