{"status": "ok", "totalResults": 82, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MELINDA DESLATTE Associated Press", "title": "Vote delay for updated Louisiana college admission standards", "description": "BATON ROUGE, La. (AP) — Louisiana's top higher education board on Thursday postponed decision-making on a strengthening of its minimum admission standards for public colleges that would include new financial penalties for campuses that violate the policy.", "url": "https://apnews.com/cc61d12e3aa5b1cb89c33e80136abb03", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T22:00:45Z", "content": "BATON ROUGE, La. (AP) Louisiana's top higher education board on Thursday postponed decision-making on a strengthening of its minimum admission standards for public colleges that would include new financial penalties for campuses that violate the policy.\r\nComm… [+3228 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By HOLLY RAMER Associated Press", "title": "Report: Oversight of child restraints, seclusion lacking", "description": "CONCORD, N.H. (AP) — Children were restrained or secluded in New Hampshire’s residential treatment facilities more than 20,000 times in five years, according to a state watchdog office’s report released Thursday.", "url": "https://apnews.com/4d25f2da92e632bc0d913348bf3940f4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T22:00:39Z", "content": "CONCORD, N.H. (AP) Children were restrained or secluded in New Hampshires residential treatment facilities more than 20,000 times in five years, according to a state watchdog offices report released Thursday.\r\nThe Office of the Child Advocate issued its repor… [+4128 chars]"}]}