{"status": "ok", "totalResults": 93, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MATT KEMP Associated Press", "title": "'Holy Grail' digital effects rewinding the clock for actors", "description": "LONDON (AP) — With Martin Scorsese’s “The Irishman” expected to battle “Once Upon a Time in… Hollywood” and “1917” for the best picture Oscar in February, all eyes are on the special effects team that made the sprawling crime epic…", "url": "https://apnews.com/43f8ed7e9a753c2191c9af7f4754bd6c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/4/55/4555694d-63be-50ca-8458-0d32f14abcfa/5e19ea90dcc04.image.jpg?crop=1826%2C1027%2C0%2C53&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-11T15:17:47Z", "content": "LONDON (AP) With Martin Scorseses The Irishman expected to battle Once Upon a Time in Hollywood and 1917 for the best picture Oscar in February, all eyes are on the special effects team that made the sprawling crime epic possible.\r\nThe Irishman unfolds over d… [+6401 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Requests for early ballots can be submitted in January", "description": "LINCOLN, Neb. (AP) — Requests for early ballots in Nebraska can be submitted as early as next week, the Nebraska Secretary of State's office reports.", "url": "https://apnews.com/f6abb7e698e6a006b8adc2536b31bafb", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:16:48Z", "content": "LINCOLN, Neb. (AP) Requests for early ballots in Nebraska can be submitted as early as next week, the Nebraska Secretary of State's office reports.\r\nThe office said in a news release that the first day to submit applications for an early ballot at county offi… [+854 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge: ex-lawmaker's judgement has not improved \"one iota\"", "description": "BRENTWOOD, N.H. (AP) — A former New Hampshire lawmaker who served jail time on charges of drug possession and trying to lure a 14-year-old girl over Facebook into a sexual encounter was back in court after he tried to communicate…", "url": "https://apnews.com/92e70167670b10bb9e6087862ed83ce0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:14:39Z", "content": "BRENTWOOD, N.H. (AP) A former New Hampshire lawmaker who served jail time on charges of drug possession and trying to lure a 14-year-old girl over Facebook into a sexual encounter was back in court after he tried to communicate with the girl's friend online.\r… [+1574 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Detroit nonprofit to hold free programs on cybersecurity", "description": "DETROIT (AP) — A Detroit-based nonprofit focused on technology education and workforce development training will present two free events about cybersecurity.", "url": "https://apnews.com/e6dabc8cb8c274b4024dbb312e09b093", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:14:10Z", "content": "DETROIT (AP) A Detroit-based nonprofit focused on technology education and workforce development training will present two free events about cybersecurity.\r\nThe drama Blackhat will be shown Saturday afternoon at the Wilder library branch and Monday at the Red… [+1226 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BARRY CARTER NJ Advance Media for NJ.com", "title": "112-year-old bottled message connects families with the past", "description": "MONTCLAIR, N.J. (AP) — The basement walls from College Hall, an original building of Montclair State University, had to be taken out in sections.", "url": "https://apnews.com/f1a974f852e7911e6b72bce81446421b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:13:31Z", "content": "MONTCLAIR, N.J. (AP) The basement walls from College Hall, an original building of Montclair State University, had to be taken out in sections.\r\nLaborers could only do that last spring by chipping away at certain areas of brick to loosen up the walls for remo… [+4571 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man who set divorcing parents' home on fire avoids prison", "description": "HARTFORD, Conn. (AP) — A man who burned down his parents' Connecticut home as they battled in a bitter divorce case has avoided prison time in a plea deal that upset his father.", "url": "https://apnews.com/c10ead91d8b709349f38cfaeba8c1a9a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:11:57Z", "content": "HARTFORD, Conn. (AP) A man who burned down his parents' Connecticut home as they battled in a bitter divorce case has avoided prison time in a plea deal that upset his father.\r\nBrian Comeau, 29, was sentenced to five years of probation by Hartford Superior Co… [+984 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Claim by advocates seeking to stop wolf shooting dismissed", "description": "SEATTLE (AP) — Wolf advocates seeking to halt the Washington Department Fish and Wildlife from shooting wolves to protect livestock have suffered another legal setback.", "url": "https://apnews.com/5edb5e51172c7bba8d5d218f6b55429b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:10:37Z", "content": "SEATTLE (AP) Wolf advocates seeking to halt the Washington Department Fish and Wildlife from shooting wolves to protect livestock have suffered another legal setback.\r\nThe Capital Press reports King County Superior Court Judge John McHale on Friday dismissed … [+1158 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Fund created to support public education in Rhode Island", "description": "PROVIDENCE, R.I. (AP) — A fund has been created to accept donations to support public education in Rhode Island.", "url": "https://apnews.com/15a0dcc1bb7c6337485d76f98f87f1a1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:06:16Z", "content": "PROVIDENCE, R.I. (AP) A fund has been created to accept donations to support public education in Rhode Island.\r\nEducation Commissioner Angélica Infante-Green announced Friday that the nonprofit Rhode Island Foundation established the Fund for Rhode Island Pub… [+1247 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "NY bans use of toxic chemical in firefighting foam", "description": "ALBANY, N.Y. (AP) — New York plans to restrict the use of firefighting foam that contains certain chemicals that have the potential to contaminate groundwater.", "url": "https://apnews.com/cf0c06311e6e5626b725546969b6c0a0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:03:27Z", "content": "ALBANY, N.Y. (AP) New York plans to restrict the use of firefighting foam that contains certain chemicals that have the potential to contaminate groundwater.\r\nFirefighting foam can contain polyfluoroalkyl substances, or PFAS, which are man-made chemicals that… [+1074 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BRINLEY HINEMAN, Daily News Journal", "title": "Man arrested over probation fees struggles to start over", "description": "MURFRESSBORO, Tenn. (AP) — For the last decade, Marques Martin has been in and out of jail.", "url": "https://apnews.com/f59655e2aebcba51825b0f781c169a29", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/2/30/23048fca-0421-53d2-a39e-d96725f40c4a/5e19ea9233eec.image.jpg?crop=1778%2C1000%2C0%2C82&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-11T15:02:56Z", "content": "MURFRESSBORO, Tenn. (AP) For the last decade, Marques Martin has been in and out of jail.\r\nHis crime? Not being able to afford costly fees while on probation with PCC, a contracted service Rutherford County used until a 2015 federal lawsuit accused the county… [+3335 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Three dead in Louisiana as severe storm sweeps southern US", "description": "BENTON, La. (AP) — Authorities in Louisiana said Saturday said at least three people have died in connection with a severe storm that is sweeping across parts of the U.S. Gulf Coast and Southeast.", "url": "https://apnews.com/32089e0d58c519f6e92aa41267e2c5a5", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/7/c0/7c03aa84-ac43-5cd2-a263-5f975b8d2be2/5e195a16e1a47.image.jpg?crop=1714%2C964%2C0%2C122&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-11T15:02:40Z", "content": "BENTON, La. (AP) Authorities in Louisiana said Saturday said at least three people have died in connection with a severe storm that is sweeping across parts of the U.S. Gulf Coast and Southeast.\r\nThe Bossier Parish Sheriff's Office said on its Facebook page t… [+2286 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JORDYN BROWN The Register-Guard", "title": "UO considering guaranteed tuition program", "description": "EUGENE, Ore. (AP) — Lindsay Luallen chose to move from Alabama to enroll at the University of Oregon five years ago because the university was able to accommodate the fact that she only had herself to rely on for financial…", "url": "https://apnews.com/e7a9a836a78e1ffc135e8d61ca95445a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:01:38Z", "content": "EUGENE, Ore. (AP) Lindsay Luallen chose to move from Alabama to enroll at the University of Oregon five years ago because the university was able to accommodate the fact that she only had herself to rely on for financial support. She hadnt lived at home since… [+11167 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Jury: Principal molested student for years; $3M awarded", "description": "PORTLAND, Ore. (AP) — A Multnomah County jury on Friday awarded $3 million to a young woman who said the principal of her public elementary school sexually abused her in his office when she was in second, third and fourth…", "url": "https://apnews.com/6af04aae465411b14ca350ad84e16557", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-11T15:00:38Z", "content": "PORTLAND, Ore. (AP) A Multnomah County jury on Friday awarded $3 million to a young woman who said the principal of her public elementary school sexually abused her in his office when she was in second, third and fourth grade.\r\nThe Oregonian/OregonLive report… [+1599 chars]"}]}