{"status": "ok", "totalResults": 78, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By PHILIP MARCELO Associated Press", "title": "Guatemalan seeking asylum sues US to reunite with family", "description": "BOSTON (AP) — A Guatemalan woman seeking asylum in Massachusetts is suing the federal government to reunite with her partner and son, who have been ordered to remain in Mexico under the Trump administration's asylum process.", "url": "https://apnews.com/81004153e5f37aeb98e9d7ec2ffe994d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:42:03Z", "content": "BOSTON (AP) A Guatemalan woman seeking asylum in Massachusetts is suing the federal government to reunite with her partner and son, who have been ordered to remain in Mexico under the Trump administration's asylum process.\r\nThe lawsuit filed on behalf of Maud… [+2468 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge nixes defense funding appeal in teacher's 2005 slaying", "description": "TIFTON, Ga. (AP) — A man charged with killing a Georgia teacher who vanished in 2005 has lost another appeal requesting state funding for expert witnesses.", "url": "https://apnews.com/a707661d1ac1d78d285c08c93aae2152", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:39:22Z", "content": "TIFTON, Ga. (AP) A man charged with killing a Georgia teacher who vanished in 2005 has lost another appeal requesting state funding for expert witnesses.\r\nOn Friday, Tift Judicial Circuit Judge Bill Reinhardt once again ruled that the state doesn't have to pa… [+1715 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By SCOTT SONNER Associated Press", "title": "New deal with mining company to protect rare Nevada plant", "description": "RENO, Nev. (AP) — An Australian mining company has agreed to a moratorium on new activities at a planned lithium mine in Nevada in exchange for conservationists dropping a lawsuit to protect a rare desert wildflower they say doesn't exist…", "url": "https://apnews.com/123e1586c3465732bc6421b3b6746364", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:39:10Z", "content": "RENO, Nev. (AP) An Australian mining company has agreed to a moratorium on new activities at a planned lithium mine in Nevada in exchange for conservationists dropping a lawsuit to protect a rare desert wildflower they say doesn't exist anywhere else in the w… [+3676 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By KEVIN McGILL Associated Press", "title": "Future of fish farming in federal waters at issue in court", "description": "NEW ORLEANS (AP) — The potential environmental and economic consequences posed by proposals for fish farming in federal waters dictate that Congress — not a federal agency — must decide how to regulate the industry, an attorney told a federal…", "url": "https://apnews.com/e724b46fd480a029d240ab2b0d92a9dc", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:34:31Z", "content": "NEW ORLEANS (AP) The potential environmental and economic consequences posed by proposals for fish farming in federal waters dictate that Congress not a federal agency must decide how to regulate the industry, an attorney told a federal appeals court Monday.\r… [+2119 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BECKY BOHRER Associated Press", "title": "Alaska governor agrees to continue accepting refugees", "description": "JUNEAU, Alaska (AP) — Alaska Gov. Mike Dunleavy has agreed to continue allowing resettlement of refugees in the state under a presidential executive order that gave states an option to refuse them.", "url": "https://apnews.com/877483002e7a1db7025a73817ef1a0fd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:33:59Z", "content": "JUNEAU, Alaska (AP) Alaska Gov. Mike Dunleavy has agreed to continue allowing resettlement of refugees in the state under a presidential executive order that gave states an option to refuse them.\r\nDunleavy, a Republican, sent a brief letter to Secretary of St… [+897 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DAVID KOENIG AP Airlines Writer", "title": "Boeing's checklist of 737 Max fixes grows with wiring issue", "description": "DALLAS (AP) — Boeing faces a growing checklist of items it could be forced to fix before federal safety officials let the grounded 737 Max airliner fly again.", "url": "https://apnews.com/3cb990b1081d943d980021b3cc627f02", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-06T19:33:47Z", "content": "DALLAS (AP) Boeing faces a growing checklist of items it could be forced to fix before federal safety officials let the grounded 737 Max airliner fly again.\r\nThe Federal Aviation Administration recently asked Boeing to review all possible ramifications of the… [+1087 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Keuchel 2023 option can become guaranteed based on innings", "description": "CHICAGO (AP) — Left-hander Dallas Keuchel's $20 million option for 2023 in his contract with the Chicago White Sox would become guaranteed if he pitches 320 regular-season innings in 2021-22 combined, including at least 160 in 2022, and he passes…", "url": "https://apnews.com/bf35ef22dd4685f0fb002078cc9cc888", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-06T19:33:23Z", "content": "CHICAGO (AP) Left-hander Dallas Keuchel's $20 million option for 2023 in his contract with the Chicago White Sox would become guaranteed if he pitches 320 regular-season innings in 2021-22 combined, including at least 160 in 2022, and he passes a physical at … [+1279 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Bale, Benzema out of Spanish Super Cup because of injuries", "description": "MADRID (AP) — Real Madrid will be without Gareth Bale and Karim Benzema for the Spanish Super Cup this week.", "url": "https://apnews.com/0ca18d8a391bf137406a399762e34a0a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/e/4c/e4c1de34-8675-5b1b-97be-a2158a3f713c/5e138e76080cd.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T19:31:10Z", "content": "MADRID (AP) Real Madrid will be without Gareth Bale and Karim Benzema for the Spanish Super Cup this week.\r\nThe forwards will not make the trip to Saudi Arabia for the tournament that will debut a semifinals format.\r\nMadrid plays Valencia in the first semifin… [+1146 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "Deputies rescue baby trapped under water when canoe flips", "description": "WEEKI WACHEE, Fla. (AP) — Two Florida sheriff's deputies were taking a lunch break after patrolling a stretch of the Weeki Wachee River on Friday when they saw a canoe flip and heard a woman screaming for someone to help…", "url": "https://apnews.com/81bf435cacaac562f0d37a93fc9160a5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:31:03Z", "content": "WEEKI WACHEE, Fla. (AP) Two Florida sheriff's deputies were taking a lunch break after patrolling a stretch of the Weeki Wachee River on Friday when they saw a canoe flip and heard a woman screaming for someone to help her baby.\r\nHernando County Sheriff's dep… [+1298 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Correction: Radio Stations Sold story", "description": "NATCHEZ, Miss. (AP) — In a January 4, 2020, story about the sale of two radio stations in Mississippi, The Associated Press incorrectly reported that the stations currently are owned by African Americans. The current owners are white and the…", "url": "https://apnews.com/378d6d371ca38144351cd7823130ecf1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:27:19Z", "content": "Please purchase a subscription to continue reading.\r\nA subscription is required to continue reading.\r\nIf you are a current subscriber please click Sign Up or Login to activate your digital access. If not, please click Sign Up to subscribe.\r\nIf you are a curre… [+138 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Aynslee Darmon", "title": "Harvey Weinstein Indicted On New Sex Crimes Charges In LA", "description": "LOS ANGELES (AP) — Harvey Weinstein has been indicted on new sex crime charges in Los Angeles, just as his trial on separate rape and sexual assault charges in New York was poised to get underway, prosecutors announced Monday. The Hollywood mogul has been cha…", "url": "http://apnews.com/d865010fa5072224f95d8dc74f3dd405", "urlToImage": "https://shawetcanada.files.wordpress.com/2020/01/2020-01-06t162629z_37428958_rc2gae9z8w2w_rtrmadp_3_people-harvey-weinstein.jpg?quality=80&strip=all&w=720&h=480&crop=1", "publishedAt": "2020-01-06T19:24:04Z", "content": "By The Associated Press.\r\n17 mins ago LOS ANGELES (AP) Harvey Weinstein has been indicted on new sex crime charges in Los Angeles, just as his trial on separate rape and sexual assault charges in New York was poised to get underway, prosecutors announced Mond… [+7700 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Washington officials oppose island proposals for rainwater", "description": "MOUNT VERNON, Wash. (AP) — County planning officials in Washington state have opposed changes to restrictions on using rain as a primary water source for an island community.", "url": "https://apnews.com/518bf2aa5110a92f36d1a6e11b2442c1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:17:59Z", "content": "MOUNT VERNON, Wash. (AP) County planning officials in Washington state have opposed changes to restrictions on using rain as a primary water source for an island community.\r\nThe Skagit County Planning and Development Services Department advised county commiss… [+1401 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JAKE COYLE AP Film Writer", "title": "'Joker,' 'Parasite,' '1917,' 'Little Women' land WGA noms", "description": "NEW YORK (AP) — Sam Mendes' World War I tale “1917” followed up its big night at the Golden Globes with a nomination for best screenplay from the Writers Guild on Monday.", "url": "https://apnews.com/e6f8a8cd3d96760f94e906dc137ef921", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/bf/6bfab5d2-30eb-5203-a934-d901be7db466/5e138b1c5bbed.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T19:15:55Z", "content": "NEW YORK (AP) Sam Mendes' World War I tale 1917 followed up its big night at the Golden Globes with a nomination for best screenplay from the Writers Guild on Monday.\r\nAlongside 1917, the writers guild nominated for best original screenplay the scripts to Boo… [+2081 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-attorney pleads guilty to collecting client's pension", "description": "PROVIDENCE, R.I. (AP) — A former Rhode Island attorney has pleaded guilty to fraudulently collecting more than $230,000 in pension payments in the name of a former client for nearly 12 years after the man’s death.", "url": "https://apnews.com/a194a2fdfde18bdcb888d42db2a3afd7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:14:49Z", "content": "PROVIDENCE, R.I. (AP) A former Rhode Island attorney has pleaded guilty to fraudulently collecting more than $230,000 in pension payments in the name of a former client for nearly 12 years after the mans death.\r\nOleg Nikolyszyn, 65, was hired and given power … [+732 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Such trash! Overturned big rig blocks Georgia highway", "description": "ATLANTA (AP) — A tractor-trailer full of trash overturned on an Atlanta highway Monday, spilling its cargo and closing the road for hours.", "url": "https://apnews.com/067f0e6e0c0646489fa4f7de0f5a0e4d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:10:09Z", "content": "ATLANTA (AP) A tractor-trailer full of trash overturned on an Atlanta highway Monday, spilling its cargo and closing the road for hours.\r\nNo injuries were reported in the wreck on Interstate 285 crash near Interstate 75, Georgia State Patrol Lt. Stephanie Sta… [+504 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Laura Harvey named coach of U20 women's national soccer team", "description": "CHICAGO (AP) — Laura Harvey has been named head coach of the under-20 women's national team heading into that level's World Cup qualifying tournament.", "url": "https://apnews.com/c16c4f9f903f64428f2a8339995289db", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-06T19:09:51Z", "content": "CHICAGO (AP) Laura Harvey has been named head coach of the under-20 women's national team heading into that level's World Cup qualifying tournament.\r\nHarvey has been a coach in the National Women's Soccer League since its start in 2013. She was coach of the U… [+1103 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Colorado sheriff, FAA meet about mysterious drone sightings", "description": "FORT MORGAN, Colo. (AP) — A Colorado sheriff is hosting a closed-door meeting with law enforcement agencies and government officials to talk about mysterious drone sightings in the northeastern part of the state and Nebraska.", "url": "https://apnews.com/58a4ee8fa66dbb2e82be31fdba479d9d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:08:29Z", "content": "FORT MORGAN, Colo. (AP) A Colorado sheriff is hosting a closed-door meeting with law enforcement agencies and government officials to talk about mysterious drone sightings in the northeastern part of the state and Nebraska.\r\nMorgan County Sheriff David Martin… [+740 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man awarded $3.64M after injuring his back at Staples store", "description": "HAMILTON, N.J. (AP) — A New Jersey man who sued Staples Inc. after injuring his back when he fell in a store was awarded more than $3.64 million in a jury verdict, the law firm representing him said Monday.", "url": "https://apnews.com/1ab424d4296975db87b1ceba1ff4c439", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:07:42Z", "content": "HAMILTON, N.J. (AP) A New Jersey man who sued Staples Inc. after injuring his back when he fell in a store was awarded more than $3.64 million in a jury verdict, the law firm representing him said Monday.\r\nJim Simmons was looking at computers at a Staples sto… [+987 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Pickering replaces Gibbons as state high court chief justice", "description": "CARSON CITY, Nev. (AP) — Nevada has a new state Supreme Court chief justice.", "url": "https://apnews.com/d1961635c3828f18ff9043e1cdc17624", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T19:05:15Z", "content": "CARSON CITY, Nev. (AP) Nevada has a new state Supreme Court chief justice.\r\nKristina Pickering took over the position Monday from Justice Mark Gibbons, with plans to serve a one-year term as administrative head of the seven-member court and the Nevada legal s… [+646 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "CFL's Montreal Alouettes get new owners from Toronto company", "description": "MONTREAL (AP) — The Montreal Alouettes of the Canadian Football League have new owners.", "url": "https://apnews.com/4638b3bab8e516ce19496c1accdb2544", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-06T19:03:49Z", "content": "MONTREAL (AP) The Montreal Alouettes of the Canadian Football League have new owners.\r\nThe CFL announced Monday the team now belongs to two executives of Crawford Steel Sid Spiegel and Gary Stern.\r\nSpiegel is chairman of the board of the Toronto company while… [+510 chars]"}]}