{"status": "ok", "totalResults": 74, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ALAN SUDERMAN Associated Press", "title": "Northam proposes sweeping criminal justice reforms", "description": "RICHMOND, Va. (AP) — Virginia Gov. Ralph Northam is promising sweeping changes to the state's criminal justice reforms that include decriminalizing marijuana, softening the penalties for people caught stealing smaller-dollar items, and reducing the number of …", "url": "https://apnews.com/f8aea52a67130efbc7f338799d7447c3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:22:39Z", "content": "RICHMOND, Va. (AP) Virginia Gov. Ralph Northam is promising sweeping changes to the state's criminal justice reforms that include decriminalizing marijuana, softening the penalties for people caught stealing smaller-dollar items, and reducing the number of Vi… [+1007 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Gov. Kelly: Kansas psychiatric hospital unit needs changes", "description": "WICHITA, Kan. (AP) — Kansas Gov. Laura Kelly says a troubled unit within a state hospital for the mentally ill is “not a therapeutic environment\" and promised changes.", "url": "https://apnews.com/5d86aa252dd3a641bfe9bddf25ef4ec3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:19:19Z", "content": "WICHITA, Kan. (AP) Kansas Gov. Laura Kelly says a troubled unit within a state hospital for the mentally ill is not a therapeutic environment\" and promised changes.\r\nKelly discussed the latest problems at Osawatomie State Hospital on Thursday after federal in… [+2193 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Driver shot on I-77 in Virginia", "description": "ROCKY GAP, Va. (AP) — Police in Virginia say a driver was shot on a highway by someone traveling in another car.", "url": "https://apnews.com/d576e1117aee448548ae53309d5ed3cd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:16:35Z", "content": "ROCKY GAP, Va. (AP) Police in Virginia say a driver was shot on a highway by someone traveling in another car.\r\nWCYB reports that the shooting occurred early Friday morning on I-77 near Rocky Gap. The wounded driver suffered serious injuries.\r\nState police sa… [+443 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Leaders talk safety after fatal crashes near homeless center", "description": "SOUTH SALT LAKE, Utah (AP) — Salt Lake City leaders have called for immediate pedestrian safety improvements after three men were fatally struck while trying to cross the street near a new homeless resource center.", "url": "https://apnews.com/9768f31b98c33dc86eea5047086d3dd3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:14:34Z", "content": "SOUTH SALT LAKE, Utah (AP) Salt Lake City leaders have called for immediate pedestrian safety improvements after three men were fatally struck while trying to cross the street near a new homeless resource center.\r\nFour crashes including three deaths have occu… [+2191 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Over half of Indiana schools met feds' academic expectations", "description": "INDIANAPOLIS (AP) — Over half of Indiana schools met or exceeded federal academic expectations based on their 2018-19 performance, state education officials said.", "url": "https://apnews.com/6c0acda8b03390814f27e49494312fce", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:14:27Z", "content": "INDIANAPOLIS (AP) Over half of Indiana schools met or exceeded federal academic expectations based on their 2018-19 performance, state education officials said.\r\nData released Friday by the Indiana Department of Education show that over 56 percent of Indiana … [+1247 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Trial for W.Va. woman in false abduction case delayed again", "description": "HUNTINGTON, W.Va. (AP) — The trial of a West Virginia woman charged with making up a story about an Egyptian man trying to kidnap her daughter in a shopping mall has been delayed again.", "url": "https://apnews.com/e9de43ce56799a0d75854ac8c65b23e5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:13:45Z", "content": "HUNTINGTON, W.Va. (AP) The trial of a West Virginia woman charged with making up a story about an Egyptian man trying to kidnap her daughter in a shopping mall has been delayed again.\r\nSantana Renee Adams trial on a charge of falsely reporting an emergency in… [+692 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Teen shot in Nampa", "description": "NAMPA, Idaho (AP) — Police in Nampa, Idaho, found a 15-year-old boy with a gunshot wound to his leg Thursday.", "url": "https://apnews.com/9516698d3f19af60a9967a446468031a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:11:55Z", "content": "NAMPA, Idaho (AP) Police in Nampa, Idaho, found a 15-year-old boy with a gunshot wound to his leg Thursday.\r\nThe Idaho Statesman reports the boy was found about 5:15 p.m. and the suspect was detained shortly afterward in Caldwell. Neither the victim nor the s… [+202 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Organizers cancel International Eelpout Festival in Walker", "description": "WALKER, Minn. (AP) — Organizers have canceled the International Eelpout Festival on Leech Lake in Walker, saying the economics and other restrictions on the celebration of Minnesota's ugliest fish no longer work.", "url": "https://apnews.com/521adace1b532c768413638a337d2936", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:11:11Z", "content": "WALKER, Minn. (AP) Organizers have canceled the International Eelpout Festival on Leech Lake in Walker, saying the economics and other restrictions on the celebration of Minnesota's ugliest fish no longer work.\r\nThe organizers said Thursday they could not rea… [+1192 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Patrol: Driver died in collision while trying to pass semi", "description": "OSHKOSH, Neb. (AP) — An Omaha man died when his pickup truck collided with an oncoming semitrailer in the Nebraska Panhandle, the Nebraska State Patrol said.", "url": "https://apnews.com/c7036cd3b11333f4aae1425d28ae1e6a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:10:26Z", "content": "OSHKOSH, Neb. (AP) An Omaha man died when his pickup truck collided with an oncoming semitrailer in the Nebraska Panhandle, the Nebraska State Patrol said.\r\nThe collision occurred around 4:10 p.m. Thursday on U.S. Highway 26, just west of Oshkosh in Garden Co… [+393 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Motel shootout leaves 2 men dead, 1 critically wounded", "description": "SALEM, N.J. (AP) — A shootout at a southern New Jersey motel left two men dead and another critically injured, and authorities believe it may be linked to another shooting that occurred there the night before.", "url": "https://apnews.com/1919e4804961b799804c7743a74f8920", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:05:51Z", "content": "SALEM, N.J. (AP) A shootout at a southern New Jersey motel left two men dead and another critically injured, and authorities believe it may be linked to another shooting that occurred there the night before.\r\nPolice went to the Salem Motor Lodge in Salem arou… [+1118 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Iowa officer helping to equip colleagues on Alaskan island", "description": "DAVENPORT, Iowa (AP) — A six-member police force on an island in the Bering Sea soon will be equipped with stun guns, vests and other police equipment, thanks to the efforts of a fellow officer more than 3,400 miles (5,479…", "url": "https://apnews.com/a8bb052e80ef3bfd4048bee30a0a14ae", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:05:10Z", "content": "DAVENPORT, Iowa (AP) A six-member police force on an island in the Bering Sea soon will be equipped with stun guns, vests and other police equipment, thanks to the efforts of a fellow officer more than 3,400 miles (5,479 kilometers) away in Iowa.\r\nOfficer Pem… [+2040 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "Police: Teenage Florida driver crashes stolen car into house", "description": "ST. PETERSBURG, Fla. (AP) — An underage driver and passenger were taken to the hospital on Friday after the driver slammed into a house in a stolen car, police in St. Petersburg said.", "url": "https://apnews.com/e97dc1530c9d9348b5ee25edc64eeb38", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:04:49Z", "content": "ST. PETERSBURG, Fla. (AP) An underage driver and passenger were taken to the hospital on Friday after the driver slammed into a house in a stolen car, police in St. Petersburg said.\r\nPolice were called around 5 a.m. Friday after the car hit the house. Investi… [+481 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Idaho tracks closed by derailment could open Saturday", "description": "BONNERS FERRY, Idaho (AP) — Crews hope to have track closed by derailed train in northern Idaho open by Saturday morning.", "url": "https://apnews.com/225e43ce3d1bb11c9e6d366cfec90c3f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:01:34Z", "content": "BONNERS FERRY, Idaho (AP) Crews hope to have track closed by derailed train in northern Idaho open by Saturday morning.\r\nThe lead engine in Wednesday's derailment began leaking diesel fuel into the Kootenai River. Three locomotives and six rail cars derailed … [+924 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BARRY WILNER AP Pro Football Writer", "title": "Titans-Patriots get prime-time spotlight for wild-card games", "description": "The Patriots have been compared to a sporting dynasty and to Palpatine's Evil Empire. Regardless of which is true, there's no denying that New England enters these playoffs more vulnerable than in quite a few years.", "url": "https://apnews.com/2d9a1a3ea55a37aedfa6c7ba05a664f2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-03T16:00:07Z", "content": "Pro Picks just can't go against the Brady Bunch in this one, as tempting as it might be.\r\nPATRIOTS, 23-17\r\nNo. 9 Buffalo (plus 3) at No. 10 Houston, Saturday\r\nForget that the Bills lost their last two games. They tested New England to the limit in their 15th … [+976 chars]"}]}