{"status": "ok", "totalResults": 71, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Alaska files documents opposing Eklutna tribal gaming push", "description": "ANCHORAGE, Alaska (AP) — The state of Alaska has filed documents opposing a tribe's push to open a gaming hall north of Anchorage.", "url": "https://apnews.com/e34ef99f9dd911a955e3d1d031c61dfd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:14:25Z", "content": "ANCHORAGE, Alaska (AP) The state of Alaska has filed documents opposing a tribe's push to open a gaming hall north of Anchorage.\r\nOfficials with the Alaska Department of Law said in the documents filed Tuesday that other Alaska tribes would open similar opera… [+2149 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By RALPH D. RUSSO AP College Football Writer", "title": "Delpit caps unusual season for LSU with trip to title game", "description": "Grant Delpit has had an unusual season.", "url": "https://apnews.com/fb524ff022086174b2a0e45855dc298d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/9/86/986c9a31-fa1f-54ed-ad84-d6d5fe0f3807/5e0e6bc9b45d5.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-02T22:13:32Z", "content": "Grant Delpit has had an unusual season.\r\nLSU's star safety switched positions early in the year to compensate for an injured teammate. Later in the season, he was the injured player and the Tigers' defense suffered from Delpit being limited by a sore ankle.\r\n… [+3746 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man gets prison for stealing home deed without signing loan", "description": "BARTOW, Fla. (AP) — A Florida man was sentenced to prison for trying to steal a new $219,000 home by snatching and filing a signed deed without signing loan documents.", "url": "https://apnews.com/148b32524148b52163f80016420c3835", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:13:31Z", "content": "BARTOW, Fla. (AP) A Florida man was sentenced to prison for trying to steal a new $219,000 home by snatching and filing a signed deed without signing loan documents.\r\nStanley Livingston, 45, was given a three-and-a-half-year sentence last month in Polk County… [+1528 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Teen pleads not guilty in fatal Colorado school shooting", "description": "CASTLE ROCK, Colo. (AP) — A teenager charged with first-degree murder and other charges in a school shooting that killed one student and injured eight others pleaded not guilty on Thursday.", "url": "https://apnews.com/da910ab3562e20396c44648827688269", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:12:23Z", "content": "CASTLE ROCK, Colo. (AP) A teenager charged with first-degree murder and other charges in a school shooting that killed one student and injured eight others pleaded not guilty on Thursday.\r\nDevon Erickson, 19, entered his plea in Douglas County District Court … [+659 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man serving life in prison for fatally stabbing woman dies", "description": "LA BELLE, Pa. (AP) — A Pennsylvania man serving life in prison for fatally stabbing a woman in 2004 died, officials said Thursday.", "url": "https://apnews.com/c343e82877c5610cce4e4fb9c78c9fae", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:11:42Z", "content": "LA BELLE, Pa. (AP) A Pennsylvania man serving life in prison for fatally stabbing a woman in 2004 died, officials said Thursday.\r\nJoseph Gacha Jr., 42, was pronounced dead at State Correctional Institution at Fayette on Monday, according to the state's Depart… [+644 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police cruiser collides with pickup truck, officer hurt", "description": "PORTSMOUTH, N.H. (AP) — A New Hampshire police officer driving with his emergency lights and siren on suffered minor injuries after colliding with a pickup truck Thursday.", "url": "https://apnews.com/068e6fe9e67e3b1085db5cacd53938eb", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:11:22Z", "content": "PORTSMOUTH, N.H. (AP) A New Hampshire police officer driving with his emergency lights and siren on suffered minor injuries after colliding with a pickup truck Thursday.\r\nPortsmouth police said the officer, Thompson Potter, 39, was traveling north on the Rout… [+383 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Hobart man gets 65 years for female co-worker's slaying", "description": "VALPARAISO, Ind. (AP) — A northwestern Indiana judge sentenced a man to the maximum 65 years in prison Thursday for fatally stabbing a female bartender at the tavern where he worked as a bouncer.", "url": "https://apnews.com/2555976da53bd977d3b6e24e6ab5398b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:10:39Z", "content": "VALPARAISO, Ind. (AP) A northwestern Indiana judge sentenced a man to the maximum 65 years in prison Thursday for fatally stabbing a female bartender at the tavern where he worked as a bouncer.\r\nA Porter County jury in November found Christopher Dillard, 53, … [+829 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man faces trial in 1994 Wisconsin murder case", "description": "MADISON, Wis. (AP) — A judge ordered an Indiana man to stand trial for the 1994 death of a woman who was strangled and run over with a car in Madison, Wisconsin.", "url": "https://apnews.com/891ca0db959f10ca1d1a89476600098c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:07:59Z", "content": "MADISON, Wis. (AP) A judge ordered an Indiana man to stand trial for the 1994 death of a woman who was strangled and run over with a car in Madison, Wisconsin.\r\nDane County Circuit Judge Valerie Bailey-Rihn said during a hearing Thursday that there's enough e… [+1008 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Officer who drunkenly broke into Nashville home quits NYPD", "description": "NEW YORK (AP) — A New York City police officer convicted of breaking into a home during a drunken bachelor party in Nashville, Tennessee, has quit the force.", "url": "https://apnews.com/7c9753ea385923f591100b3f7f37a4b2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:07:09Z", "content": "NEW YORK (AP) A New York City police officer convicted of breaking into a home during a drunken bachelor party in Nashville, Tennessee, has quit the force.\r\nMichael Reynolds stepped down rather than face disciplinary proceedings, said Devora Kaye, a departmen… [+1297 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "'Affluenza' teen jailed in Texas for probation violation", "description": "FORT WORTH, Texas (AP) — A Texas man who used \"affluenza\" as a defense at his trial for killing four people while driving drunk was arrested Thursday after authorities say he violated the terms of his probation.", "url": "https://apnews.com/be8a8649740c50f200def0245a9d960a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T22:02:25Z", "content": "FORT WORTH, Texas (AP) A Texas man who used \"affluenza\" as a defense at his trial for killing four people while driving drunk was arrested Thursday after authorities say he violated the terms of his probation.\r\nEthan Couch, 22, was booked into a jail in Fort … [+1462 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TIM REYNOLDS AP Basketball Writer", "title": "Remembering David Stern, and some of his top accomplishments", "description": "MIAMI (AP) — Nick Nurse has quite a few reasons to be thankful for David Stern.", "url": "https://apnews.com/da9fb37383581c9cd44803125953a8f4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/b0/6b03b8fc-0df3-5cc8-b31c-067022832d74/5e0e6bd828b54.image.jpg?crop=1671%2C940%2C0%2C150&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-02T22:01:01Z", "content": "MIAMI (AP) Nick Nurse has quite a few reasons to be thankful for David Stern.\r\nThe coach of the NBA champion Toronto Raptors first encountered Stern around 20 years ago. Nurse, who was coaching in London, met Stern then the NBA commissioner through a mutual f… [+4759 chars]"}]}