{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Germany: Mass evacuation underway before WWII bomb defusing", "description": "BERLIN (AP) — Thousands of people had to evacuate Sunday in the western Germany city of Dortmund as experts prepared to defuse as many as four bombs from World War II.", "url": "https://apnews.com/df762038f358373a18f84635594ba36b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-12T10:45:30Z", "content": "BERLIN (AP) Thousands of people had to evacuate Sunday in the western Germany city of Dortmund as experts prepared to defuse as many as four bombs from World War II.\r\nAuthorities already had evacuated two hospitals Saturday and opened schools for residents wh… [+595 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Pope baptizes 32 babies in Sistine Chapel, marvels at quiet", "description": "VATICAN CITY (AP) — Pope Francis has baptized 32 babies, including two sets of twins, in the splendor of the Sistine Chapel.", "url": "https://apnews.com/0d7e2f51d8052f9c5aca3c4890e3ae97", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-12T09:57:17Z", "content": "VATICAN CITY (AP) Pope Francis has baptized 32 babies, including two sets of twins, in the splendor of the Sistine Chapel.\r\nFrancis marveled that the babies were very quiet, with barely a peep as they waited their turn to be baptized Sunday morning under the … [+657 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JOSEPH KRAUSS Associated Press", "title": "Iran braces for protests after admitting plane shootdown", "description": "DUBAI, United Arab Emirates (AP) — Iran deployed riot police in the capital on Sunday expecting possible protests after its Revolutionary Guard admitted to accidentally shooting down a passenger plane at a time of soaring tensions with the United States.", "url": "https://apnews.com/f5912dbd48b5037f1cf3b3ebce154fdd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/6/cd/6cd4f40a-fa93-5691-8e24-651546d42702/5e1a506302b63.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T09:41:41Z", "content": "DUBAI, United Arab Emirates (AP) Iran deployed riot police in the capital on Sunday expecting possible protests after its Revolutionary Guard admitted to accidentally shooting down a passenger plane at a time of soaring tensions with the United States.\r\nRiot … [+3126 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Hong Kong rally seeks international support for movement", "description": "HONG KONG (AP) — More than a thousand people attended a rally in Hong Kong on Sunday to urge people and governments abroad to support the city's pro-democracy movement and oppose China's ruling Communist Party.", "url": "https://apnews.com/8c865d67c7890864051e1ddf232239aa", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-12T09:37:48Z", "content": "HONG KONG (AP) More than a thousand people attended a rally in Hong Kong on Sunday to urge people and governments abroad to support the city's pro-democracy movement and oppose China's ruling Communist Party.\r\nRepresentatives of allied activist groups from Ca… [+924 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By AYA BATRAWY Associated Press", "title": "Aramco's 'greenshoe option' pushes IPO to record $29.4B", "description": "DUBAI, United Arab Emirates (AP) — Saudi Arabian oil giant Aramco announced Sunday that its initial public offering raised a record $29.4 billion, a figure higher than previously announced, after the company used a so-called “greenshoe option” to sell million…", "url": "https://apnews.com/399cda92332bb79bea96d63f758e4cea", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-12T09:36:13Z", "content": "DUBAI, United Arab Emirates (AP) Saudi Arabian oil giant Aramco announced Sunday that its initial public offering raised a record $29.4 billion, a figure higher than previously announced, after the company used a so-called greenshoe option to sell millions mo… [+1511 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: 3 juveniles, 2 adults wounded in Colorado shooting", "description": "AURORA, Colo. (AP) — Three juveniles and two adults were shot and wounded in Colorado, police said early Sunday.", "url": "https://apnews.com/9154aa57b2cce6b9bbe0fc6d122f2e3a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T09:32:09Z", "content": "AURORA, Colo. (AP) Three juveniles and two adults were shot and wounded in Colorado, police said early Sunday.\r\nThe five victims were in serious condition but expected to survive, Aurora police tweeted just after midnight. The victims were hospitalized for tr… [+582 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ELAINE KURTENBACH Associated Press", "title": "China democracy activists cheered by Taiwan election results", "description": "TAIPEI, Taiwan (AP) — Chinese pro-democracy activists who traveled to Taiwan to observe the island's presidential election said Sunday that the reelection of independence-leaning President Tsai Ing-wen gave them cause for hope despite Beijing's quashing of di…", "url": "https://apnews.com/b62f77068140d19d8e594bbb89fb177a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/0/4e/04e2eeac-7929-5227-b4a5-62105dd9dafe/5e1aeab21981f.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T09:30:25Z", "content": "TAIPEI, Taiwan (AP) Chinese pro-democracy activists who traveled to Taiwan to observe the island's presidential election said Sunday that the reelection of independence-leaning President Tsai Ing-wen gave them cause for hope despite Beijing's quashing of diss… [+2612 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By STEPHEN CALLEJA Associated Press", "title": "Lawmaker, son of ex-president, to be Malta's next premier", "description": "VALLETTA, Malta (AP) — A first-term lawmaker whose father was Malta's president has been chosen to be the country's prime minister. The count on Sunday showed Robert Abela received nearly 58% of votes cast by members of the governing Labour…", "url": "https://apnews.com/ff7166223a539e6a413eb50371488b86", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/7/c9/7c94f682-dc47-53c3-b6e3-7e4661bf3158/5e1ae73221b2a.image.jpg?crop=1640%2C923%2C0%2C170&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T09:28:49Z", "content": "VALLETTA, Malta (AP) A first-term lawmaker whose father was Malta's president has been chosen to be the country's prime minister. The count on Sunday showed Robert Abela received nearly 58% of votes cast by members of the governing Labour Party eligible to ch… [+1156 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Tiny Philippine volcano ejects smoke and ash, villagers flee", "description": "MANILA, Philippines (AP) — A tiny Philippine volcano that draws many tourists because of its picturesque setting amid a lake belched steam, ash and small rocks Sunday, prompting residents to flee from nearby villages and authorities to raise the danger…", "url": "https://apnews.com/1b5fbc4278524c63984c0d02b8d1bfb4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/6/74/674825e2-3b2c-5924-827b-bf5b5a8ecc16/5e1aeab34ee24.image.jpg?resize=1024%2C576", "publishedAt": "2020-01-12T09:25:11Z", "content": "MANILA, Philippines (AP) A tiny Philippine volcano that draws many tourists because of its picturesque setting amid a lake belched steam, ash and small rocks Sunday, prompting residents to flee from nearby villages and authorities to raise the danger level.\r\n… [+1492 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "World leaders travel to Oman to meet its newly named sultan", "description": "DUBAI, United Arab Emirates (AP) — World leaders traveled Sunday to Oman to meet the country's new sultan, named just a day earlier after the death of the nation's longtime ruler Sultan Qaboos bin Said.", "url": "https://apnews.com/81f53fe158792e23b38199028cb2e1b2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/0/94/09456581-8593-51de-93c8-6019cc66b236/5e1ae7332bc77.image.jpg?crop=1874%2C1054%2C0%2C25&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T09:12:14Z", "content": "DUBAI, United Arab Emirates (AP) World leaders traveled Sunday to Oman to meet the country's new sultan, named just a day earlier after the death of the nation's longtime ruler Sultan Qaboos bin Said.\r\nBritish Prime Minister Boris Johnson and Prince Charles w… [+1001 chars]"}]}