{"status": "ok", "totalResults": 70, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Governor wants to add tracks, access at Penn Station", "description": "NEW YORK (AP) — The country's busiest train station would get new tracks, expanded terminals and better access for commuters under a plan announced Monday by New York Gov. Andrew Cuomo.", "url": "https://apnews.com/39ec515e2fc5d075ef3e424c12e9d064", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T23:11:21Z", "content": "NEW YORK (AP) The country's busiest train station would get new tracks, expanded terminals and better access for commuters under a plan announced Monday by New York Gov. Andrew Cuomo.\r\nCuomo said he will propose acquiring the block south of Penn Station to ad… [+2509 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Las Cruces man gets long prison term in crash that killed 2", "description": "LAS CRUCES, N.M. (AP) — A Las Cruces man who pleaded guilty to fatally running over two people with a vehicle in 2017 has been sentenced to 31 ½ years in prison.", "url": "https://apnews.com/5940ae576103fde1c8f360a743f37eed", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T23:11:10Z", "content": "LAS CRUCES, N.M. (AP) A Las Cruces man who pleaded guilty to fatally running over two people with a vehicle in 2017 has been sentenced to 31 ½ years in prison.\r\nDona Ana County prosecutors say 52-year-old Carlos Garcia was sentenced Monday in Third Judicial D… [+563 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Human remains, shoe found near office building in Juneau", "description": "", "url": "https://apnews.com/0377e1d27a1bf6131131250b56785b56", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T23:10:55Z", "content": "Please purchase a subscription to continue reading.\r\nA subscription is required to continue reading.\r\nIf you are a current subscriber please click Sign Up or Login to activate your digital access. If not, please click Sign Up to subscribe.\r\nIf you are a curre… [+138 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Colorado state Sen. Court to resign, cites health issues", "description": "DENVER (AP) — Colorado Democratic state Sen. Lois Court announced Monday she is resigning effective Jan. 16 due to health issues.", "url": "https://apnews.com/f35c3861665af917ad89417e93072508", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T23:10:43Z", "content": "DENVER (AP) Colorado Democratic state Sen. Lois Court announced Monday she is resigning effective Jan. 16 due to health issues.\r\nA statement released by majority Senate Democrats said Court has been diagnosed with Guillain-Barre Syndrome, a rare autoimmune di… [+1008 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Officer checks report of dead body, shoots armed man", "description": "HALLANDALE BEACH, Fla. (AP) — A Florida police officer shot and wounded an armed man Monday morning after responding to reports of a body in a yard, authorities said.", "url": "https://apnews.com/f16f2573001406c951a53a7239b57bd6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T23:10:22Z", "content": "HALLANDALE BEACH, Fla. (AP) A Florida police officer shot and wounded an armed man Monday morning after responding to reports of a body in a yard, authorities said.\r\nHallandale Beach officers responded to a 911 call about a body, police spokeswoman Ra Shanna … [+845 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "University of Wyoming likely to appeal records lawsuit loss", "description": "CASPER, Wyo. (AP) — A University of Wyoming official says the school will likely appeal a judge's order to turn over records to news media outlets.", "url": "https://apnews.com/0383310ef467a10d0ed6f3f56adc43bd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-06T23:08:12Z", "content": "CASPER, Wyo. (AP) A University of Wyoming official says the school will likely appeal a judge's order to turn over records to news media outlets.\r\nUniversity spokesman Chad Baldwin said Monday the school's board of trustees hasn't made a final decision on whe… [+1101 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By KEVIN FREKING Associated Press", "title": "Trump planning to attend college football championship game", "description": "WASHINGTON (AP) — President Donald Trump is planning to attend the Jan. 13 College Football Playoff National Championship in New Orleans.", "url": "https://apnews.com/4ee6d79d83a4b909640a8b59d3d971df", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/custom/image/aacc4e10-0064-11e7-adc2-d3321407a1f8.jpg", "publishedAt": "2020-01-06T23:05:05Z", "content": "WASHINGTON (AP) President Donald Trump is planning to attend the Jan. 13 College Football Playoff National Championship in New Orleans.\r\nThe game features No. 1 Louisiana State University versus No. 3 Clemson, which is looking for its third national title in … [+525 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DAVE SKRETTA AP Sports Writer", "title": "Chiefs prepped for Texans in pseudo-rematch of Week 6", "description": "KANSAS CITY, Mo. (AP) — The Kansas City Chiefs will welcome the Texans to Arrowhead Stadium on Sunday for the divisional round of the playoffs, a rematch in name only of their Week 6 nail-biter won by Houston on a…", "url": "https://apnews.com/fc25bb8eab0363dfcfdb5c1c4fcb35f1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/3/67/3672a047-e77c-5d1e-b9d4-591b177852ac/5e092215109eb.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T23:05:03Z", "content": "The easiest change to parse out between the Chiefs of three months ago and the current bunch is in personnel.\r\nFisher is back from his groin injury and Wylie from his ankle sprain. Chris Jones is back from his groin injury, fellow defensive tackle Xavier Will… [+1358 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Spirit AeroSystems offers employees voluntary layoffs", "description": "WICHITA, Kan. (AP) — Wichita aircraft parts maker Spirit AeroSystems offered its employees on Monday voluntary layoffs as it grapples with the fallout from the suspension of production for the troubled Boeing 737 Max jetliner.", "url": "https://apnews.com/12bb1fad6b13cba579efb0b6d0705d31", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T23:02:04Z", "content": "WICHITA, Kan. (AP) Wichita aircraft parts maker Spirit AeroSystems offered its employees on Monday voluntary layoffs as it grapples with the fallout from the suspension of production for the troubled Boeing 737 Max jetliner.\r\nChief Executive Officer Tom Genti… [+1692 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By LARRY NEUMEISTER Associated Press", "title": "Judge denies Michael Avenatti's request to toss out charges", "description": "NEW YORK (AP) — With a trial approaching, a judge denied a request Monday from attorney Michael Avenatti to toss out charges alleging he tried to extort up to $25 million from Nike by threatening to muddy its name.", "url": "https://apnews.com/8df1197fb6c9bd996118fddefb7e2d4f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-06T23:00:19Z", "content": "NEW YORK (AP) With a trial approaching, a judge denied a request Monday from attorney Michael Avenatti to toss out charges alleging he tried to extort up to $25 million from Nike by threatening to muddy its name.\r\nU.S. District Judge Paul G. Gardephe said in … [+2864 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kansas officer sorry for faked expletive on McDonald's cup", "description": "HERINGTON, Kan. (AP) — A former Kansas police officer who made up a story that a McDonald's employee wrote an expletive and the word “pig” on a coffee cup has apologized.", "url": "https://apnews.com/df795247bace3e96a9f68ad39d10ed49", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T22:59:39Z", "content": "HERINGTON, Kan. (AP) A former Kansas police officer who made up a story that a McDonald's employee wrote an expletive and the word pig on a coffee cup has apologized.\r\nI did not consider the magnitude of the decision I was making at the time, and did not disp… [+986 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Oklahoma treasurer: Revenue collections beginning to slow", "description": "OKLAHOMA CITY (AP) — Overall collections to the Oklahoma treasury are beginning to slow, fueled in large part by declining tax collections on oil and natural gas production, Oklahoma Treasurer Randy McDaniel announced on Monday.", "url": "https://apnews.com/52c5f5bb17fb12e3f47ae2b2865d6079", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-06T22:58:21Z", "content": "OKLAHOMA CITY (AP) Overall collections to the Oklahoma treasury are beginning to slow, fueled in large part by declining tax collections on oil and natural gas production, Oklahoma Treasurer Randy McDaniel announced on Monday.\r\nGross receipts during 2019 were… [+813 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Pier 1 Imports closing nearly half of stores as sales falter", "description": "FORT WORTH, Texas (AP) — Pier 1 Imports is closing nearly half its 942 stores as consumers increasingly shop online for home goods.", "url": "https://apnews.com/d9ca7ed84764b1444bd983f8447f33db", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T22:58:15Z", "content": "FORT WORTH, Texas (AP) Pier 1 Imports is closing nearly half its 942 stores as consumers increasingly shop online for home goods.\r\nThe company said Monday it is closing up to 450 stores and will also shutter distribution centers. Pier 1 also plans layoffs at … [+566 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TOM CANAVAN AP Sports Writer", "title": "Giants interview Judge, Rhule on deck, McCarthy to Dallas", "description": "EAST RUTHERFORD, N.J. (AP) — The New York Giants have interviewed New England Patriots assistant coach Joe Judge for their vacant head coaching job.", "url": "https://apnews.com/d10a69cb59eb6a5063ee1edd64606b4e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/6/77/6777d886-8968-5370-82eb-aa9256cfee7b/5e13bf8622bca.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T22:53:14Z", "content": "EAST RUTHERFORD, N.J. (AP) The New York Giants have interviewed New England Patriots assistant coach Joe Judge for their vacant head coaching job.\r\nThe 38-year-old Judge has been a part of five championship teams, winning three Super Bowls with the Patriots a… [+1127 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ANNE M. PETERSON AP Sports Writer", "title": "Women's World Cup vet Graeme Abel takes on top job at Oregon", "description": "EUGENE, Ore. (AP) — A rousing ovation greeted new Oregon women's soccer coach Graeme Abel when he was introduced to Ducks fans during the Pac-12 opener for the school's second-ranked women's basketball team.", "url": "https://apnews.com/d940821e53dc1a3a8e98cea499f10631", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/5/6f/56f25520-f62d-57ad-b675-e3ae2293065b/5e13bf874d221.image.jpg?crop=1579%2C888%2C0%2C212&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T22:51:59Z", "content": "In this photo taken Jan. 3, 2020, Oregon women's soccer coach Graeme Abel talks about his new job with the Ducks in Eugene, Ore. Abel was an assistant coach under Jill Ellis with the U.S. women's national team and a veteran of the team's two World Cup titles.… [+1466 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Boise officer struck, hurt by person fleeing in car", "description": "BOISE, Idaho (AP) — The Boise Police Department says an officer was hit by a car driven by a person who was trying to elude arrest.", "url": "https://apnews.com/d606008c06d7de8f87c66921b092b3e8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T22:51:38Z", "content": "BOISE, Idaho (AP) The Boise Police Department says an officer was hit by a car driven by a person who was trying to elude arrest.\r\nIn a prepared statement, the police department said officers were trying to arrest the person on a felony warrant just after noo… [+553 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Angels acquire reliever Keller from Marlins for Estrada", "description": "ANAHEIM, Calif. (AP) — The Los Angeles Angels have acquired right-handed reliever Kyle Keller from the Miami Marlins.", "url": "https://apnews.com/695f956832c86fee49c1255af0c522ce", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-06T22:44:47Z", "content": "ANAHEIM, Calif. (AP) The Los Angeles Angels have acquired right-handed reliever Kyle Keller from the Miami Marlins.\r\nThe Angels traded minor league catcher Jose Estrada to Miami on Monday.\r\nThe 26-year-old Keller made his major league debut last Aug. 4 and pi… [+875 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "NASA contractor settles whistleblower complaint for $375,000", "description": "ORLANDO, Fla. (AP) — A NASA contractor on Monday agreed to pay $375,000 in order to settle a whistleblower complaint that accused the company of falsely certifying that ground support equipment for a rocket launch system followed the space agency's…", "url": "https://apnews.com/f0e14406429fb1efbf2572b42d703634", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-06T22:44:16Z", "content": "ORLANDO, Fla. (AP) A NASA contractor on Monday agreed to pay $375,000 in order to settle a whistleblower complaint that accused the company of falsely certifying that ground support equipment for a rocket launch system followed the space agency's requirements… [+812 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By EMILY WAGSTER PETTUS Associated Press", "title": "Mississippi DA leaves murder case after multiple trials", "description": "JACKSON, Miss. (AP) — A Mississippi prosecutor filed a court order Monday indicating he won't be the one to decide whether to try a man a seventh time in a", "url": "https://apnews.com/9a93bca8a7f022b80bec66a78beb92f2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/1/78/178129e2-07aa-5bfc-ab30-93516165e9df/5e13bfc7c8f88.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T22:40:50Z", "content": "JACKSON, Miss. (AP) A Mississippi prosecutor filed a court order Monday indicating he won't be the one to decide whether to try a man a seventh time in a quadruple murder case.\r\nDistrict Attorney Doug Evans recused himself in the case of Curtis Flowers and as… [+2084 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Woman accuses Oregon Taxi driver of sexual assault in suit", "description": "EUGENE, Ore. (AP) — A Springfield woman has filed a $1.5 million lawsuit against Oregon Taxi and one of the company’s drivers, accusing the driver of sexual assault.", "url": "https://apnews.com/081ce89deaf8ed7bf195db27ce40a2d2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T22:40:29Z", "content": "EUGENE, Ore. (AP) A Springfield woman has filed a $1.5 million lawsuit against Oregon Taxi and one of the companys drivers, accusing the driver of sexual assault.\r\nThe Register-Guard reports the woman told Springfield police after the alleged incident, but no… [+1131 chars]"}]}