{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Atlético rallies to beat Barcelona and reach Super Cup final", "description": "JEDDAH, Saudi Arabia (AP) — Atlético Madrid scored two late goals to beat Barcelona 3-2 Thursday and reach the final of the revamped Spanish Super Cup in Saudi Arabia.", "url": "https://apnews.com/3b841475e3a41c1c123e2606bd748c1b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/9/5f/95f37b0b-8866-5279-bc1b-3c125d645888/5e179eede117a.image.jpg?crop=1703%2C958%2C0%2C129&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T21:22:12Z", "content": "Barcelona kept playing better but Atlético threatened on counterattacks, and it equalized with a penalty kick converted by Álvaro Morata in the 82nd after striker Víctor Vitolo Machín was fouled in a one-on-one situation with Barcelona goalkeeper Neto.\r\nAtlét… [+1073 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Former Nevada National Guard captain sentenced in shooting", "description": "RENO, Nev. (AP) — A former Nevada Air National Guard captain was sentenced up to six years in prison for shooting an unarmed teenager twice in the leg in 2017 after he approached a group of teenagers he said appeared…", "url": "https://apnews.com/41958f28fb3073e6728d6cb752f57490", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:18:43Z", "content": "RENO, Nev. (AP) A former Nevada Air National Guard captain was sentenced up to six years in prison for shooting an unarmed teenager twice in the leg in 2017 after he approached a group of teenagers he said appeared suspicious.\r\nJames Upton, 42, of Reno was fo… [+1121 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Officials alert health care providers of HIV surge", "description": "BOSTON (AP) — Massachusetts officials alerted health care providers to test frequently for HIV and to quickly report new infections to the Public Health Department.", "url": "https://apnews.com/4664b17656a4dded6e2fa3ea775c963e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:17:56Z", "content": "BOSTON (AP) Massachusetts officials alerted health care providers to test frequently for HIV and to quickly report new infections to the Public Health Department.\r\nOfficials discovered that there were 182 intravenous drug users who were affected in Lowell and… [+1085 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BOB CHRISTIE Associated Press", "title": "Arizona's water supply a major issue for legislative session", "description": "PHOENIX (AP) — Republican and Democratic Leaders of the Arizona House are again eyeing the state's water supply as a major issue for the coming legislative session that starts next week.", "url": "https://apnews.com/b2f22905327b4b6a71df744582e3f2a5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/97/69766a5c-1c3b-51a0-a78f-3752676c2892/5e179b724f016.image.jpg?crop=965%2C543%2C0%2C75&resize=965%2C543&order=crop%2Cresize", "publishedAt": "2020-01-09T21:11:10Z", "content": "PHOENIX (AP) Republican and Democratic Leaders of the Arizona House are again eyeing the state's water supply as a major issue for the coming legislative session that starts next week.\r\nGOP House Speaker Rusty Bowers and Democratic Minority Leader Charlene Fe… [+4718 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Inmate imprisoned for assault, weapons counts on the run", "description": "LINCOLN, Neb. (AP) — The hunt is on for an inmate who walked away from a low-level corrections center where he was serving up to 10 years for weapons and assault counts — including assault on a police officer.", "url": "https://apnews.com/99431fefe5048bf88c42adbac6973648", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:09:42Z", "content": "LINCOLN, Neb. (AP) The hunt is on for an inmate who walked away from a low-level corrections center where he was serving up to 10 years for weapons and assault counts including assault on a police officer.\r\nThe Nebraska Department of Correctional Services sai… [+785 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MICHAEL RUBINKAM Associated Press", "title": "Women with transplanted uterus gives birth to 'miracle' baby", "description": "A woman who gave birth to a boy she carried inside a transplanted womb said Thursday that the experimental procedure delivered a “miracle.”", "url": "https://apnews.com/b8c4a4da006bf965b6706dc7ac6962b4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:09:05Z", "content": "A woman who gave birth to a boy she carried inside a transplanted womb said Thursday that the experimental procedure delivered a miracle.\r\nJennifer Gobrecht and her husband, Drew Gobrecht, appeared Thursday at a news conference in Philadelphia. Their child, B… [+2640 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MEHDI FATTAHI and AYA BATRAWY Associated Press", "title": "On streets of Tehran, relief for now at no wider conflict", "description": "TEHRAN, Iran (AP) — Iranian newspapers proclaimed the country's attack on U.S. forces in Iraq to be \"a dark night for Americans,\" and Washington's \"first admission of failure in history.\" On the bustling streets of Tehran, however, there was relief…", "url": "https://apnews.com/4538ee9743166ddb9cbe31d420fb4fc0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/e/53/e537955f-baf0-53f0-9046-7e1679576651/5e179b73dcfc1.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T21:07:46Z", "content": "TEHRAN, Iran (AP) Iranian newspapers proclaimed the country's attack on U.S. forces in Iraq to be \"a dark night for Americans,\" and Washington's \"first admission of failure in history.\" On the bustling streets of Tehran, however, there was relief Thursday tha… [+6015 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Cervelli finalizes $2 million, 1-year contract with Marlins", "description": "MIAMI (AP) — Catcher Francisco Cervelli finalized a $2 million, one-year contract with the Miami Marlins on Thursday to provide depth behind Jorge Alfaro.", "url": "https://apnews.com/821b1b455219e897439f0f08688f03c1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/7/bf/7bf3eff5-fc37-5805-bc1d-d01f182cefab/5e179b8e9cbd9.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T21:06:54Z", "content": "FILE - In this Tuesday, April 30, 2019 file photo, Pittsburgh Pirates catcher Francisco Cervelli (29) looks to third in the first inning of a baseball game against the Texas Rangers in Arlington, Texas. Catcher Francisco Cervelli has finalized a $2 million, o… [+983 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Former sheriff's deputy pleads guilty in wife's beating", "description": "OLATHE, Kan. (AP) — A former Johnson County sheriff’s deputy who admitted beating his wife has pleaded guilty to aggravated battery.", "url": "https://apnews.com/c79486981c6586fdd42e1caa37b0abd0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:06:32Z", "content": "OLATHE, Kan. (AP) A former Johnson County sheriffs deputy who admitted beating his wife has pleaded guilty to aggravated battery.\r\nAs part of his plea deal Wednesday, two charges were dropped and prosecutors will recommend that Eric Leon Walker, 38, be senten… [+766 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Bill proposes under-21 cellphone ban to highlight gun limits", "description": "MONTPELIER, Vt. (AP) — A Vermont lawmaker has proposed a bill that would bar anyone under 21 from using or owning a cellphone — a move meant to draw attention to restrictions on guns.", "url": "https://apnews.com/d03d9d716ed066075df01371f6c4d3d5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:05:58Z", "content": "MONTPELIER, Vt. (AP) A Vermont lawmaker has proposed a bill that would bar anyone under 21 from using or owning a cellphone a move meant to draw attention to restrictions on guns.\r\nThe bill, introduced by Democratic Sen. John Rodgers, states that the Legislat… [+1296 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DENNIS WASZAK Jr. AP Pro Football Writer", "title": "Top seeds back in action as NFL's divisional round kicks off", "description": "NEW YORK (AP) — The bye-week breaks are over for the top two seeds in the AFC and NFC after a, well, wild wild-card weekend to open the NFL playoffs.", "url": "https://apnews.com/276e3e7c9cb35f0afe3894b6835f89ef", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/f/1c/f1c5cafa-0437-5770-8f4d-9b5466f46568/5e014a951838e.image.jpg?crop=1515%2C852%2C0%2C258&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T21:05:28Z", "content": "NEW YORK (AP) The bye-week breaks are over for the top two seeds in the AFC and NFC after a, well, wild wild-card weekend to open the NFL playoffs.\r\nThat means it's back to work for Lamar Jackson and the Baltimore Ravens. Same for Patrick Mahomes and the Kans… [+963 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Oklahoma agency says 572 will be state's newest area code", "description": "OKLAHOMA CITY (AP) — The Oklahoma Corporation Commission announced Thursday that 572 will be a new area code for 19 central Oklahoma counties in the 405 area, including Oklahoma County and Oklahoma City.", "url": "https://apnews.com/74819ea98310a65fab1ff021335a03f9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:03:58Z", "content": "OKLAHOMA CITY (AP) The Oklahoma Corporation Commission announced Thursday that 572 will be a new area code for 19 central Oklahoma counties in the 405 area, including Oklahoma County and Oklahoma City.\r\nThe area code overlay is similar to one adopted in 2011 … [+627 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Pedestrian bridges planned as part of international span", "description": "DETROIT (AP) — A design has been selected for five pedestrian bridges that will traverse a Detroit freeway as part of an international bridge project that will connect the city to Windsor, Ontario, Canada, officials announced Thursday.", "url": "https://apnews.com/fa80034fab74b36a200ea9ffb2dd40e8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T21:00:14Z", "content": "DETROIT (AP) A design has been selected for five pedestrian bridges that will traverse a Detroit freeway as part of an international bridge project that will connect the city to Windsor, Ontario, Canada, officials announced Thursday.\r\nThe spans over Interstat… [+886 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man with hammer fatally shot by officer near Alabama Walmart", "description": "SEMMES Ala. (AP) — An Alabama deputy fatally shot a man who was threatening the officer with a hammer outside a Walmart store on Thursday, authorities said.", "url": "https://apnews.com/4a25be17f5b76af6c452d8c0744329cd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:59:43Z", "content": "SEMMES Ala. (AP) An Alabama deputy fatally shot a man who was threatening the officer with a hammer outside a Walmart store on Thursday, authorities said.\r\nStore workers called to report a possible theft, and a deputy who was already at the Walmart saw a man … [+963 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Bald eagle lays egg in California nest watched via live feed", "description": "BIG BEAR LAKE, Calif. (AP) — A bald eagle in Southern California has laid an egg in a nest watched by nature lovers via an online live feed.", "url": "https://apnews.com/c4b1adf8ec0a351de3fb4b473bbb1390", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:55:47Z", "content": "BIG BEAR LAKE, Calif. (AP) A bald eagle in Southern California has laid an egg in a nest watched by nature lovers via an online live feed.\r\nThe egg appeared Wednesday evening in a tree overlooking Big Bear Lake east of Los Angeles.\r\nThe mother nestled over th… [+436 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "A champion skater struggles and resets life away from rink", "description": "TORONTO (AP) — For the better part of two decades, Kaetlyn Osmond knew exactly what she'd be doing every day. Her world was figure skating.", "url": "https://apnews.com/f3f6a2e7409d4036ad82480020ab2598", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/7/c0/7c0a0db3-80c7-51e9-aeef-1417fdf2090c/5e17985e3c1c3.image.jpg?crop=1753%2C986%2C0%2C97&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T20:50:26Z", "content": "\"I was terrified and angry, she said. I hated the way I looked and the way I felt. Feeling like the minute I saw the people I would be touring with, they would want nothing to do with me.\"\r\nHer social media posts began \"very selfishly,\" she said. \"I just want… [+1296 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "DALATOU MAMANE Associated Press", "title": "Suspected jihadists strike Niger military; 25 soldiers dead", "description": "NIAMEY, Niger (AP) — Islamic militants carried out another large assault on Niger's military Thursday, leaving at least 25 soldiers dead along with dozens of jihadists only a month after the worst attack of its kind in years, the military…", "url": "https://apnews.com/cdb2d18b02382b719243eff3d3b924e0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:49:20Z", "content": "NIAMEY, Niger (AP) Islamic militants carried out another large assault on Niger's military Thursday, leaving at least 25 soldiers dead along with dozens of jihadists only a month after the worst attack of its kind in years, the military said.\r\nThe latest viol… [+1858 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By RYAN TARINELLI Associated Press", "title": "New York advocates urge solitary confinement changes", "description": "ALBANY, N.Y. (AP) — New York advocates are pushing a measure this session that would ban placement of a prisoner in solitary confinement for more than 15 consecutive days.", "url": "https://apnews.com/babef31ba491ef0f34367d6d57e92517", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/4/3c/43c72d07-959b-5492-a934-93565c695eef/5e17956cd8beb.image.jpg?crop=1640%2C923%2C0%2C170&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T20:46:18Z", "content": "ALBANY, N.Y. (AP) New York advocates are pushing a measure this session that would ban placement of a prisoner in solitary confinement for more than 15 consecutive days.\r\nLegislation supporters chanted at the State Capitol on Thursday and urged lawmakers to p… [+2239 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By The Associated Press", "title": "At least 4 airliners have been shot down since 1983", "description": "If an Iranian missile brought down a Ukrainian airliner, it would be at least the fifth such shootdown since the early 1980s.", "url": "https://apnews.com/1df62a0bc7048f988f89c47b36548c2b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/7/5f/75fb4479-77b2-5011-a123-8afad420a7b1/5e17911104007.image.jpg?crop=1818%2C1023%2C0%2C58&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-09T20:41:27Z", "content": "If an Iranian missile brought down a Ukrainian airliner, it would be at least the fifth such shootdown since the early 1980s.\r\nU.S. officials said Thursday that it was highly likely that an Iranian anti-aircraft missile downed the jetliner late Tuesday, killi… [+2426 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Stolen credit card info gets a Camp Verde inmate out of jail", "description": "CAMP VERDE, Ariz. (AP) — Yavapai County Sheriff’s officials say a woman has been arrested for allegedly using stolen credit card information to bail her boyfriend out of jail in Camp Verde.", "url": "https://apnews.com/d662d65b8fed3b06161afbeddb283d3d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-09T20:40:58Z", "content": "CAMP VERDE, Ariz. (AP) Yavapai County Sheriffs officials say a woman has been arrested for allegedly using stolen credit card information to bail her boyfriend out of jail in Camp Verde.\r\nThey say 30-year-old Jasmine Sizelove is being held on suspicion of fra… [+979 chars]"}]}