{"status": "ok", "totalResults": 85, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MEG KINNARD Associated Press", "title": "New to politics, SC Lt. Gov. Evette reflects on 1st year", "description": "COLUMBIA, S.C. (AP) — It's not a path she predicted during her decades founding and running a successful business. But, wrapping up her first year as South Carolina’s lieutenant governor, Pamela Evette said she's energized by the progress she and…", "url": "https://apnews.com/cd11171d65988892eb55f22fa9855957", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/5a/65ae3552-b212-5d75-a63f-6b95c21f509c/5e14b5e93a9ed.image.jpg?crop=1765%2C993%2C0%2C90&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T16:42:20Z", "content": "COLUMBIA, S.C. (AP) It's not a path she predicted during her decades founding and running a successful business. But, wrapping up her first year as South Carolinas lieutenant governor, Pamela Evette said she's energized by the progress she and Gov. Henry McMa… [+4710 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MICHAEL MAROT", "title": "Spegal leads run of state title players on all-state teams", "description": "INDIANAPOLIS (AP) — Charlie Spegal spent four years breaking records and compiling honors.", "url": "https://apnews.com/3aa330051f544b85c4673c5f87528285", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-07T16:40:56Z", "content": "And the state championship teams were again well-represented.\r\nWestern Boone quarterback Spencer Wright, the Mr. Football runner-up, and three of his teammates receiver Connor Hole, offensive lineman Casey Foster and linebacker Brett Wethington all were chose… [+1406 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Attorney for estranged husband of long-missing Connecticut mother of five says he has been arrested on murder charge", "description": "FARMINGTON, Conn. (AP) — Attorney for estranged husband of long-missing Connecticut mother of five says he has been arrested on murder charge.", "url": "https://apnews.com/591fdc254e4fbd0f077022f5650e3798", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:40:54Z", "content": "Please purchase a subscription to continue reading.\r\nA subscription is required to continue reading.\r\nIf you are a current subscriber please click Sign Up or Login to activate your digital access. If not, please click Sign Up to subscribe.\r\nIf you are a curre… [+138 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge denies attempt by cities to delay Ohio's new gun law", "description": "AKRON, Ohio (AP) — A judge turned down a request by several Ohio cities to delay part of the state's new gun law that will allow gun owners who believe their rights have been violated to sue a municipality and…", "url": "https://apnews.com/8de58f60385004ea8cb3d3159c930e50", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:36:24Z", "content": "AKRON, Ohio (AP) A judge turned down a request by several Ohio cities to delay part of the state's new gun law that will allow gun owners who believe their rights have been violated to sue a municipality and seek damages.\r\nThe cities' challenge of the law sai… [+694 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JENNIFER McDERMOTT Associated Press", "title": "Religious leaders ask politicians to work to reduce poverty", "description": "PROVIDENCE, R.I. (AP) — Religious leaders in Rhode Island are asking the state's politicians to pass bills this year to address poverty.", "url": "https://apnews.com/bed8bd7f3f44339cc6bcf2b745a9fbe6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:30:48Z", "content": "PROVIDENCE, R.I. (AP) Religious leaders in Rhode Island are asking the state's politicians to pass bills this year to address poverty.\r\nMembers of the Rhode Island Interfaith Coalition to Reduce Poverty will march to the Statehouse and gather in the rotunda T… [+1646 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Predators hire former Devils coach John Hynes as new coach", "description": "NASHVILLE, Tenn. (AP) — The Nashville Predators have hired former New Jersey Devils coach John Hynes as the third coach in franchise history after firing Peter Laviolette.", "url": "https://apnews.com/ed26831c21784e465384966f6516a897", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/1/dc/1dc64c4d-3fa4-5be2-ac95-8576cde1918c/5e14b282b7880.image.jpg?resize=1120%2C630", "publishedAt": "2020-01-07T16:29:21Z", "content": "NASHVILLE, Tenn. (AP) The Nashville Predators have hired former New Jersey Devils coach John Hynes as the third coach in franchise history after firing Peter Laviolette.\r\nThe Predators announced the hiring Tuesday morning before a morning skate. Nashville hos… [+948 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Feds to seek death penalty in Virginia gang killings", "description": "ALEXANDRIA, Va, (AP) — Federal prosecutors will pursue a death sentence against a northern Virginia gang leader accused of killing two teenagers.", "url": "https://apnews.com/9c1226659127352174c6ee0dc64d3526", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T16:26:45Z", "content": "ALEXANDRIA, Va, (AP) Federal prosecutors will pursue a death sentence against a northern Virginia gang leader accused of killing two teenagers.\r\nThe U.S. attorney in Alexandria, G. Zachary Terwilliger, filed papers Monday indicating the government's intent to… [+1313 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man accused of attempted sex assault, computer charge", "description": "NASHUA, N.H. (AP) — A New Hampshire man has been accused of traveling to meet a person he thought was teenage boy for sex, police in Nashua said.", "url": "https://apnews.com/cbe7a77a57b1bd2a054a8db32ed6449b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:25:28Z", "content": "NASHUA, N.H. (AP) A New Hampshire man has been accused of traveling to meet a person he thought was teenage boy for sex, police in Nashua said.\r\nRobert Gagne, 46, of Manchester, was arrested Friday on charges of attempted felonious sexual assault and certain … [+980 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "13 on Washington's March presidential primary ballot", "description": "SEATTLE (AP) — Thirteen Democratic candidates will appear on Washington’s March 10 presidential primary ballot. For Republicans, President Donald Trump will be the sole listed choice.", "url": "https://apnews.com/34b21277f72fb490c77b5e1e29a87f98", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:22:25Z", "content": "SEATTLE (AP) Thirteen Democratic candidates will appear on Washingtons March 10 presidential primary ballot. For Republicans, President Donald Trump will be the sole listed choice.\r\nThe Seattle Times reports the primary lineups were announced by the state Dem… [+1971 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Lawmaker joins Democratic primary field for auditor general", "description": "HARRISBURG, Pa. (AP) — A seven-term state lawmaker from central Pennsylvania said Monday that he will seek the Democratic nomination to run for the open state auditor general's office this year.", "url": "https://apnews.com/cf36fbf40448dde1356997deed7b32e0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:22:11Z", "content": "HARRISBURG, Pa. (AP) A seven-term state lawmaker from central Pennsylvania said Monday that he will seek the Democratic nomination to run for the open state auditor general's office this year.\r\nScott Conklin enters a crowded field ahead of Pennsylvania's Feb.… [+1063 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Vocational rehabilitation agency eliminates waiting list", "description": "CONCORD, N.H. (AP) — A state agency that helps people with disabilities find and keep jobs has eliminated its waiting list for services about a year and a half after it was overhauled due to significant financial troubles.", "url": "https://apnews.com/1d56a91c33682b3bce2ff9f284c64bdf", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:21:16Z", "content": "CONCORD, N.H. (AP) A state agency that helps people with disabilities find and keep jobs has eliminated its waiting list for services about a year and a half after it was overhauled due to significant financial troubles.\r\nThe Bureau of Vocational Rehabilitati… [+479 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Nashville Predators hire former New Jersey Devils coach John Hynes as 3rd coach in franchise history", "description": "Nashville Predators hire former New Jersey Devils coach John Hynes as 3rd coach in franchise history.", "url": "https://apnews.com/44b81637712f8c6ca8ddd5b2722efb15", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-07T16:21:02Z", "content": "With the best record in the Western Conference, the Blues are in great position. But the hockey gets more intense, the games tighter, as teams jockey for position in the New Year."}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": null, "title": "Vivint Smart Home Wins 2020 IoT Breakthrough Award for Innovative Outdoor Camera - Associated Press", "description": "Vivint Smart Home Wins 2020 IoT Breakthrough Award for Innovative Outdoor Camera Associated Press", "url": "https://apnews.com/Business%20Wire/2d5356e422f24aa69c65261912b8dbe0", "urlToImage": "https://apnews.com/images/PaidContent3.png", "publishedAt": "2020-01-07T16:20:46Z", "content": "PROVO, Utah--(BUSINESS WIRE)--Jan 7, 2020--\r\nVivint Smart Home, a leading smart home company in North America, today announced that IoT Breakthrough named the Vivint Outdoor Camera Pro its Connected Home Security Product of the Year for 2020. The Vivint Outdo… [+3285 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Divers to remove fuel from derailed train in Idaho river", "description": "BONNERS FERRY, Idaho (AP) — Idaho authorities have confirmed two engines are still in a northern Idaho river after a rock slide derailed a train on New Year's Day.", "url": "https://apnews.com/9451369da457803462e0ce6fa7abae52", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:16:32Z", "content": "BONNERS FERRY, Idaho (AP) Idaho authorities have confirmed two engines are still in a northern Idaho river after a rock slide derailed a train on New Year's Day.\r\nA crew of divers began the process of removing about 1,900 gallons (7,200 liters) of fuel from a… [+1011 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Archery deer hunts to be allowed in St. Louis Co. parks", "description": "CLAYTON, Mo. (AP) — The St. Louis County Council has agreed to allow archery hunting of deer in county parks starting in the fall in an effort to thin the growing deer heard in the region.", "url": "https://apnews.com/5e2be9e64063a12b7bf8bff549eb4689", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:12:44Z", "content": "CLAYTON, Mo. (AP) The St. Louis County Council has agreed to allow archery hunting of deer in county parks starting in the fall in an effort to thin the growing deer heard in the region.\r\nThe St. Louis Post-Dispatch reported that the legislation became law la… [+850 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Employee fired after tweeting criticism of company's gift", "description": "WINONA, Minn. (AP) — An employee of a Minnesota company has been fired after tweeting criticism of the firm's holiday gift to its workers.", "url": "https://apnews.com/ba8df2d249bd00d635f4bbcc7a727b4c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:09:53Z", "content": "WINONA, Minn. (AP) An employee of a Minnesota company has been fired after tweeting criticism of the firm's holiday gift to its workers.\r\nA branch manager for Fastenal in Canada was fired just before New Year's Day after he posted a tweet chiding the company … [+1117 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "3 teens arrested in killing of 16-year-old girl", "description": "WEST SACRAMENTO, Calif. (AP) — Three teenagers have been arrested in the the fatal shooting of a 16-year-old girl on a West Sacramento trail, authorities said.", "url": "https://apnews.com/8bf3ce4f8f675d5fc5a4e389ebd91fd3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:08:25Z", "content": "WEST SACRAMENTO, Calif. (AP) Three teenagers have been arrested in the the fatal shooting of a 16-year-old girl on a West Sacramento trail, authorities said.\r\nA boy from Elk Grove and another from West Sacramento are each facing possible charges of homicide, … [+757 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Scientist accused in trade secret theft back in US for trial", "description": "PHILADELPHIA (AP) — A Chinese scientist accused of participating in a conspiracy to steal trade secrets from pharmaceutical giant GlaxoSmithKline has been returned to the United States to stand trial in Philadelphia.", "url": "https://apnews.com/fcf5e36b8fe34c863114355f001982ad", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:05:48Z", "content": "PHILADELPHIA (AP) A Chinese scientist accused of participating in a conspiracy to steal trade secrets from pharmaceutical giant GlaxoSmithKline has been returned to the United States to stand trial in Philadelphia.\r\nThe Philadelphia Inquirer reported Tuesday … [+757 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By STEVE REED AP Sports Writer", "title": "AP source: Panthers completing coaching deal with Matt Rhule", "description": "CHARLOTTE, N.C. (AP) — A person familiar with the situation says the Carolina Panthers are completing a contract to hire Baylor's Matt Rhule as their coach.", "url": "https://apnews.com/f3a05b618429407b0a1e57179bffefe7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/b/d1/bd19d669-09a2-555d-8d9b-3a27777a11c1/5e14aecebf6ef.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T16:04:31Z", "content": "CHARLOTTE, N.C. (AP) A person familiar with the situation says the Carolina Panthers are completing a contract to hire Baylor's Matt Rhule as their coach.\r\nThe person spoke to The Associated Press on Tuesday on condition of anonymity because the deal is not d… [+1372 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Former Lancaster County prosecutor Gary Lacey dies at 77", "description": "GOTHENBURG, Neb. (AP) — A longtime prosecutor who helped create a care center for child victims of assault and violence in Lincoln and Lancaster County has died.", "url": "https://apnews.com/0aec390439c0fe8ed1bcd01fb77c68c3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:04:12Z", "content": "GOTHENBURG, Neb. (AP) A longtime prosecutor who helped create a care center for child victims of assault and violence in Lincoln and Lancaster County has died.\r\nGary Lacey passed away Thursday at Gothenburg Health, Teresa Peckham of Blase-Strauser Memorial Ch… [+1135 chars]"}]}