{"status": "ok", "totalResults": 44, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kentucky school finance director accused of embezzling $1.5M", "description": "FRANKFORT, Ky. (AP) — A Kentucky public school district's finance director has been accused of embezzling $1.5 million from the system over nearly 10 years, district officials confirmed.", "url": "https://apnews.com/b220a914bf4ca8c1402f9f733e6c5d5d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T12:08:52Z", "content": "FRANKFORT, Ky. (AP) A Kentucky public school district's finance director has been accused of embezzling $1.5 million from the system over nearly 10 years, district officials confirmed.\r\nFranklin County Schools administrator Lesley Wade resigned last summer am… [+1204 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Shooting in southern Minnesota leaves officer, suspect hurt", "description": "WASECA, Minn. (AP) — A police officer and a suspect have been shot and wounded in southern Minnesota, officials said.", "url": "https://apnews.com/8a13828e278b347af4a555b4237c9105", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T12:05:46Z", "content": "WASECA, Minn. (AP) A police officer and a suspect have been shot and wounded in southern Minnesota, officials said.\r\nPolice responded to a report of a disturbance in a residential neighborhood in Waseca, where the shooting took place about 8 p.m. Monday, the … [+566 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man gets 6 months in jail for pot delivery to prison inmate", "description": "LINCOLN, Neb. (AP) — An Omaha man has been sentenced for smuggling marijuana to an inmate at the Nebraska State Penitentiary in Lincoln.", "url": "https://apnews.com/6fba05206e7589edc172caff9f6dc400", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T12:01:27Z", "content": "LINCOLN, Neb. (AP) An Omaha man has been sentenced for smuggling marijuana to an inmate at the Nebraska State Penitentiary in Lincoln.\r\nRobert Trelles, 48, was sentenced Monday to six months in jail. He'd pleaded no contest to conveyance of an article to an i… [+531 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "12 climate activists on trial for stunt at Swiss bank office", "description": "GENEVA (AP) — A dozen climate activists have gone on trial for storming a Credit Suisse office in Lausanne, Switzerland, and playing tennis inside, part of a protest against the bank’s investments in fossil fuels.", "url": "https://apnews.com/04e02f992629110e47e3fa018a4c77df", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-07T12:01:22Z", "content": "GENEVA (AP) A dozen climate activists have gone on trial for storming a Credit Suisse office in Lausanne, Switzerland, and playing tennis inside, part of a protest against the banks investments in fossil fuels.\r\nIn a trial billed as the first of its kind in S… [+1060 chars]"}]}