{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man, attacker killed in Chicago gunfight, third man charged", "description": "CHICAGO (AP) — A man on probation for a gun violation was charged Tuesday with murder for taking part in a Chicago gun battle that left two dead.", "url": "https://apnews.com/f115ef9d6689b84533f6c1b40ce30d7c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T23:18:44Z", "content": "CHICAGO (AP) A man on probation for a gun violation was charged Tuesday with murder for taking part in a Chicago gun battle that left two dead.\r\nMarlow Rainey, 20, is being held without bond for his role in the fatal shooting of a concealed-carry holder. Auth… [+1014 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By CLAUDIA TORRENS Associated Press", "title": "Mexico former top cop in NY plea talks over drug bribe case", "description": "NEW YORK (AP) — Mexican former top security official Genaro García Luna is in talks on a possible plea agreement with federal prosecutors in New York, where he is charged with accepting millions in drug-money bribes from the notorious Sinaloa…", "url": "https://apnews.com/6bded47517cdbe70929f74c13fe7e69c", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/b/71/b713e144-1d23-5f60-8993-06b9d25172d2/5df07efd7fb23.image.jpg?crop=1733%2C975%2C0%2C110&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T23:14:15Z", "content": "NEW YORK (AP) Mexican former top security official Genaro García Luna is in talks on a possible plea agreement with federal prosecutors in New York, where he is charged with accepting millions in drug-money bribes from the notorious Sinaloa cartel of convicte… [+2578 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Las Vegas reports cyber attack; Extent of breach unclear", "description": "LAS VEGAS (AP) — Las Vegas officials said Tuesday that that a cyber attack breached the city's computer systems, but it wasn't immediately clear if any sensitive data was compromised.", "url": "https://apnews.com/962ebf1d3b5a8256cbe47be4c1c0bf40", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T23:13:18Z", "content": "LAS VEGAS (AP) Las Vegas officials said Tuesday that that a cyber attack breached the city's computer systems, but it wasn't immediately clear if any sensitive data was compromised.\r\nCity officials were alerted to the breach around 4:30 a.m., city spokesman D… [+607 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "WH correspondents protest lack of word about Saudi meeting", "description": "NEW YORK (AP) — The White House Correspondents Association lodged a protest Tuesday against the Trump administration for failing to disclose a meeting the president had in the Oval Office with Saudi Arabia's vice minister of defense.", "url": "https://apnews.com/24bc622ed9c266baee164a9f65852742", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/custom/image/aacc4e10-0064-11e7-adc2-d3321407a1f8.jpg", "publishedAt": "2020-01-07T23:10:40Z", "content": "NEW YORK (AP) The White House Correspondents Association lodged a protest Tuesday against the Trump administration for failing to disclose a meeting the president had in the Oval Office with Saudi Arabia's vice minister of defense.\r\nJonathan Karl, president o… [+894 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BERNIE WILSON AP Sports Writer", "title": "Dutcher's No. 7 Aztecs once again San Diego's hottest ticket", "description": "SAN DIEGO (AP) — San Diego State basketball is back to being the hottest ticket in town.", "url": "https://apnews.com/0e24471a201df693afa3a2c5a3f6f63e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/c/1a/c1a068c1-bfb2-5573-a951-c8f84485f2e1/5e1511da3b4bc.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T23:07:50Z", "content": "SAN DIEGO (AP) San Diego State basketball is back to being the hottest ticket in town.\r\nViejas Arena is hopping again because the undefeated and seventh-ranked Aztecs are playing as well as they did during their two Sweet 16 seasons during the last decade, in… [+4723 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By AMANDA SEITZ Associated Press", "title": "Instagram pulls account impersonating US government agency", "description": "CHICAGO (AP) — An Instagram account masquerading as a U.S. government news agency was used to promote misinformation about potential fallout from America's targeted killing last week of Iran’s top general.", "url": "https://apnews.com/a11212e6f54bfc6b7889540ff8620ec6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/7c/67ccbff1-6008-5de3-a313-6feeb7335a90/5e13ae0176dd7.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T23:05:59Z", "content": "CHICAGO (AP) An Instagram account masquerading as a U.S. government news agency was used to promote misinformation about potential fallout from America's targeted killing last week of Irans top general.\r\nThe fraudulent Instagram account had nearly a half-mill… [+2239 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MEAD GRUVER Associated Press", "title": "Montana grants 65-day extension for Navajo-owned coal mine", "description": "CHEYENNE, Wyo. (AP) — A Navajo Nation company may continue operating a coal mine for two more months amid ongoing negotiations over the terms of a state permit, Montana officials announced Tuesday in granting an extension that keeps about 300…", "url": "https://apnews.com/05a912c5b85fb2f8ad21272c5f6d615a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T23:05:28Z", "content": "CHEYENNE, Wyo. (AP) A Navajo Nation company may continue operating a coal mine for two more months amid ongoing negotiations over the terms of a state permit, Montana officials announced Tuesday in granting an extension that keeps about 300 miners at work.\r\nT… [+3317 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JONATHAN LANDRUM Jr. AP Entertainment Writer", "title": "Celebs donate millions to aid Australia wildfire efforts", "description": "LOS ANGELES (AP) — Elton John and Chris Hemsworth are among the celebrities donating big bucks to help aid the efforts for the engulfing wildfires in Australia.", "url": "https://apnews.com/dfe94d01b4bce789fdded0de0809d44e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/d/c7/dc7b6fa5-2794-5328-953d-f05d509eaf61/5e1511e2c9e0f.image.jpg?crop=1217%2C685%2C0%2C509&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T23:04:48Z", "content": "LOS ANGELES (AP) Elton John and Chris Hemsworth are among the celebrities donating big bucks to help aid the efforts for the engulfing wildfires in Australia.\r\nHemsworth, the Australian actor, took to social media on Monday to share that he will donate $1 mil… [+2449 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JOSHUA GOODMAN Associated Press", "title": "Rubio urges Trump to avoid Maduro as stalemate drags on", "description": "MIAMI (AP) — Sen. Marco Rubio on Tuesday urged the Trump administration to stay the course in Venezuela and reject the temptation to engage directly with Nicolas Maduro as the embattled socialist rides out growing international condemnation and punishing U.S.…", "url": "https://apnews.com/e640705c3bb6919bfb94ad3aa29d9555", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T23:03:04Z", "content": "MIAMI (AP) Sen. Marco Rubio on Tuesday urged the Trump administration to stay the course in Venezuela and reject the temptation to engage directly with Nicolas Maduro as the embattled socialist rides out growing international condemnation and punishing U.S. s… [+3409 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Arkansas panel issues recommendations on state's levees", "description": "LITTLE ROCK, Ark. (AP) — An Arkansas panel formed after historic flooding last year on Tuesday called for increased oversight of the state's levees, consolidation of some levee districts and state grants to make improvements.", "url": "https://apnews.com/7117cec1c85574beb5cf020e3ea4ddd3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T23:02:02Z", "content": "LITTLE ROCK, Ark. (AP) An Arkansas panel formed after historic flooding last year on Tuesday called for increased oversight of the state's levees, consolidation of some levee districts and state grants to make improvements.\r\nThe Arkansas Levee Task Force pres… [+1131 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "TODD RICHMOND Associated Press Writer", "title": "Military launched probe of Wisconsin Guard commander", "description": "MADISON, Wis. (AP) — The National Guard's headquarters opened an investigation this fall into allegations that the Wisconsin National Guard's top commander improperly initiated an internal investigation in a sexual assault case even as he was under scrutiny f…", "url": "https://apnews.com/efcc1d8ef322da80a3b084fa4781b617", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-07T22:58:45Z", "content": "MADISON, Wis. (AP) The National Guard's headquarters opened an investigation this fall into allegations that the Wisconsin National Guard's top commander improperly initiated an internal investigation in a sexual assault case even as he was under scrutiny for… [+2493 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Stewart appointed to state school board", "description": "MONTGOMERY, Ala. (AP) — Retired university dean and actress Tommie “Tonea\" Stewart, known for roles in films such as “A Time to Kill\" and “Just Mercy,\" has been appointed to the Alabama school board, Gov. Kay Ivey's office announced Monday.", "url": "https://apnews.com/4bbdd8afa1cb9c1ec3c433e96ddd9c1c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T22:58:31Z", "content": "MONTGOMERY, Ala. (AP) Retired university dean and actress Tommie Tonea\" Stewart, known for roles in films such as A Time to Kill\" and Just Mercy,\" has been appointed to the Alabama school board, Gov. Kay Ivey's office announced Monday.\r\nIvey appointed Stewart… [+1740 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JOHN WAWROW AP Sports Writer", "title": "Bills have work to do in offseason after playoff collapse", "description": "ORCHARD PARK, N.Y. (AP) — The lingering disappointment following an AFC wild-card playoff collapse at Houston won't deter Buffalo Bills coach Sean McDermott from having confidence in his team's young foundation.", "url": "https://apnews.com/9f05cb9b1fb5a07d105b84b541613f2f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/7/d0/7d0f1312-df95-5fbf-8adb-b47c847d4679/5dfa497e179cc.image.jpg?crop=1761%2C991%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T22:57:01Z", "content": "It's no surprise, then, that much of the end-of-season session focused on Allen, whose season-long inconsistencies were on display in his playoff debut.\r\nAllen followed a strong first half against the Texans by melting down over the final two quarters and ove… [+1120 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ZEKE MILLER and STEVE PEOPLES Associated Press", "title": "Dueling Trump, Bloomberg 2020 ads to air during Super Bowl", "description": "WASHINGTON (AP) — Americans looking for an escape from the nation's politically charged political environment won't find it in next month's Super Bowl.", "url": "https://apnews.com/726626001a8e4790fa4c84d4e2e3b827", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/d/e0/de0af987-ad4e-548b-b3d2-4609abff91ab/5e1510739a2dc.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T22:54:40Z", "content": "WASHINGTON (AP) Americans looking for an escape from the nation's politically charged political environment won't find it in next month's Super Bowl.\r\nDueling ads from President Donald Trump and former New York City Mayor Michael Bloomberg are set to run duri… [+1904 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BARRY WILNER AP Pro Football Writer", "title": "Head coaching hires ranging from experienced to newcomers", "description": "The Cowboys and Redskins went the experience route in their head coaching searches. The Giants and Panthers apparently are comfortable with newcomers to the job.", "url": "https://apnews.com/daeceb11188a99fbbdf4a1b1a5608177", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/6/4d/64dff22b-4c5b-50d9-8124-e4946c91d96b/5e13647e830a4.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T22:54:02Z", "content": "The Cowboys and Redskins went the experience route in their head coaching searches. The Giants and Panthers apparently are comfortable with newcomers to the job.\r\nDallas replaced Jason Garrett with a Super Bowl winner, Mike McCarthy, who was as successful in … [+4658 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Wasilla state representative will not seek re-election", "description": "ANCHORAGE, Alaska (AP) — A state representative from Wasilla will not seek re-election.", "url": "https://apnews.com/3abd6fa2e5db4953f50e18addecb0fb0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T22:51:18Z", "content": "ANCHORAGE, Alaska (AP) A state representative from Wasilla will not seek re-election.\r\nRepublican Colleen Sullivan-Leonard said Tuesday she would not seek to retain her seat, the Anchorage Daily News reported.\r\nSullivan Leonard is the oldest daughter of forme… [+704 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JOSH DUBOW AP Pro Football Writer", "title": "Jimmy Garoppolo ready for 1st playoff start for 49ers", "description": "SANTA CLARA, Calif. (AP) — Jimmy Garoppolo's postseason experience consists of a couple of garbage-time handoffs for New England during the 2014 AFC championship game that is remembered far more for the controversy surrounding deflated footballs.", "url": "https://apnews.com/104351a7ee4ae899bfc64a59c21e3671", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/8/73/87345aed-5c51-570e-8f28-ad3f4f6af5b1/5e150a5a484aa.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T22:42:34Z", "content": "SANTA CLARA, Calif. (AP) Jimmy Garoppolo's postseason experience consists of a couple of garbage-time handoffs for New England during the 2014 AFC championship game that is remembered far more for the controversy surrounding deflated footballs.\r\nGaroppolo wil… [+4282 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TALI ARBEL, BARBARA ORTUTAY and JOSEPH PISANI AP Business Writers", "title": "Invitation to Ivanka Trump draws backlash at big tech show", "description": "LAS VEGAS (AP) — The nation's largest consumer electronics show on Tuesday hosts Ivanka Trump as a keynote speaker — a choice that drew scorn from many women in technology.", "url": "https://apnews.com/4f9eba1de5fa45cdb800334bc4c5fa60", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/1/4a/14a00764-a424-52ec-b685-703582fe61d8/5e150a869f06d.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T22:41:26Z", "content": "LAS VEGAS (AP) The nation's largest consumer electronics show on Tuesday hosts Ivanka Trump as a keynote speaker a choice that drew scorn from many women in technology.\r\nThe annual CES tech gathering in Las Vegas has long taken criticism over diversity issues… [+4171 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Officers to ride school buses in effort to bridge community", "description": "WOOSTER, Ohio (AP) — Ohio police officers will begin riding school buses in an effort to enhance relationships with students and increase safety, a school district announced Tuesday.", "url": "https://apnews.com/5244710fe4000001896c59b765a0fc6b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T22:39:58Z", "content": "WOOSTER, Ohio (AP) Ohio police officers will begin riding school buses in an effort to enhance relationships with students and increase safety, a school district announced Tuesday.\r\nThe Wooster Police Department will place officers on buses at random times in… [+560 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kansas Supreme Court plans to swear in new justice Kan. 24", "description": "TOPEKA, Kan. (AP) — The Kansas Supreme Court plans to swear in a new justice Jan. 24.", "url": "https://apnews.com/a156e0e5c91f8515b1d67ea1b2b13467", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/0/d5/0d58da60-c6c0-5830-8668-911402bf9714/5df7faeccce39.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T22:39:39Z", "content": "TOPEKA, Kan. (AP) The Kansas Supreme Court plans to swear in a new justice Jan. 24.\r\nEvelyn Wilson is set to take her seat on the seven-member high court a little more than a month after Gov. Laura Kelly announced Wilson's appointment. The court is planning t… [+830 chars]"}]}