{"status": "ok", "totalResults": 74, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "GOP leader says he doubts toll can can pass the legislature", "description": "HARTFORD, Conn. (AP) — The Republican leader of the Connecticut Senate said Monday he doubts a transportation bill that includes tolls can be passed in the General Assembly, despite optimism expressed by Democratic Gov. Ned Lamont.", "url": "https://apnews.com/d4a5e091e601e25746d7942c4f17adb7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:21:45Z", "content": "HARTFORD, Conn. (AP) The Republican leader of the Connecticut Senate said Monday he doubts a transportation bill that includes tolls can be passed in the General Assembly, despite optimism expressed by Democratic Gov. Ned Lamont.\r\nSenate Minority Leader Len F… [+1500 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Detroit man cleared after nearly 30 years in prison", "description": "DETROIT (AP) — A judge on Monday dismissed the 1991 conviction of a man who spent nearly 30 years in prison for an attack on a Detroit woman in a car.", "url": "https://apnews.com/4c28fc6de1c4a32bcef5e663ced8077a", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-13T21:20:19Z", "content": "DETROIT (AP) A judge on Monday dismissed the 1991 conviction of a man who spent nearly 30 years in prison for an attack on a Detroit woman in a car.\r\nGerry Thomas, who was helped by law schools in Michigan and New York, has long maintained his innocence. The … [+1198 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DAVE CAMPBELL AP Pro Football Writer", "title": "Zimmer, Vikings aim to get over hump with changes inevitable", "description": "MINNEAPOLIS (AP) — For the first time in his six years with the Minnesota Vikings, coach Mike Zimmer told his assistants to take a break right after the end of the season before the staff reconvenes in a week or…", "url": "https://apnews.com/5b783768a14a21b0d221cd1c96d069d9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/0/0e/00ed3048-557d-5b29-8498-8b0129750405/5e1ce509300de.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T21:19:57Z", "content": "I like the scheme, I like the continuity that we have offensively with the coaches, and I feel like if we add a couple more pieces and continue to work on the execution of staying with the same play calls, the same system, the same motions and formations and … [+1235 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Crews restoring natural gas serve after New Hampshire outage", "description": "SALEM, N.H. (AP) — Technicians were working to restore natural gas service to about 325 customers in a New Hampshire city Monday after a line was damaged by a contractor.", "url": "https://apnews.com/f3286248e19108013b85328d44f0f850", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:16:27Z", "content": "SALEM, N.H. (AP) Technicians were working to restore natural gas service to about 325 customers in a New Hampshire city Monday after a line was damaged by a contractor.\r\nThe customers of Unitil lost service in the South Broadway section of Salem at about 11:3… [+835 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Indiana House backs no test scores in teacher evaluations", "description": "INDIANAPOLIS (AP) — Schools would no longer be required to use student standardized test scores in teacher evaluations under a bill approved by the Indiana House.", "url": "https://apnews.com/117e6f431516ea744617dd710ef7ac79", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:15:55Z", "content": "INDIANAPOLIS (AP) Schools would no longer be required to use student standardized test scores in teacher evaluations under a bill approved by the Indiana House.\r\nThe 100-0 vote on Monday would repeal a state mandate dating from a 2011 Republican-driven educat… [+1196 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By KEN MILLER Associated Press", "title": "Oklahoma attorney general sues distributors of opioids", "description": "OKLAHOMA CITY (AP) — Oklahoma Attorney General Mike Hunter on Monday brought a lawsuit against three distributors of opioids after winning a lawsuit against one drug manufacturer and reaching pretrial settlements in other cases.", "url": "https://apnews.com/74ccdfc8cb39208d376f8f514724193e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-13T21:13:58Z", "content": "OKLAHOMA CITY (AP) Oklahoma Attorney General Mike Hunter on Monday brought a lawsuit against three distributors of opioids after winning a lawsuit against one drug manufacturer and reaching pretrial settlements in other cases.\r\nHunter filed the lawsuit in Cle… [+2374 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "LA Police confiscate more than $300K in fake beauty products", "description": "LOS ANGELES (AP) — The Los Angles Police Department seized more than $300,000 in counterfeit makeup and beauty products including items purported to be from Kylie Jenner, authorities said.", "url": "https://apnews.com/5ad21da5db5c37c824c4fa7b9ed0eb68", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:13:31Z", "content": "LOS ANGELES (AP) The Los Angles Police Department seized more than $300,000 in counterfeit makeup and beauty products including items purported to be from Kylie Jenner, authorities said.\r\nThe police confiscated the products in downtown LA's Fashion District l… [+906 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Top young US men's players uncertain for Olympic soccer", "description": "CHICAGO (AP) — If the U.S. qualifies for this year's Olympic men's soccer tournament, it might decide that Christian Pulisic is better off remaining with Chelsea than going to Tokyo.", "url": "https://apnews.com/0c345f97fbd54332d4f9a8fc6b11e7c8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-13T21:12:01Z", "content": "CHICAGO (AP) If the U.S. qualifies for this year's Olympic men's soccer tournament, it might decide that Christian Pulisic is better off remaining with Chelsea than going to Tokyo.\r\n\"We might have the influence of a player going to the Olympics but not playin… [+1171 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Authorities: Inmate attacked and killed at Arkansas prison", "description": "BRICKEYS, Ark. (AP) — Authorities said Monday an inmate was stabbed to death at an east Arkansas prison over the weekend.", "url": "https://apnews.com/5b84ff1ccfd88c0e7a12d71cb114ba92", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:10:11Z", "content": "BRICKEYS, Ark. (AP) Authorities said Monday an inmate was stabbed to death at an east Arkansas prison over the weekend.\r\nThe Arkansas Department of Corrections said Carl Luke Lowe was buffing the floors Sunday night at the East Arkansas Regional Unit in Lee C… [+749 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By KATHY McCORMACK Associated Press", "title": "Drug charge to be dropped against Patriots safety Chung", "description": "CONCORD, N.H. (AP) — A cocaine possession charge against New England Patriots safety Patrick Chung will be dropped with the understanding that he will undergo periodic drug testing and perform 40 hours of community service, a prosecutor said Monday.", "url": "https://apnews.com/099f66e17ca345c723ffb43ea0cd6021", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-13T21:09:32Z", "content": "CONCORD, N.H. (AP) A cocaine possession charge against New England Patriots safety Patrick Chung will be dropped with the understanding that he will undergo periodic drug testing and perform 40 hours of community service, a prosecutor said Monday.\r\nA grand ju… [+1870 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Newman University professor awarded $840,000 in lawsuit", "description": "WICHITA, Kan. (AP) — A former Newman University professor who alleged the university discriminated against her because she was a woman should receive $840,000 in damages and be reinstated, a federal jury ruled on Monday.", "url": "https://apnews.com/c935cc3086fe2e4d40af13e685c0e1cf", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:08:42Z", "content": "WICHITA, Kan. (AP) A former Newman University professor who alleged the university discriminated against her because she was a woman should receive $840,000 in damages and be reinstated, a federal jury ruled on Monday.\r\nThe jury found in favor of Cindy Loutha… [+1169 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ivey remains noncommittal on refugee settlements in Alabama", "description": "MONTGOMERY, Ala. (AP) — Alabama Gov. Kay Ivey is remaining uncommitted on whether Alabama will accept the resettlement of new refugees under a new Trump administration order that requires state consent, a spokeswoman said Monday.", "url": "https://apnews.com/3662ae8b61cae65ffda0e365fd0a6f9e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:07:10Z", "content": "MONTGOMERY, Ala. (AP) Alabama Gov. Kay Ivey is remaining uncommitted on whether Alabama will accept the resettlement of new refugees under a new Trump administration order that requires state consent, a spokeswoman said Monday.\r\nAlabama is one of a handful of… [+1124 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "NY governor to head to Puerto Rico", "description": "ALBANY, N.Y. (AP) — New York Gov. Andrew Cuomo is heading to Puerto Rico in the aftermath of earthquakes.", "url": "https://apnews.com/ffbe9a509f4fff96dc2631703b4e070b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:06:54Z", "content": "ALBANY, N.Y. (AP) New York Gov. Andrew Cuomo is heading to Puerto Rico in the aftermath of earthquakes.\r\nThe Democrat's office says he plans to travel to Puerto Rico Tuesday and Wednesday.\r\nThe ground in southwest Puerto Rico has been shaking since Dec. 28, w… [+585 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Funeral set for West Virginia firefighter killed in crash", "description": "SPENCER, W.Va. (AP) — Services are set for a West Virginia firefighter who was killed when a volunteer fire department's truck crashed while responding to an emergency call.", "url": "https://apnews.com/cd02bdc7d38ec0fff2c74b0c1658ca70", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T21:05:56Z", "content": "SPENCER, W.Va. (AP) Services are set for a West Virginia firefighter who was killed when a volunteer fire department's truck crashed while responding to an emergency call.\r\nThe funeral for Clover volunteer firefighter Mark Horwich will be at noon Saturday at … [+679 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Smith, Herrmann agree to minor league deals with Rays", "description": "ST. PETERSBURG, Fla. (AP) — Catchers Kevan Smith and Chris Herrmann have agreed to minor league contracts with the Tampa Bay Rays and will report to major league spring training.", "url": "https://apnews.com/43d53246b1105ed90439c8b24d428dca", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-13T21:03:54Z", "content": "ST. PETERSBURG, Fla. (AP) Catchers Kevan Smith and Chris Herrmann have agreed to minor league contracts with the Tampa Bay Rays and will report to major league spring training.\r\nThe team also announced minor league deals Monday with outfielder Ryan LaMarre an… [+919 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By RUSS BYNUM Associated Press", "title": "Injured baby right whale given grim prognosis after 2nd look", "description": "SAVANNAH, Ga. (AP) — An endangered newborn right whale spotted with grievous injuries to its head off the Georgia coast is unlikely to survive, though scientists may try to inject the calf with antibiotics using a syringe fired from an…", "url": "https://apnews.com/89f0c276ce6427c49b0bc8009e0ae17f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/f/8a/f8ae33dc-acca-523e-953e-b1cc34f415d8/5e1786a862ddb.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T21:02:09Z", "content": "SAVANNAH, Ga. (AP) An endangered newborn right whale spotted with grievous injuries to its head off the Georgia coast is unlikely to survive, though scientists may try to inject the calf with antibiotics using a syringe fired from an air gun if they can safel… [+2679 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By GRANT SCHULTE Associated Press", "title": "Nebraska Medicaid head steps down as state expands coverage", "description": "LINCOLN, Neb. (AP) — The director of Nebraska's Medicaid program is stepping down in the middle of the state's effort to expand coverage under the federal health care law — an expansion that Republican governors and many state lawmakers thwarted…", "url": "https://apnews.com/53c8c8adf9b870f6ac00dc7e9a4f3033", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-13T21:00:59Z", "content": "LINCOLN, Neb. (AP) The director of Nebraska's Medicaid program is stepping down in the middle of the state's effort to expand coverage under the federal health care law an expansion that Republican governors and many state lawmakers thwarted until voters appr… [+3440 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By REGINA GARCIA CANO Associated Press", "title": "Baltimore sees 15 shot, 5 fatally, in warm winter weekend", "description": "BALTIMORE (AP) — A warm winter weekend in Baltimore was marred by violence, as more than a dozen people were shot and the city's leadership continued to struggle against deadly gun crime.", "url": "https://apnews.com/956e5ab8de67a7beba98bd95c5a70ce3", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/a/7f/a7fa4b4b-6321-54f5-91f5-89e2771448a8/5e1b901a40c5c.image.jpg?crop=1679%2C944%2C0%2C144&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T21:00:43Z", "content": "BALTIMORE (AP) A warm winter weekend in Baltimore was marred by violence, as more than a dozen people were shot and the city's leadership continued to struggle against deadly gun crime.\r\nThe shootings of 12 people, five of them fatally, Saturday marked the th… [+3120 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man found guilty of setting deputy on fire gets 16 years", "description": "RAVENNA, Ohio (AP) — A man found guilty of setting an Ohio sheriff's deputy on fire while authorities were trying to arrest him was sentenced Monday to 16 years in prison.", "url": "https://apnews.com/3a63a0332df830906bef78eb20b4edda", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-13T21:00:05Z", "content": "RAVENNA, Ohio (AP) A man found guilty of setting an Ohio sheriff's deputy on fire while authorities were trying to arrest him was sentenced Monday to 16 years in prison.\r\nJay Brannon, 45, pleaded guilty last week in Portage County to charges of attempted aggr… [+803 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Minor earthquake in Canada rattles northern New York", "description": "MASSENA, N.Y. (AP) — Some northern New York residents were shaken by a small earthquake just north of the Canadian border early Monday.", "url": "https://apnews.com/e309eb9cb325fc547cc6a228925c0bb1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:59:29Z", "content": "MASSENA, N.Y. (AP) Some northern New York residents were shaken by a small earthquake just north of the Canadian border early Monday.\r\nThe U.S. Geological Survey said the 3.3 magnitude quake happened shortly after 5:30 a.m., 10 miles (16 kilometers) south of … [+627 chars]"}]}