{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Heavy rain, snow increase threat of mudslides", "description": "DES MOINES, Wash. (AP) — All the rain and snow falling in Western Washington bumps up the risk for mudslides and avalanches.", "url": "https://apnews.com/ffcd235d7d271a56af8a44b5f9f91b09", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T13:01:24Z", "content": "DES MOINES, Wash. (AP) All the rain and snow falling in Western Washington bumps up the risk for mudslides and avalanches.\r\nKOMO-TV reports a big mudslide shutdown Woodmont Drive in Des Moines, Washington.\r\nOfficials said the danger is looming as the heavy do… [+1540 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man charged in New Year's Day machete attack at wife's home", "description": "BETHLEHEM, Pa. (AP) — A man who barged into his estranged wife’s home on New Year's Day and attacked a man there with a machete is now facing numerous charges, authorities said.", "url": "https://apnews.com/a9ddca7aedf0eef5e712d45c102e8da2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:56:36Z", "content": "BETHLEHEM, Pa. (AP) A man who barged into his estranged wifes home on New Year's Day and attacked a man there with a machete is now facing numerous charges, authorities said.\r\nBethlehem police responded to the home around 1:20 a.m. Wednesday and found Shakime… [+1279 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police arrest 7 in New Year's Eve mob sexual assault", "description": "CAIRO (AP) — Police arrested seven young men for allegedly taking part in a mob sexual assault of a young woman during New Year's Eve celebrations, a senior security official said Friday.", "url": "https://apnews.com/c5488d2a3fd543951e2e2bed33ce493b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-03T12:56:12Z", "content": "CAIRO (AP) Police arrested seven young men for allegedly taking part in a mob sexual assault of a young woman during New Year's Eve celebrations, a senior security official said Friday.\r\nSince Wednesday, a video showing several dozen men pushing around a scre… [+1866 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "1 dead, 1 critically injured in apartment building fire", "description": "BAYONNE, N.J. (AP) — A fast-moving fire roared through a northern New Jersey apartment building early Friday, leaving one man dead and another person critically injured.", "url": "https://apnews.com/34c5a211dd0d5bafc41332a05d20a4ad", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:54:48Z", "content": "BAYONNE, N.J. (AP) A fast-moving fire roared through a northern New Jersey apartment building early Friday, leaving one man dead and another person critically injured.\r\nThe fire in Bayonne also displaced dozens of residents, authorities said.\r\nThe blaze was r… [+568 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DUSAN STOJANOVIC Associated Press", "title": "Montenegro denounces protest attack on its embassy in Serbia", "description": "BELGRADE, Serbia (AP) — Montenegro on Friday strongly denounced aggression against its embassy in Serbia during a protest by thousands of ultra-nationalists, saying the actions of soccer hooligans who threw flares and chanted “Set it on fire” represented an a…", "url": "https://apnews.com/526687ea80bf85bf3d3a49cebe95f216", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-03T12:54:47Z", "content": "BELGRADE, Serbia (AP) Montenegro on Friday strongly denounced aggression against its embassy in Serbia during a protest by thousands of ultra-nationalists, saying the actions of soccer hooligans who threw flares and chanted Set it on fire represented an attac… [+2684 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "FBI investigating officer's shooting of South Dakota suspect", "description": "RAPID CITY, S.D. (AP) — Authorities are investigating a federal agent's shooting of a suspect near Rapid City that began with a car chase on the Pine Ridge Reservation last month.", "url": "https://apnews.com/e1b0be63e480e3fbdccaafdb7a441dc4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:53:19Z", "content": "RAPID CITY, S.D. (AP) Authorities are investigating a federal agent's shooting of a suspect near Rapid City that began with a car chase on the Pine Ridge Reservation last month.\r\nThe Rapid City Journal reported Thursday that the FBI is investigating what prom… [+623 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man leaps off bridge in mistaken belief cops are chasing him", "description": "ATLANTA (AP) — A driver who mistakenly thought Atlanta police were chasing him as they were pursuing a different speeding motorist crashed his car and jumped 40 feet (12 meters) off a highway bridge to escape.", "url": "https://apnews.com/8fb44a610977a66f79c3ea8a43a49568", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:51:49Z", "content": "ATLANTA (AP) A driver who mistakenly thought Atlanta police were chasing him as they were pursuing a different speeding motorist crashed his car and jumped 40 feet (12 meters) off a highway bridge to escape.\r\nThe driver survived the jump and ran into a wooded… [+974 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "NYC education official charged in child sex crime case", "description": "MILWAUKEE (AP) — Federal prosecutors in Wisconsin have charged a high-ranking New York City education official for allegedly using a computer to facilitate a child sex crime, authorities said.", "url": "https://apnews.com/829acac0d56fa58bbee37c4616e49cac", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-03T12:43:24Z", "content": "MILWAUKEE (AP) Federal prosecutors in Wisconsin have charged a high-ranking New York City education official for allegedly using a computer to facilitate a child sex crime, authorities said.\r\nThe Milwaukee Journal Sentinel reported that the U.S. Attorney's Of… [+1200 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "Police: Ex-school president went on $82,000 shopping spree", "description": "WEST PALM BEACH, Fla. (AP) — The former president of a private medical career college in Florida was arrested Dec. 31 on charges of grand theft, money laundering ad fraud after using the school's debit card to make personal purchases…", "url": "https://apnews.com/1b82d303079acf7d2c28a811a990fa33", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:43:03Z", "content": "WEST PALM BEACH, Fla. (AP) The former president of a private medical career college in Florida was arrested Dec. 31 on charges of grand theft, money laundering ad fraud after using the school's debit card to make personal purchases totaling more than $82,000,… [+1851 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man accused of shooting brothers, killing 1, arrested", "description": "MOUNT VERNON, Va. (AP) — Police in Virginia say an arrest has been made in the shooting of two brothers that left one of the men dead.", "url": "https://apnews.com/30c99e358e49e25f40a421d3d94280f9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:42:37Z", "content": "MOUNT VERNON, Va. (AP) Police in Virginia say an arrest has been made in the shooting of two brothers that left one of the men dead.\r\nJeremiah Mouzon, 20, was identified as the suspect and located in Maryland, Fairfax County police said in a statement Thursda… [+940 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-Maryland lawmaker faces sentencing for misusing funds", "description": "GREENBELT, Md. (AP) — A former Maryland state lawmaker is scheduled to be sentenced Friday for misusing campaign funds for her personal benefit.", "url": "https://apnews.com/ea46dbbf25abdeac4adf49d4c142d180", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:31:57Z", "content": "GREENBELT, Md. (AP) A former Maryland state lawmaker is scheduled to be sentenced Friday for misusing campaign funds for her personal benefit.\r\nTawanna Gaines, a Democrat who had served in the Maryland House of Delegates since 2001, pleaded guilty in October … [+1367 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Drunken driver crashes into K9 patrol car; 2 injured", "description": "PASCAGOULA, Miss. (AP) — A driver drunkenly navigating the streets of a Mississippi city on New Year's Eve crashed into a patrol car carrying an officer and his canine partner, authorities said.", "url": "https://apnews.com/dfc7d51aa0a4296e2e42c109f838e151", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:28:51Z", "content": "PASCAGOULA, Miss. (AP) A driver drunkenly navigating the streets of a Mississippi city on New Year's Eve crashed into a patrol car carrying an officer and his canine partner, authorities said.\r\nPascagoula police Officer Ernie Snyder and the dog named Tony suf… [+757 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-Maryland teacher accused of offering teen $200 for sex", "description": "GERMANTOWN, Md. (AP) — A former Maryland teacher is accused of offering to pay 14-year-old girl $200 for sex.", "url": "https://apnews.com/8f35a08e6c26ad9ea48656f87bbea807", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:25:03Z", "content": "GERMANTOWN, Md. (AP) A former Maryland teacher is accused of offering to pay 14-year-old girl $200 for sex.\r\nMiguel Angel De Jesus Navarro, 61, was arrested this week on charges of sexual solicitation, attempting sex trafficking of a minor and soliciting a mi… [+911 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Mental tests ordered for man accused of killing Iowa pastor", "description": "FORT DODGE, Iowa (AP) — A mental competency evaluation has been ordered for a man accused of beating to death a pastor outside a central Iowa church.", "url": "https://apnews.com/fed3a56fe17c961faae2d792bfe64827", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/7/cb/7cb03040-33e7-5b8c-be6b-ab210ae15338/5e0f34140f9d6.image.jpg?crop=1247%2C701%2C0%2C480&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-03T12:21:54Z", "content": "FORT DODGE, Iowa (AP) A mental competency evaluation has been ordered for a man accused of beating to death a pastor outside a central Iowa church.\r\nA judge approved a request Monday from the attorney for Joshua Pendleton, 36. Pendleton has pleaded not guilty… [+1081 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "State: Delaware wastewater plant suffers another malfunction", "description": "LEWES, Del. (AP) — A wastewater treatment plant in Delaware has experienced another malfunction causing partially-treated sewage to flow into a canal.", "url": "https://apnews.com/173883921713388b263f8b29a430a8e8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:12:56Z", "content": "LEWES, Del. (AP) A wastewater treatment plant in Delaware has experienced another malfunction causing partially-treated sewage to flow into a canal.\r\nThe plant was forced to bypass some stages of treatment for about two hours on Wednesday night, the Delaware … [+839 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Teen girl stabs brother during fight over fireworks", "description": "JACKSON, Miss. (AP) — A 13-year-old Mississippi girl is accused of repeatedly stabbing her 15-year-old brother on News Year's Day in an argument over fireworks, during a holiday period in which multiple children were injured in the state's capital city,…", "url": "https://apnews.com/ba0a3098c19e719fd7b067c9a9daf453", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T12:09:48Z", "content": "JACKSON, Miss. (AP) A 13-year-old Mississippi girl is accused of repeatedly stabbing her 15-year-old brother on News Year's Day in an argument over fireworks, during a holiday period in which multiple children were injured in the state's capital city, Jackson… [+1108 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By STEVE DOUGLAS AP Sports Writer", "title": "Ancelotti bids to reverse Everton's derby-day fortunes", "description": "Everton manager Carlo Ancelotti was setting the scene for the latest Merseyside derby against Liverpool when he trotted out a cliché seemingly used for any match between local rivals.", "url": "https://apnews.com/0f47e66e01ea80bacdd64b862b6244ea", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/9/9b/99b0d42d-a782-59b7-acef-a268e4ed3636/5e0f30a61e499.image.jpg?crop=1697%2C955%2C0%2C133&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-03T12:08:01Z", "content": "Everton manager Carlo Ancelotti was setting the scene for the latest Merseyside derby against Liverpool when he trotted out a cliché seemingly used for any match between local rivals.\r\nIn a derby, Ancelotti said with a smile, you never know whats going to hap… [+4086 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By VANESSA GERA Associated Press", "title": "Bannon protege loses case against liberal Polish newspaper", "description": "WARSAW, Poland (AP) — A conservative American activist and Steve Bannon protege has lost a defamation case against a Polish journalist who described him as “Trump's man” and someone who by association was indirectly linked to Russian President Vladimir Putin.", "url": "https://apnews.com/635c9daf5b16eafa3f5354f6cd2a98b3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-03T12:02:57Z", "content": "WARSAW, Poland (AP) A conservative American activist and Steve Bannon protege has lost a defamation case against a Polish journalist who described him as Trump's man and someone who by association was indirectly linked to Russian President Vladimir Putin.\r\nMa… [+2112 chars]"}]}