{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Closing arguments set in fatal Christmas Day hotel stabbing", "description": "UNIONTOWN, Pa. (AP) — Closing arguments are scheduled Monday in the homicide trial of a western Pennsylvania woman charged in the stabbing death of her boyfriend on Christmas Day in 2018.", "url": "https://apnews.com/68af1bd84ae960390aed45815d2a814f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:55:55Z", "content": "UNIONTOWN, Pa. (AP) Closing arguments are scheduled Monday in the homicide trial of a western Pennsylvania woman charged in the stabbing death of her boyfriend on Christmas Day in 2018.\r\nTwenty-eight-year-old Dominique Jones took the stand Friday in her own d… [+883 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Connecticut now testing newborns for rare genetic disorder", "description": "HARTFORD, Conn. (AP) — Connecticut's public health laboratory has begun testing newborn babies for the genetic disorder Spinal Muscular Atrophy, complying with a new state law that took effect on Jan. 1.", "url": "https://apnews.com/3817bda885865fbee93393c6eab8a2d4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:48:55Z", "content": "HARTFORD, Conn. (AP) Connecticut's public health laboratory has begun testing newborn babies for the genetic disorder Spinal Muscular Atrophy, complying with a new state law that took effect on Jan. 1.\r\nThe rare condition can lead to loss of nerve and muscle … [+1163 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By SEAN MURPHY Associated Press", "title": "Oklahoma program offers rescue for horses, other equine", "description": "EDMOND, Okla. (AP) — When Ken Friend learned a job transfer meant moving his family to California from the small farm they’d been living on in rural Oklahoma, he knew he’d have to find new homes for his animals.", "url": "https://apnews.com/f7f44b146f159d63e1b568fbbe5b49af", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/a/54/a54dfbab-dd2c-50fb-a361-c6880558e071/5e1b34cd6bcef.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T14:48:40Z", "content": "EDMOND, Okla. (AP) When Ken Friend learned a job transfer meant moving his family to California from the small farm theyd been living on in rural Oklahoma, he knew hed have to find new homes for his animals.\r\nIn addition to the four dogs Friend had adopted ov… [+4403 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Decades-old case against ex-cop heading to court", "description": "BENNINGTON, Vt. (AP) — A long-delayed case of a former New York police detective accused of sexually assaulting a girl at his vacation home in Vermont is heading to court Monday.", "url": "https://apnews.com/4f0f2c2ec23b61ba3bbcf18e8f97e2ff", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:42:43Z", "content": "BENNINGTON, Vt. (AP) A long-delayed case of a former New York police detective accused of sexually assaulting a girl at his vacation home in Vermont is heading to court Monday.\r\nA team from Attorney General T.J. Donovan's office and a public defender will dis… [+1337 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police have identified two men found shot dead in Framingham", "description": "FRAMINGHAM, Mass. (AP) — Police have identified two men found shot dead in Framingham.", "url": "https://apnews.com/4d74e23f3344d6f4da7b2890d1a0d69c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:38:59Z", "content": "FRAMINGHAM, Mass. (AP) Police have identified two men found shot dead in Framingham.\r\nInvestigators say Framingham police officers arrived at the area of Second Street and Beaver Street at about 11:37 Friday evening responding to 911 calls reporting gunshots.… [+759 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Michigan may add non-binary option to driver's licenses", "description": "LANSING, Mich. (AP) — Secretary of State Jocelyn Benson's office is working to add a third gender option on Michigan licenses.", "url": "https://apnews.com/427e6ddf43d6d5f31d7c9ecaf60ded99", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:32:28Z", "content": "LANSING, Mich. (AP) Secretary of State Jocelyn Benson's office is working to add a third gender option on Michigan licenses.\r\nThe possibility to add a non-binary option might be complete by 2021, according to The Detroit News. Michigan would become the 14th s… [+1753 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Questions raised over bill to extend Indiana voting hours", "description": "INDIANAPOLIS (AP) — County clerks are worried a proposal for extending Indiana’s Election Day voting time by two hours would make it more difficult to find enough poll workers.", "url": "https://apnews.com/bc135fbdd25094ad8d6aa8e47bff0f4e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:29:24Z", "content": "INDIANAPOLIS (AP) County clerks are worried a proposal for extending Indianas Election Day voting time by two hours would make it more difficult to find enough poll workers.\r\nThe bill sponsored by Republican Rep. Tim Wesco of Osceola would change Indianas cur… [+936 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Spain's leader: 'Dialogue' key to new left-wing government", "description": "MADRID (AP) — Spanish Prime Minister Pedro Sánchez said Sunday that he wants the hallmark of his new left-wing coalition government to be the “dialogue” needed to tackle the country’s most pressing issues, including the Catalan separatist conflict.", "url": "https://apnews.com/476152bfd3b22cf0827b7fca8879af78", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/8/cd/8cdb8a35-2054-59c3-9d02-c09b67a1924e/5e1b2dce6137c.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T14:27:57Z", "content": "MADRID (AP) Spanish Prime Minister Pedro Sánchez said Sunday that he wants the hallmark of his new left-wing coalition government to be the dialogue needed to tackle the countrys most pressing issues, including the Catalan separatist conflict.\r\nSánchez said t… [+1845 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Indiana steelmaker denies manipulating test data after spill", "description": "PORTAGE, Ind. (AP) — An Indiana steelmaker has denied allegations of manipulating results from toxic readings required after a chemical spill killed more than 3,000 fish last year.", "url": "https://apnews.com/03d035a7448fa8603727da263cbc99e5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:27:51Z", "content": "PORTAGE, Ind. (AP) An Indiana steelmaker has denied allegations of manipulating results from toxic readings required after a chemical spill killed more than 3,000 fish last year.\r\nState regulators said that ArcelorMittal's steel plant in Burns Harbor is redoi… [+1420 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Iran's only female Olympic medalist reportedly defects", "description": "DUBAI, United Arab Emirates (AP) — Iran's only female Olympic medalist said she defected from the Islamic Republic in a blistering online letter that describes herself as “one of the millions of oppressed women in Iran.”", "url": "https://apnews.com/58db534658512cd0d0ee73550b212b0f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/2/25/2254097a-f9df-528f-951e-62d095846eea/5e1b2dd28f3c5.image.jpg?crop=1765%2C993%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T14:24:53Z", "content": "DUBAI, United Arab Emirates (AP) Iran's only female Olympic medalist said she defected from the Islamic Republic in a blistering online letter that describes herself as one of the millions of oppressed women in Iran.\r\nTaekwondo athlete Kimia Alizadeh posted t… [+1289 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Illinois' Black Hawk statue is finally finished", "description": "OREGON, Ill. (AP) — The Illinois landmark known as the Eternal Indian statue is finally complete after years of planning and fundraising.", "url": "https://apnews.com/6c0b77378c362a5e8e2864f457849c9d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:24:15Z", "content": "OREGON, Ill. (AP) The Illinois landmark known as the Eternal Indian statue is finally complete after years of planning and fundraising.\r\nThe scaffolding surrounding the sculpture, also known as Black Hawk, is being removed and should be completely taken down … [+1978 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By PHILIP MARCELO Associated Press", "title": "Ex-drug company execs face reckoning in opioid bribery case", "description": "BOSTON (AP) — The founder and former top employees of a pharmaceutical company are facing a reckoning for their role in a bribery scheme that prosecutors say boosted sales of a powerful, highly addictive painkiller and helped fuel the national…", "url": "https://apnews.com/c9d2f0e579776268b3365c84eefb789b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:21:47Z", "content": "BOSTON (AP) The founder and former top employees of a pharmaceutical company are facing a reckoning for their role in a bribery scheme that prosecutors say boosted sales of a powerful, highly addictive painkiller and helped fuel the national opioid epidemic.\r… [+3511 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Suburban Chicago man convicted in a crash that killed teen", "description": "ROLLING MEADOWS, Ill. (AP) — A suburban Chicago man who police said was driving at 107 mph (172 kilometers per mile) when he struck another car, killing a 16-year-old girl, has been convicted of reckless homicide.", "url": "https://apnews.com/318c65cd13623e38a55803db6a0783e7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:21:24Z", "content": "ROLLING MEADOWS, Ill. (AP) A suburban Chicago man who police said was driving at 107 mph (172 kilometers per mile) when he struck another car, killing a 16-year-old girl, has been convicted of reckless homicide.\r\nA jury in Rolling Meadows deliberated for less… [+1064 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Taubitz wins women's World Cup luge race, Russia wins relay", "description": "ALTENBERG, Germany (AP) — Julia Taubitz of Germany had the fastest time in both heats Sunday and won a women’s World Cup luge race, moving into a virtual tie with Russia’s Tatyana Ivanova for the seasonlong points lead.", "url": "https://apnews.com/de7aa0b937ff586d730bc0a41a8cf2d0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/8/2b/82bf59ee-52e8-5ece-b7d3-ceb6311e75f0/5e1b312fdc0c8.image.jpg?crop=1719%2C967%2C0%2C119&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T14:18:35Z", "content": "ALTENBERG, Germany (AP) Julia Taubitz of Germany had the fastest time in both heats Sunday and won a womens World Cup luge race, moving into a virtual tie with Russias Tatyana Ivanova for the seasonlong points lead.\r\nTaubitz finished in 1 minute, 44.264 secon… [+740 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Friedrich finishes off World Cup bobsled weekend sweep", "description": "LA PLAGNE, France (AP) — Francesco Friedrich of Germany drove to the win Sunday in a World Cup four-man bobsled race, marking the seventh time he has swept gold medals in both two- and four-man events in the same weekend.", "url": "https://apnews.com/db53a0811aae2e9ec75e8bd33ea12527", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-12T14:12:37Z", "content": "LA PLAGNE, France (AP) Francesco Friedrich of Germany drove to the win Sunday in a World Cup four-man bobsled race, marking the seventh time he has swept gold medals in both two- and four-man events in the same weekend.\r\nFriedrich finished in 1 minute, 55.85 … [+633 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Northern New England beats warm weather records", "description": "It felt more like spring than winter around northern New England on Saturday with record high temperatures set around the region.", "url": "https://apnews.com/5ed43ed3a19e3b5e6d881a1931b3e8c8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-12T14:07:50Z", "content": "It felt more like spring than winter around northern New England on Saturday with record high temperatures set around the region.\r\nPortland, Maine, hit a high of 63 degrees (17 degrees Celsius), beating the old record of 54 (12 degrees Celsius) set in 2017. C… [+330 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Novak Djokovic leads Serbia to victory over Spain to clinch inaugural ATP Cup title in Australia", "description": "SYDNEY (AP) — Novak Djokovic leads Serbia to victory over Spain to clinch inaugural ATP Cup title in Australia.", "url": "https://apnews.com/b9876e096caaf0a19366702bcb28e022", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-12T14:07:43Z", "content": "SYDNEY (AP) Novak Djokovic leads Serbia to victory over Spain to clinch inaugural ATP Cup title in Australia.\r\nCopyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ROBERT BURNS AP National Security Writer", "title": "Esper: US does not expect more Iranian retaliatory attacks", "description": "WASHINGTON (AP) — Defense Secretary Mark Esper said Sunday the Trump administration foresees no more Iranian military attacks in retaliation for the U.S. strike that killed the Islamic Republic's most powerful general. The Pentagon chief suggested that Iran's…", "url": "https://apnews.com/5a168a5d8f560e928f3924f7af10f1d8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/b/87/b87a5a77-4888-5f83-96ee-f00fa425c121/5e14eafd5d14f.image.jpg?resize=1120%2C630", "publishedAt": "2020-01-12T14:03:12Z", "content": "WASHINGTON (AP) Defense Secretary Mark Esper said Sunday the Trump administration foresees no more Iranian military attacks in retaliation for the U.S. strike that killed the Islamic Republic's most powerful general. The Pentagon chief suggested that Iran's g… [+1077 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By CRYSTAL SCHELLE The Frederick News-Post", "title": "Artist paints carousel horse to fulfill former owner's dream", "description": "ROCKY RIDGE, Md. (AP) — A horse trailer pulled into the driveway of Linda Luster’s Rocky Ridge home on the morning of Oct. 1.", "url": "https://apnews.com/3ff42f2923eb73c02f005e60de51ea8d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/d/06/d0657003-2517-5565-845a-1404ae0f3654/5e18a35178c7a.image.jpg?crop=1532%2C862%2C0%2C245&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T14:00:10Z", "content": "ROCKY RIDGE, Md. (AP) A horse trailer pulled into the driveway of Linda Lusters Rocky Ridge home on the morning of Oct. 1.\r\nShe and her husband were enjoying breakfast when they saw it. Thats when, Luster said, her husband shot her a look that asked did-you-b… [+8510 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TINA ALVEY The Register-Herald", "title": "Young rodeo rider refuses to yield to physical limitations", "description": "LEWISBURG, W.Va. (AP) — Josi Davis is a champion rodeo rider and the apple of her mother’s eye. But this 12-year-old is first and foremost a survivor.", "url": "https://apnews.com/12bc5e687672e1e9d53e2a78314075f2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/2/d0/2d046174-b18d-5483-943b-98d8af955d7e/5e18a6f638203.image.jpg?crop=1280%2C720%2C0%2C86&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-12T14:00:09Z", "content": "LEWISBURG, W.Va. (AP) Josi Davis is a champion rodeo rider and the apple of her mothers eye. But this 12-year-old is first and foremost a survivor.\r\nDiagnosed at the Pittsburgh Childrens Hospital at the age of 4 with immune deficiency syndrome and Ehlers-Danl… [+4123 chars]"}]}