{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Geothermal deal could lower Hawaii island electric bills", "description": "HILO, Hawaii (AP) — A Hawaii island geothermal power company that was knocked offline by a volcanic eruption hopes to produce lower cost electricity under a new agreement with a state utility, company officials said.", "url": "https://apnews.com/4391eb0d160fc828c4d9b547bfb0c258", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:20:16Z", "content": "HILO, Hawaii (AP) A Hawaii island geothermal power company that was knocked offline by a volcanic eruption hopes to produce lower cost electricity under a new agreement with a state utility, company officials said.\r\nPuna Geothermal Venture and Hawaiian Electr… [+2120 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Illinois will stop collecting on unpaid red-light tickets", "description": "CHICAGO (AP) — The state of Illinois will stop collecting fines against drivers who are ticketed after cameras catch them violating red lights, Comptroller Susan Mendoza said Monday.", "url": "https://apnews.com/a2242926b993239e9810388fa3daf5ad", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:19:12Z", "content": "CHICAGO (AP) The state of Illinois will stop collecting fines against drivers who are ticketed after cameras catch them violating red lights, Comptroller Susan Mendoza said Monday.\r\nMendoza said poor and minority motorists appear to be most affected by the $1… [+1147 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Lawmaker charged with DUI returned to leadership post", "description": "HARTFORD, Conn. (AP) — A Connecticut lawmaker charged with drunken driving in October has been returned to a leadership post on the legislature's Public Safety and Security Committee.", "url": "https://apnews.com/5b7da41a5e026286083a38ecffe2dddb", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:17:11Z", "content": "HARTFORD, Conn. (AP) A Connecticut lawmaker charged with drunken driving in October has been returned to a leadership post on the legislature's Public Safety and Security Committee.\r\nDemocratic Rep. Joe Verrengia, a retired police officer from West Hartford, … [+1190 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "New Hawaii law shows information withheld in prison deaths", "description": "HONOLULU (AP) — A new state law requiring Hawaii prison officials to report each time an inmate dies in custody has revealed the case of a prisoner whose death resulting from an alleged assault was not publicly announced.", "url": "https://apnews.com/a94e376098741e76c821333f87c55fdc", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-06T15:16:00Z", "content": "HONOLULU (AP) A new state law requiring Hawaii prison officials to report each time an inmate dies in custody has revealed the case of a prisoner whose death resulting from an alleged assault was not publicly announced.\r\nThe state Department of Public Safety … [+1997 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Alaska tribal groups oppose federal plan to allow mining", "description": "ANCHORAGE, Alaska (AP) — More than two dozen tribal groups oppose a federal land-use proposal that could open large areas of wilderness to future mining in rural Alaska.", "url": "https://apnews.com/d0af1a8950d7e530a32e99e5d84f9750", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-06T15:13:33Z", "content": "ANCHORAGE, Alaska (AP) More than two dozen tribal groups oppose a federal land-use proposal that could open large areas of wilderness to future mining in rural Alaska.\r\nTh opposition is in response to a proposed Bureau of Land Management update to its resourc… [+2087 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TOM WITHERS AP Sports Writer", "title": "Browns interview Bills coordinator Daboll for coaching gig", "description": "CLEVELAND (AP) — After a one-day break, the Browns are resuming their coaching search by interviewing Bills offensive coordinator Brian Daboll, who previously worked in Cleveland.", "url": "https://apnews.com/c47b5d8fe9268e891d0d014c34b2e288", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/9/17/917d3e98-7a15-5243-ad46-1f9e67f49543/5e1352a457b52.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T15:08:19Z", "content": "FILE - In this Sept. 16, 2018, file photo, Buffalo Bills offensive coordinator Brian Daboll walks off the field prior to the game against the Los Angeles Chargers, in Orchard Park, N.Y. After taking a short break, the Browns are resuming their coaching search… [+1471 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By FABIOLA SANCHEZ and JOSHUA GOODMAN Associated Press Writers", "title": "Maduro tightens noose around Venezuela's opposition", "description": "CARACAS, Venezuela (AP) — Nicolás Maduro's government moved aggressively to wipe out what remains of resistance to his socialist rule, attempting to install a pliant leadership in congress in a move opponents compared to an attempted coup in Venezuela’s last…", "url": "https://apnews.com/11e6e3a669fb7b3c53344c4925dd5fae", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/f/4e/f4eb2a2a-e0af-5ded-bbbf-b495fcacc733/5e12a638ef222.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T15:05:40Z", "content": "CARACAS, Venezuela (AP) Nicolás Maduro's government moved aggressively to wipe out what remains of resistance to his socialist rule, attempting to install a pliant leadership in congress in a move opponents compared to an attempted coup in Venezuelas last dem… [+5650 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man dies after off-road vehicle flips, crashes in Indiana", "description": "HANOVER, Ind. (AP) — A southeastern Indiana man died Sunday evening after his off-road vehicle flipped and struck a tree, authorities said.", "url": "https://apnews.com/40aa011ef95710328bda9c3fcc697950", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:04:21Z", "content": "HANOVER, Ind. (AP) A southeastern Indiana man died Sunday evening after his off-road vehicle flipped and struck a tree, authorities said.\r\nIndiana Conservation Officers said Corey Garver, 35, died at the scene of the crash in the Jefferson County community of… [+365 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MIKE SCHNEIDER Associated Press", "title": "Homeland Security will share citizenship data with Census", "description": "ORLANDO, Fla. (AP) — The Department of Homeland Security is agreeing to share citizenship information with the U.S. Census Bureau as part of President Donald Trump's order to collect data on who is a citizen following the Supreme Court's rejection…", "url": "https://apnews.com/f4718ef7ede119246f9a19a64a69c77a", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-06T15:01:28Z", "content": "ORLANDO, Fla. (AP) The Department of Homeland Security is agreeing to share citizenship information with the U.S. Census Bureau as part of President Donald Trump's order to collect data on who is a citizen following the Supreme Court's rejection of a citizens… [+1626 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "6 teens arrested in weekend melee at Mesa skating rink", "description": "MESA, Ariz. (AP) — Six teenagers were arrested after several fights broke out at a crowded indoor skating rink in Mesa, authorities said.", "url": "https://apnews.com/a3fd0d09ea9f57db0694aa4a5cadb5b9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:01:12Z", "content": "MESA, Ariz. (AP) Six teenagers were arrested after several fights broke out at a crowded indoor skating rink in Mesa, authorities said.\r\nMesa police say they were called to Skateland Saturday night in response to a report of teens fighting.\r\nOfficers on the s… [+1149 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Diabetic Mississippi man searches for missing service dog", "description": "OCEAN SPRINGS, Miss. (AP) — A Mississippi man with type 1 diabetes is searching for his service dog that was scared off by fireworks late last month.", "url": "https://apnews.com/70baa8aab19825fd5cb0f890ed5f4f29", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:00:58Z", "content": "OCEAN SPRINGS, Miss. (AP) A Mississippi man with type 1 diabetes is searching for his service dog that was scared off by fireworks late last month.\r\nOwner Jacob Cokely and his family are offering $1,000 for the safe return of Bella, a black Labrador retriever… [+879 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Julián Castro endorses Elizabeth Warren in presidential race", "description": "WASHINGTON (AP) — Former Obama administration housing chief Julián Castro is endorsing Elizabeth Warren's presidential bid, saying the Massachusetts senator is “the most qualified, best-equipped candidate to win the nomination” and defeat President Donald Tru…", "url": "https://apnews.com/db3412152e7f8e89070eb2d0c7c39906", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/0/de/0de9bc72-f029-58dc-8e3b-3794340b75f5/5e134f662f350.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T15:00:31Z", "content": "WASHINGTON (AP) Former Obama administration housing chief Julián Castro is endorsing Elizabeth Warren's presidential bid, saying the Massachusetts senator is the most qualified, best-equipped candidate to win the nomination and defeat President Donald Trump.\r… [+1318 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By The Associated Press", "title": "Editorial Roundup:", "description": "Fort Worth Star-Telegram. December 30, 2019", "url": "https://apnews.com/0c038994e743467fc70d5539dce9a8aa", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:00:09Z", "content": "Fort Worth Star-Telegram. December 30, 2019\r\nFort Worth leaders, resolve to plan better for mass transit in 2020 and beyond\r\nHeres a New Years idea for Fort Worths elected officials and other leaders: Resolve to make public transportation a top planning prior… [+11154 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By The Associated Press", "title": "Editorial Roundup:", "description": "Omaha World Herald. January 2, 2020", "url": "https://apnews.com/da5c1eeb07f28a676b93311f6c6d0b7f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T15:00:08Z", "content": "Omaha World Herald. January 2, 2020\r\nMany Nebraskan nursing homes face major financial pressures\r\nThe numbers make Nebraskas nursing home challenge clear, especially for the states rural residents.\r\nAt least 14 nursing homes closed in Nebraska during 2019, se… [+7193 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Suspect lured seagulls with popcorn, ran them over", "description": "LAUREL, Md. (AP) — Police in Maryland say they're looking for a person who lured a group of seagulls with popcorn before running them over with a car.", "url": "https://apnews.com/8c5147d4f640a13d1c66a4051ea48639", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T14:52:29Z", "content": "LAUREL, Md. (AP) Police in Maryland say they're looking for a person who lured a group of seagulls with popcorn before running them over with a car.\r\nThe Daily Times reports that the incident occurred Saturday in Laurel outside a Dollar General. Police said t… [+328 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "1 student hurt, 1 in custody following middle school assault", "description": "ROCKPORT, Mass. (AP) — A Massachusetts middle school student was stabbed during an altercation with another student, police said Monday.", "url": "https://apnews.com/3fceb8a94e9887be734bcb3c48a5a4ba", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T14:51:57Z", "content": "ROCKPORT, Mass. (AP) A Massachusetts middle school student was stabbed during an altercation with another student, police said Monday.\r\nPolice responded to the Rockport Middle School in response to an assault Monday morning involving two students.\r\nOne studen… [+554 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By LORNE COOK Associated Press", "title": "EU regrets Iran nuclear moves but hopes to keep deal alive", "description": "BRUSSELS (AP) — The European Union expressed regret on Monday over Iran’s announcement that it will no longer be bound by all its nuclear obligations, but remains determined to keep alive an international deal preventing the Islamic Republic from developing…", "url": "https://apnews.com/78a59c88d613428cdc35756b18c7bc92", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/9/b4/9b4a1ff1-6a09-553d-bfd7-bbff91b54b86/5e00ef578e534.image.jpg?crop=1764%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-06T14:50:37Z", "content": "BRUSSELS (AP) The European Union expressed regret on Monday over Irans announcement that it will no longer be bound by all its nuclear obligations, but remains determined to keep alive an international deal preventing the Islamic Republic from developing atom… [+2880 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "'No war' spray-painted on St. Louis memorial to soldiers", "description": "ST. LOUIS (AP) — A memorial to soldiers in downtown St. Louis has been damaged by vandalism, including a spray-painted message of “No war.”", "url": "https://apnews.com/90d420fccfad90de61de6f160dac53d7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T14:48:30Z", "content": "ST. LOUIS (AP) A memorial to soldiers in downtown St. Louis has been damaged by vandalism, including a spray-painted message of No war.\r\nThe vandalism was discovered Sunday morning. It wasn't immediately clear if it was in response to the air strike that kill… [+755 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Pursuit of Louisiana car reported stolen ends in fatal crash", "description": "NEW ORLEANS (AP) — Authorities in Louisiana say one person in a car reported stolen was killed and two others were injured when the driver crashed into a tree while fleeing officers.", "url": "https://apnews.com/fea2d61ba02a4b74713d404b3dcf1709", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T14:48:20Z", "content": "NEW ORLEANS (AP) Authorities in Louisiana say one person in a car reported stolen was killed and two others were injured when the driver crashed into a tree while fleeing officers.\r\nLicense plate readers captured the plate of a stolen vehicle entering Jeffers… [+843 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Researchers find economic opportunity in dead Alaska cedar", "description": "JUNEAU, Alaska (AP) — Researchers have produced a study of the viability of logging yellow cedar trees that have been killed by warming temperatures in Southeast Alaska.", "url": "https://apnews.com/b00f09e49b1366c9ec0455053f262387", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-06T14:47:11Z", "content": "JUNEAU, Alaska (AP) Researchers have produced a study of the viability of logging yellow cedar trees that have been killed by warming temperatures in Southeast Alaska.\r\nThe study by the Alaska Coastal Rainforest Center and the University of Alaska Southeast e… [+1890 chars]"}]}