{"status": "ok", "totalResults": 75, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TERRY SPENCER Associated Press", "title": "Miami Super Bowl organizers bring death to Burmese pythons", "description": "SUNRISE, Fla. (AP) — Miami's upcoming Super Bowl will mean death for dozens of invasive Burmese pythons in the Everglades — and wildlife officials say that's a good thing.", "url": "https://apnews.com/80076705e5660694006a19272f7a540f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/c/38/c38946a6-470b-5c84-a5ad-ad5abfad64f1/5e18d1e8a6fba.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T19:21:34Z", "content": "SUNRISE, Fla. (AP) Miami's upcoming Super Bowl will mean death for dozens of invasive Burmese pythons in the Everglades and wildlife officials say that's a good thing.\r\nThe game's organizing committee is working with Florida to promote the Python Bowl, a 10-d… [+2843 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By NORA MABIE Great Falls Tribune", "title": "Fort Peck homeless shelters close for meth contamination", "description": "GREAT FALLS, Mont. (AP) — The only two homeless shelters on the Fort Peck reservation have been closed for months under order of Tribal Chairman Floyd Azure, who said they were contaminated with methamphetamine.", "url": "https://apnews.com/649458877ffa94cae29ebff32b25e515", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:17:52Z", "content": "GREAT FALLS, Mont. (AP) The only two homeless shelters on the Fort Peck reservation have been closed for months under order of Tribal Chairman Floyd Azure, who said they were contaminated with methamphetamine.\r\nAzure said that a general lack of supervision an… [+9558 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Court rules Bakersfield violated California open meeting law", "description": "BAKERSFIELD, Calif. (AP) — A judge has ruled that several sessions of Bakersfield City Council meetings held behind closed doors in 2017 violated California’s open meeting law, a newspaper reported.", "url": "https://apnews.com/703d9e7b696b985576e6ababca33c55c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:17:41Z", "content": "BAKERSFIELD, Calif. (AP) A judge has ruled that several sessions of Bakersfield City Council meetings held behind closed doors in 2017 violated Californias open meeting law, a newspaper reported.\r\nThe closed sessions involved discussions of city finances that… [+1189 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By EMILY WAGSTER PETTUS Associated Press", "title": "Bryant: Mississippi improved in 8 years of governorship", "description": "JACKSON, Miss. (AP) — Mississippi Gov. Phil Bryant is leaving office Tuesday after serving his limit of two terms. The Republican said he believes the state’s economy is stronger, vulnerable children are better protected and students are showing stronger acad…", "url": "https://apnews.com/ae4ec024c749dafd6c7230b4c5282b4f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/4/fa/4fab58b5-286a-55c6-ad26-373927e1448d/5e18d1ef31562.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T19:14:50Z", "content": "JACKSON, Miss. (AP) Mississippi Gov. Phil Bryant is leaving office Tuesday after serving his limit of two terms. The Republican said he believes the states economy is stronger, vulnerable children are better protected and students are showing stronger academi… [+5346 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Teens charged in beating death of Providence homeless man", "description": "PROVIDENCE, R.I. (AP) — Four teenagers have been arrested in connection with the beating death of a homeless man in a Providence park this summer, according to police.", "url": "https://apnews.com/c146b0382acb25186ab5b2495cc916cf", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:14:38Z", "content": "PROVIDENCE, R.I. (AP) Four teenagers have been arrested in connection with the beating death of a homeless man in a Providence park this summer, according to police.\r\nThe arrests stem from the death of 50-year-old Manuel Delacruz, who was assaulted July 23. P… [+698 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Congressional Black Caucus making first Massachusetts visit", "description": "BOSTON (AP) — The Congressional Black Caucus is making its first visit to Massachusetts to host events focused on economic and school issues.", "url": "https://apnews.com/39e51f5875d161ea161373415b7f0a29", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:11:31Z", "content": "BOSTON (AP) The Congressional Black Caucus is making its first visit to Massachusetts to host events focused on economic and school issues.\r\nU.S. Rep. Ayanna Pressley, of Boston, says fellow Democratic members of the caucus are coming as part of the group's S… [+1013 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Tunisian lawmakers vote on new government amid opposition", "description": "TUNIS, Tunisia (AP) — Lawmakers in Tunisia were voting on a new government Friday, but only the moderate Islamist party that finished first in an October election said it would support the Cabinet proposed by its designated prime minister.", "url": "https://apnews.com/e2b163817ac9f110b75a1170a3ee389f", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/a/c9/ac95784e-2056-5185-a0f1-787a4b48c00c/5e18d1725e6e7.image.jpg?crop=1677%2C943%2C0%2C146&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T19:10:52Z", "content": "TUNIS, Tunisia (AP) Lawmakers in Tunisia were voting on a new government Friday, but only the moderate Islamist party that finished first in an October election said it would support the Cabinet proposed by its designated prime minister.\r\nTunisia has been in … [+1201 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By LOLITA C. BALDOR and ROBERT BURNS Associated Press", "title": "US tried, failed to take out Iranian Quds leader in Yemen", "description": "WASHINGTON (AP) — The U.S. military tried, but failed, to take out another senior Iranian commander on the same day that an American airstrike killed the Revolutionary Guard's top general, U.S. officials said Friday.", "url": "https://apnews.com/786998edec97e3845b496bb29a15ec7d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/4/6d/46d23b5b-e957-55a0-8ae4-53838f57ce88/5e164df67f156.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T19:09:25Z", "content": "WASHINGTON (AP) The U.S. military tried, but failed, to take out another senior Iranian commander on the same day that an American airstrike killed the Revolutionary Guard's top general, U.S. officials said Friday.\r\nThe officials said a military airstrike tar… [+2083 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "Hospital worker accused of beating 13-year-old patient", "description": "PENSACOLA, Fla. (AP) — An maintenance worker at a Florida hospital is accused of beating a 13-year-old patient after hearing that the child had made the holes in a wall that he repairing.", "url": "https://apnews.com/64bd27d7d62a9c721991eab9a6f8b433", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:08:55Z", "content": "PENSACOLA, Fla. (AP) An maintenance worker at a Florida hospital is accused of beating a 13-year-old patient after hearing that the child had made the holes in a wall that he repairing.\r\nKevin Douglas, 47, was arrested Wednesday on charges of cruelty to a chi… [+1159 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kuster, Pappas vote for war powers resolution", "description": "CONCORD, N.H. (AP) — New Hampshire's two House members, both of them Democrats, voted with the majority to approve a resolution asserting that President Donald Trump must seek approval from Congress before engaging in further military action against Iran.", "url": "https://apnews.com/719f6d615e8546e7cb663238dd95a95f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:08:44Z", "content": "CONCORD, N.H. (AP) New Hampshire's two House members, both of them Democrats, voted with the majority to approve a resolution asserting that President Donald Trump must seek approval from Congress before engaging in further military action against Iran.\r\nThe … [+1108 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Murder suspect gets month to think over plea deal", "description": "NEW LONDON, Conn. (AP) — A Connecticut man whose murder conviction was overturned by the state Supreme Court has until next month to decide whether to accept a plea deal from prosecutors or face a retrial.", "url": "https://apnews.com/67cac1c66eace6b5b122b356e6821daa", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:06:24Z", "content": "NEW LONDON, Conn. (AP) A Connecticut man whose murder conviction was overturned by the state Supreme Court has until next month to decide whether to accept a plea deal from prosecutors or face a retrial.\r\nA lawyer for Jean Jacques, charged in the 2015 slaying… [+913 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Special prosecutor sought in attack after bus fatal sentence", "description": "ROCHESTER, Ind. (AP) — A special prosecutor should be appointed to determine whether a northern Indiana woman will be charged in an attack on a woman who had just been sentenced in a crash that killed her three children at…", "url": "https://apnews.com/3412b96953434ddebe356e0ecad60741", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:06:22Z", "content": "ROCHESTER, Ind. (AP) A special prosecutor should be appointed to determine whether a northern Indiana woman will be charged in an attack on a woman who had just been sentenced in a crash that killed her three children at a school bus stop, county prosecutors … [+2351 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man shot by Vermont troopers in Bristol facing 5 charges", "description": "BRISTOL, Vt. (AP) — The Vermont man who was shot and wounded by state troopers following a confrontation outside his home in the town of Bristol is now facing criminal charges, police said Friday.", "url": "https://apnews.com/4b71740a6e1de0149518e20dc9e95c1f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:06:05Z", "content": "BRISTOL, Vt. (AP) The Vermont man who was shot and wounded by state troopers following a confrontation outside his home in the town of Bristol is now facing criminal charges, police said Friday.\r\nGreg West, 28, was charged with two counts of aggravated assaul… [+992 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge sentences man for killing US Army officer for 'fun'", "description": "COLORADO SPRINGS, Colo. (AP) — A Colorado judge on Friday sentenced a man to 74 years in prison for the shooting death of a U.S. Army officer, a killing the judge said was committed at random and for “fun.”", "url": "https://apnews.com/7279aa4f1c442910adb8502ea27c0c83", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T19:05:39Z", "content": "COLORADO SPRINGS, Colo. (AP) A Colorado judge on Friday sentenced a man to 74 years in prison for the shooting death of a U.S. Army officer, a killing the judge said was committed at random and for fun.\r\nFourth Judicial District Chief William Bain referred to… [+1346 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By GARY D. ROBERTSON Associated Press", "title": "N Carolina GOP legislators make late pitch to keep photo ID", "description": "RALEIGH, N.C. (AP) — North Carolina Republican lawmakers made a last-minute plea on Friday to a federal judge as they seek to save a photo identification requirement to vote that had been set to begin with the March primary.", "url": "https://apnews.com/2579806dac14e2b56bab3003daf192ad", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/custom/image/aacc4e10-0064-11e7-adc2-d3321407a1f8.jpg", "publishedAt": "2020-01-10T19:02:36Z", "content": "RALEIGH, N.C. (AP) North Carolina Republican lawmakers made a last-minute plea on Friday to a federal judge as they seek to save a photo identification requirement to vote that had been set to begin with the March primary.\r\nThe GOP legislative leaders already… [+3001 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "College employee fired for Facebook post about Iran", "description": "WELLESLEY, Mass. (AP) — A Massachusetts college employee who was suspended for posting a controversial Facebook post about Iran bombing the U.S. has been fired, the school said.", "url": "https://apnews.com/c8e7354fa372c96981c09fbccc177036", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:59:45Z", "content": "WELLESLEY, Mass. (AP) A Massachusetts college employee who was suspended for posting a controversial Facebook post about Iran bombing the U.S. has been fired, the school said.\r\nBabson College's director of sustainability, Asheen Phansey, was suspended and the… [+1744 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By EVENS SANON and MICHAEL WEISSENSTEIN Associated Press", "title": "A decade after Haitian earthquake, a young victim struggles", "description": "CANAAN, Haiti (AP) — Just before 5 p.m., Marie-Mislen Thomas’ house fell on top of her three children.", "url": "https://apnews.com/693f88d245dbb8d59e6c4350309915ff", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/6/2f/62f703f6-dad3-512d-939a-d1565bf9a0de/5e18ca2de32a5.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T18:59:15Z", "content": "CANAAN, Haiti (AP) Just before 5 p.m., Marie-Mislen Thomas house fell on top of her three children.\r\nIn the first nightmarish hour after a massive earthquake devastated Haiti on Jan. 12, 2010, the Thomases were able to pull their sons Chilo and Jameson from t… [+5359 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Google legal chief leaving amid sexual misconduct troubles", "description": "SAN FRANCISCO (AP) — David Drummond, the legal chief of Google parent company Alphabet, is leaving at the end of the month, following accusations of inappropriate relationships with employees.", "url": "https://apnews.com/b687428bb6b5c55a22f6e9de3f2075a5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/3/c9/3c977166-117f-5882-8705-ec435e8b0f80/5e18cd6241406.image.jpg?crop=1769%2C995%2C0%2C87&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T18:58:49Z", "content": "SAN FRANCISCO (AP) David Drummond, the legal chief of Google parent company Alphabet, is leaving at the end of the month, following accusations of inappropriate relationships with employees.\r\nAlphabet did not give a reason for Drummond's departure in a short … [+1007 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ADRIAN SAINZ Associated Press", "title": "Markers recognizing 2 lynchings in Tennessee to be installed", "description": "JACKSON, Tenn. (AP) — In 1886, an African American domestic worker was accused of poisoning her white employer in Jackson, Tennessee. A mob broke into the city's jail, dragged Eliza Woods to the courthouse lawn, ripped her clothes off, and…", "url": "https://apnews.com/d6a6c7eef727a71a0377cf47bcdff400", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:58:47Z", "content": "JACKSON, Tenn. (AP) In 1886, an African American domestic worker was accused of poisoning her white employer in Jackson, Tennessee. A mob broke into the city's jail, dragged Eliza Woods to the courthouse lawn, ripped her clothes off, and hanged her from a tre… [+4287 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ANDREW SELIGMAN AP Sports Writer", "title": "AP Source: Cubs, Bryant agree to $18.6 million, 1-year deal", "description": "CHICAGO (AP) — Third baseman Kris Bryant avoided arbitration with the Chicago Cubs, agreeing Friday to an $18.6 million, one-year contract, a person familiar with the situation told The Associated", "url": "https://apnews.com/206f19b3602154f419f96faacc2ed2c0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-10T18:57:58Z", "content": "CHICAGO (AP) Third baseman Kris Bryant avoided arbitration with the Chicago Cubs, agreeing Friday to an $18.6 million, one-year contract, a person familiar with the situation told The Associated Press.\r\nThe person spoke on the condition of anonymity because t… [+1070 chars]"}]}