{"status": "ok", "totalResults": 75, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Idaho House panel nixes some security searches at Statehouse", "description": "BOISE, Idaho (AP) — A House panel on Monday nixed some searches of personal belongings at the Statehouse and other state government buildings out of concern such searches could be unconstitutional.", "url": "https://apnews.com/5f558d1d74dfbeb5ac80291d587e2410", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-13T19:57:34Z", "content": "BOISE, Idaho (AP) A House panel on Monday nixed some searches of personal belongings at the Statehouse and other state government buildings out of concern such searches could be unconstitutional.\r\nThe House State Affairs Committee removed language from admini… [+1217 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Innocence claim in 1976 rape may continue in appeals court", "description": "CHARLOTTE, N.C. (AP) — Attorneys for a North Carolina man who says he’s innocent of a 1976 rape are planning to request a hearing before the full 4th U.S. Circuit Court of Appeals after a three-judge panel refused to reopen…", "url": "https://apnews.com/eaa6093865f184d6dbc3e5ba2aab6c91", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:56:41Z", "content": "CHARLOTTE, N.C. (AP) Attorneys for a North Carolina man who says hes innocent of a 1976 rape are planning to request a hearing before the full 4th U.S. Circuit Court of Appeals after a three-judge panel refused to reopen the case.\r\nThe Charlotte Observer repo… [+2787 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Indiana police arrest man driving pickup missing 1 tire", "description": "INDIANAPOLIS (AP) — A man who drove his pickup truck for several miles along Interstate 70 without one of its front tires was arrested after another motorist called 911 to report a shower of sparks coming from the truck.", "url": "https://apnews.com/b33f547793c9e225b4379403d91c6563", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:54:31Z", "content": "INDIANAPOLIS (AP) A man who drove his pickup truck for several miles along Interstate 70 without one of its front tires was arrested after another motorist called 911 to report a shower of sparks coming from the truck.\r\nThe motorist who spotted the pickup wit… [+652 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ADAM BEAM Associated Press", "title": "California weighs unique intersex surgery ban for some kids", "description": "SACRAMENTO, Calif. (AP) — California lawmakers are considering a first-of-its-kind ban on medically unnecessary surgeries for children born with ambiguous or conflicting genitalia until they are at least 6.", "url": "https://apnews.com/aa38740d8906996ce1e137c30d814823", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:54:21Z", "content": "SACRAMENTO, Calif. (AP) California lawmakers are considering a first-of-its-kind ban on medically unnecessary surgeries for children born with ambiguous or conflicting genitalia until they are at least 6.\r\nThe measure refers to intersex people who are born wi… [+1634 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Connecticut man pleads guilty in fatal shooting of niece", "description": "BRIDGEPORT, Conn. (AP) — A Connecticut man pleaded guilty Monday to fatally shooting his niece and wounding her boyfriend, just before his murder trial was scheduled to start.", "url": "https://apnews.com/cb5bee3b9cf5f137b957b6b4cd3c51fd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:54:20Z", "content": "BRIDGEPORT, Conn. (AP) A Connecticut man pleaded guilty Monday to fatally shooting his niece and wounding her boyfriend, just before his murder trial was scheduled to start.\r\nMichael Catchings, 23, of Stratford, had faced a murder charge in the August 2017 de… [+853 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ASTRID GALVAN Associated Press", "title": "Trial opens in suit over Border Patrol detention conditions", "description": "TUCSON, Ariz. (AP) — The trial in a lawsuit alleging unsafe and inhuman detention conditions in several of the Border Patrol’s Arizona stations began Monday in Tucson.", "url": "https://apnews.com/71281fac9bde773cb80f87f5f8aeffb1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/9/87/987acc6c-a416-57bc-b1d7-fb2067509bf2/5e1b62746d828.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T19:52:03Z", "content": "TUCSON, Ariz. (AP) The trial in a lawsuit alleging unsafe and inhuman detention conditions in several of the Border Patrols Arizona stations began Monday in Tucson.\r\nThe lawsuit filed in 2015 applies to eight Border Patrol facilities where attorneys say migra… [+2780 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Louisiana regulators consider denying hazardous waste permit", "description": "COLFAX, La. (AP) — Louisiana regulators have filed their intent to deny a permit to a company that burns explosive material unless it pursues more environmentally sound practices.", "url": "https://apnews.com/604fa6fde559af6abbaadbc7f0fc9c1a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:50:27Z", "content": "COLFAX, La. (AP) Louisiana regulators have filed their intent to deny a permit to a company that burns explosive material unless it pursues more environmentally sound practices.\r\nClean Harbors has burned materials including propellant for car air bags, solid … [+1659 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Georgia sets anti-trafficking training for employees, others", "description": "ATLANTA (AP) — Georgia is offering a new online training course to educate people on how to recognize human trafficking and how to take action if someone spots it.", "url": "https://apnews.com/7906b51524b07b5dda98a04902a4d900", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/5/2c/52c5a88f-9938-5582-984d-2b59ed209e5b/5e1cccda0cb53.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T19:46:42Z", "content": "ATLANTA (AP) Georgia is offering a new online training course to educate people on how to recognize human trafficking and how to take action if someone spots it.\r\nGov. Brian Kemp and first lady Marty Kemp announced the plan Monday.\r\nKemp said he will mandate … [+1183 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man dies in shooting after police chase in Carthage", "description": "CARTHAGE, Mo. (AP) — A man was shot to death by law enforcement officers after he exchanged gunfire with them following a police that ended in Carthage, law enforcement authorities said.", "url": "https://apnews.com/19dca5b838a18c40d947f679dbb16549", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:46:37Z", "content": "CARTHAGE, Mo. (AP) A man was shot to death by law enforcement officers after he exchanged gunfire with them following a police that ended in Carthage, law enforcement authorities said.\r\nThe shooting occurred Sunday night in a parking lot in Carthage when two … [+738 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Israel's lawmakers deliver setback for Netanyahu immunity", "description": "JERUSALEM (AP) — Israeli lawmakers on Monday approved the formation of a committee to consider Prime Minister Benjamin Netanyahu's request for legal immunity, a major setback for the embattled leader who is seeking to fend off corruption charges.", "url": "https://apnews.com/fda4e95ce5cdecde4bd799791dde0822", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/5/86/58659c9b-180a-5294-88a0-ad9e633d6050/5e1cb73e5a078.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T19:40:30Z", "content": "JERUSALEM (AP) Israeli lawmakers on Monday approved the formation of a committee to consider Prime Minister Benjamin Netanyahu's request for legal immunity, a major setback for the embattled leader who is seeking to fend off corruption charges.\r\nNetanyahu was… [+2037 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DON THOMPSON Associated Press", "title": "California governor promotes $1 billion housing plan on tour", "description": "SACRAMENTO, Calif. (AP) — Gov. Gavin Newsom began a week-long statewide tour Monday promoting his $1 billion effort to address one of California's most pressing and politically fraught problems — its growing homeless crisis.", "url": "https://apnews.com/bb8c9eb6a8c9f8c1727f830039bf33ed", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/4/3d/43da6a76-9521-5e2e-9ce9-ff4c1dfa7848/5e19eddbe570c.image.jpg?crop=1827%2C1028%2C0%2C53&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T19:38:32Z", "content": "SACRAMENTO, Calif. (AP) Gov. Gavin Newsom began a week-long statewide tour Monday promoting his $1 billion effort to address one of California's most pressing and politically fraught problems its growing homeless crisis.\r\nThe Democratic governor began the tri… [+2714 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Nationals prospect Fausto Segura dies at 23", "description": "WASHINGTON (AP) — The Nationals say pitching prospect Fausto Segura has died. He was 23.", "url": "https://apnews.com/35f2f16f745899b1d9d3ccb10cfaebd5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:37:56Z", "content": "WASHINGTON (AP) The Nationals say pitching prospect Fausto Segura has died. He was 23.\r\nThe team announced the news in a statement Monday. ESPN Deportes reported that Segura died in a traffic accident Sunday night in his hometown of Barahona, Dominican Republ… [+780 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Date rape drug found, 2 Alabama women arrested in Georgia", "description": "LaGRANGE, Ga. (AP) — Two Alabama women were arrested after a vehicle search in Georgia uncovered about 2 gallons of a chemical commonly known as a date rape drug, authorities said Monday.", "url": "https://apnews.com/f0441dc30e71158934838433ebb43380", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:37:36Z", "content": "LaGRANGE, Ga. (AP) Two Alabama women were arrested after a vehicle search in Georgia uncovered about 2 gallons of a chemical commonly known as a date rape drug, authorities said Monday.\r\nThe Troup County Sheriff's Office said in a news release that an officer… [+890 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Vols violations include player promoting replica jersey sale", "description": "KNOXVILLE, Tenn. (AP) — Tennessee has self-reported an NCAA violation that involved a football player advertising the sale of a replica version of his jersey on Facebook.", "url": "https://apnews.com/f93a939f579961251c255caa2aff1546", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-13T19:35:09Z", "content": "The player received education on the rules and was held out of athletic competition until the NCAA reinstated him on Dec. 19. School officials said that if they can identify the jersey manufacturer, they will send a cease-and-desist order on the production of… [+1215 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By STEVE KARNOWSKI Associated Press", "title": "Minnesota Senate GOP lays out priorities for 2020 session", "description": "MN--Minnesota Senate GOP (AP) — Eliminating the state's partial tax on Social Security benefits, reducing violent crime in the Twin Cities and reforming the state Department of Human Services are some of the top priorities for the 2020 legislative session…", "url": "https://apnews.com/7c268719f52049d59aeaecba3d305ed1", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-13T19:34:01Z", "content": "MN--Minnesota Senate GOP (AP) Eliminating the state's partial tax on Social Security benefits, reducing violent crime in the Twin Cities and reforming the state Department of Human Services are some of the top priorities for the 2020 legislative session that … [+1130 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man arrested after 15-year-old dog shot, left dead in gutter", "description": "LOS ANGELES (AP) — A Southern California man was arrested on suspicion of animal cruelty after authorities said he shot a 15-year-old dog and left it dead in a gutter.", "url": "https://apnews.com/85f92d95f35b4ae618a1f0bc85e33db3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:32:45Z", "content": "LOS ANGELES (AP) A Southern California man was arrested on suspicion of animal cruelty after authorities said he shot a 15-year-old dog and left it dead in a gutter.\r\nShane Dubyak was apprehended last week after leading sheriff's deputies on a pursuit during … [+928 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge in dismemberment trial tells jurors to keep working", "description": "GRAND RAPIDS, Mich. (AP) — A judge in western Michigan told struggling jurors to keep deliberating Monday in the trial of a former police officer who was charged with assisting his son after the younger man killed and dismembered a…", "url": "https://apnews.com/67d60018b22a7d9602e7e5f3e3067dc9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:32:44Z", "content": "GRAND RAPIDS, Mich. (AP) A judge in western Michigan told struggling jurors to keep deliberating Monday in the trial of a former police officer who was charged with assisting his son after the younger man killed and dismembered a woman.\r\nThe jury foreman said… [+1181 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man pleads in teen's slaying, is sentenced to 25 to 60 years", "description": "ALLENTOWN, Pa. (AP) — A man has been sentenced to 25 to 60 years in state prison in the slaying of a teenager shot in the bedroom of his eastern Pennsylvania home 7 1/2 years ago.", "url": "https://apnews.com/dca770caa76d2eec40b4213659a40551", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:31:33Z", "content": "ALLENTOWN, Pa. (AP) A man has been sentenced to 25 to 60 years in state prison in the slaying of a teenager shot in the bedroom of his eastern Pennsylvania home 7 1/2 years ago.\r\nThe (Allentown) Morning Call reports that 29-year-old Quante Cruz pleaded guilty… [+804 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Teen arrested after shots fired during armed robbery", "description": "CHARLOTTE, N.C. (AP) — A 15-year-old faces multiple charges in an armed robbery in North Carolina in which he “shot numerous times,” according to police.", "url": "https://apnews.com/9bbb64b07ee59551111133483fff9cdd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:31:18Z", "content": "CHARLOTTE, N.C. (AP) A 15-year-old faces multiple charges in an armed robbery in North Carolina in which he shot numerous times, according to police.\r\nThe teenager fired shots inside a gas station where he demanded property from an employee early Sunday, acco… [+795 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Rhode Island gas prices remain steady", "description": "PROVIDENCE, R.I. (AP) — A week after a big jump, gasoline prices in Rhode Island remained steady in AAA Northeast's latest price survey released Monday.", "url": "https://apnews.com/c4520c57fea4d7c8cb23be366ee7e9c5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T19:30:38Z", "content": "PROVIDENCE, R.I. (AP) A week after a big jump, gasoline prices in Rhode Island remained steady in AAA Northeast's latest price survey released Monday.\r\nThe average price of self-serve, regular was unchanged at $2.57 per gallon. Rhode Islands price is a penny … [+496 chars]"}]}