{"status": "ok", "totalResults": 75, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Warrant: Mom left infant who drowned in tub for 'me time'", "description": "KNOXVILLE, Tenn. (AP) — A Tennessee infant left in a bathtub without supervision has died and his mother is facing an abuse charge after telling authorities she left the child to have some “me time.\"", "url": "https://apnews.com/8c97b4be897efcf8f14268ce9a1cbcdd", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-10T18:18:56Z", "content": "KNOXVILLE, Tenn. (AP) A Tennessee infant left in a bathtub without supervision has died and his mother is facing an abuse charge after telling authorities she left the child to have some me time.\"\r\nThe boy, who was found unresponsive in the tub Wednesday nigh… [+978 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By COLLIN BINKLEY AP Education Writer", "title": "MIT warns foreign students of possible visits from ICE", "description": "BOSTON (AP) — The Massachusetts Institute of Technology is warning international students that federal immigration officials may visit their work sites to verify that their employment is directly related to their studies.", "url": "https://apnews.com/643453241825dd4e1c475a4d61c70a71", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-10T18:18:43Z", "content": "BOSTON (AP) The Massachusetts Institute of Technology is warning international students that federal immigration officials may visit their work sites to verify that their employment is directly related to their studies.\r\nSchool officials sent a memo to facult… [+3946 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BEN FOX Associated Press", "title": "US adds more Iran sanctions, confronts doubts about threat", "description": "WASHINGTON (AP) — President Donald Trump ordered new retaliatory economic sanctions on Iran Friday, even as his administration faced persistent questions over its drone strike on an Iranian general that helped ignite the latest crisis with the Islamic Republi…", "url": "https://apnews.com/46b2ae6d9a3cb1a436f9ce90057dfe7c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/8/b9/8b9d22dd-26ed-54de-9dd9-fee4ddd7ae91/5e18c3385ee6c.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T18:16:48Z", "content": "WASHINGTON (AP) President Donald Trump ordered new retaliatory economic sanctions on Iran Friday, even as his administration faced persistent questions over its drone strike on an Iranian general that helped ignite the latest crisis with the Islamic Republic.… [+2968 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Prosecutors: Man charged with murder in street shooting", "description": "CAMDEN, N.J. (AP) — A man has been charged with murder in the shooting death of a Philadelphia man found wounded on a southern New Jersey street last year.", "url": "https://apnews.com/1dfc3ac37e8f0de65ef861900f3661c9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:15:14Z", "content": "CAMDEN, N.J. (AP) A man has been charged with murder in the shooting death of a Philadelphia man found wounded on a southern New Jersey street last year.\r\nJamil Beatty, 30, of Camden, was arrested Wednesday at his home and remains jailed pending a detention h… [+580 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "UVA School of Nursing receives record gift of $20 million", "description": "CHARLOTTESVILLE, Va. (AP) — The University of Virginia’s School of Nursing has received a $20 million gift to support the enrollment of more than 1,000 students in its programs over the next decade.", "url": "https://apnews.com/f5bc9f090cb2a7feee90f30d92b14802", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:11:33Z", "content": "CHARLOTTESVILLE, Va. (AP) The University of Virginias School of Nursing has received a $20 million gift to support the enrollment of more than 1,000 students in its programs over the next decade.\r\nUVA said in a news release Thursday that the gift from Joanne … [+1847 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Walz proposes $300 million in borrowing for water projects", "description": "ST. PAUL, Minn. (AP) — Minnesota should borrow $300 million to replace aging infrastructure and upgrade treatment facilities to protect its water supplies, Gov. Tim Walz proposed Friday as he announced the second of four installments of his public works…", "url": "https://apnews.com/a5c465ffb2ab8f8f90f452e290418c35", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/assets/v3/editorial/e/22/e22c25e9-7536-5faa-83e3-bd648227c35e/5e17869097a4d.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T18:10:56Z", "content": "ST. PAUL, Minn. (AP) Minnesota should borrow $300 million to replace aging infrastructure and upgrade treatment facilities to protect its water supplies, Gov. Tim Walz proposed Friday as he announced the second of four installments of his public works borrowi… [+1213 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DAVE SKRETTA AP Basketball Writer", "title": "Baylor-Kansas headlines second weekend of Big 12 hoops play", "description": "LAWRENCE, Kan. (AP) — The Big 12 heads into its second week of conference play, and a high-profile matchup between third-ranked Kansas and No. 4 Baylor on Saturday could set the stage for the rest of the season. Here are…", "url": "https://apnews.com/3e3d2d21ef5d19d05bfb297b1cfecd44", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/c/4f/c4f6403d-46a5-59e7-bc17-9618259d3869/5e18c68b6c907.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T18:10:12Z", "content": "LAWRENCE, Kan. (AP) The Big 12 heads into its second week of conference play, and a high-profile matchup between third-ranked Kansas and No. 4 Baylor on Saturday could set the stage for the rest of the season. Here are the things to know:\r\nGAME OF THE WEEKEND… [+1077 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "India crushes Sri Lanka by 78 runs to win T20 series 2-0", "description": "PUNE, India (AP) — India beat Sri Lanka by 78 runs to win the three-match Twenty20 series 2-0 on Friday.", "url": "https://apnews.com/68ec4651a00a290370581107d4c6b20f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-10T18:10:10Z", "content": "Virat Kohli (26 off 17 balls) and Manish Pandey added 42 runs for the fifth wicket to put India back in charge. Kohli was run out in the death overs while Pandey smacked 31 not out off 18 balls, including four fours.\r\nShardul Thakur smashed 22 not out off eig… [+1083 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man with hammer shot by deputy in Alabama identified", "description": "SEMMES, Ala. (AP) — A hammer-wielding man who was shot and killed by a deputy outside a Walmart store in Alabama has been identified.", "url": "https://apnews.com/20885edc573c485fa74936f3daf61163", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-10T18:09:38Z", "content": "SEMMES, Ala. (AP) A hammer-wielding man who was shot and killed by a deputy outside a Walmart store in Alabama has been identified.\r\nBernie Wade Johnson, 34, was confronted by the deputy Thursday after store workers called reported a theft. Johnson threatened… [+576 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Firefighters discover man shot to death inside burning house", "description": "EMERALD ISLE, N.C. (AP) — Firefighters responding to a house fire on the North Carolina coast found the body of a man who authorities say had been shot to death, police said.", "url": "https://apnews.com/1aa280549d3ee818c258a72f1da4df09", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:08:18Z", "content": "EMERALD ISLE, N.C. (AP) Firefighters responding to a house fire on the North Carolina coast found the body of a man who authorities say had been shot to death, police said.\r\nEmerald Isle police say they were called to a home on just after 8:30 p.m. Thursday, … [+659 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Authorities ID couple found dead in Story County home", "description": "COLO, Iowa (AP) — Authorities have released the names of two people who were found dead by a relative in their Story County home — deaths that authorities say were the result of a murder-suicide.", "url": "https://apnews.com/a6a3e4dfb307c8afcd2ee65be792716b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:05:57Z", "content": "COLO, Iowa (AP) Authorities have released the names of two people who were found dead by a relative in their Story County home deaths that authorities say were the result of a murder-suicide.\r\nThey've been identified as Richard Davis, 79, and his 78-year-old … [+788 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BRUCE SCHREINER Associated Press", "title": "Bills respond to Bevin's flurry of last-minute pardons", "description": "FRANKFORT, Ky. (AP) — Responding to former Gov. Matt Bevin's flurry of last-minute pardons, Kentucky lawmakers have introduced bills that would put checks on gubernatorial pardon powers and ensure victims are notified before their assailants are given clemenc…", "url": "https://apnews.com/0b886658ab4eb4362580c3d7433705f6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T18:04:55Z", "content": "FRANKFORT, Ky. (AP) Responding to former Gov. Matt Bevin's flurry of last-minute pardons, Kentucky lawmakers have introduced bills that would put checks on gubernatorial pardon powers and ensure victims are notified before their assailants are given clemency.… [+3608 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "NC to mark 75th anniversary of deaths in secret WWII project", "description": "ELIZABETH CITY, N.C. (AP) — The Russian ambassador to the U.S. is among those expected to attend a service to mark the 75th anniversary of the deaths of five people during a top-secret World War II mission when hundreds of…", "url": "https://apnews.com/e9d21b71ad0814d3b7359f7f950bba3f", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-10T18:03:08Z", "content": "ELIZABETH CITY, N.C. (AP) The Russian ambassador to the U.S. is among those expected to attend a service to mark the 75th anniversary of the deaths of five people during a top-secret World War II mission when hundreds of Soviet aviators trained on North Carol… [+1802 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Watchdog: Officer's ruse contributed to suspect's suicide", "description": "SEATTLE (AP) — The Seattle Police Department's civilian watchdog has found that an officer's ruse in a 2018 hit-and-run case contributed to the driver's suicide.", "url": "https://apnews.com/534e59f0b23f007b92ff92f3db2709fa", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-10T18:01:35Z", "content": "SEATTLE (AP) The Seattle Police Department's civilian watchdog has found that an officer's ruse in a 2018 hit-and-run case contributed to the driver's suicide.\r\nThe Office of Police Accountability said that to get the suspect to turn himself in, the officer t… [+2642 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ALEXANDRA JAFFE Associated Press", "title": "Spiritual guru Marianne Williamson ends 2020 White House bid", "description": "DES MOINES, Iowa (AP) — Democratic presidential candidate Marianne Williamson, the spiritual guru and bestselling author, ended her campaign on Friday, weeks before voting begins, saying she did not want to make it tougher for a progressive to win.", "url": "https://apnews.com/6dca04808d45ff6b809cb0361fb4291a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/7/57/757b8eec-bfaa-50a7-a969-b200f33d394a/5e18c3472b420.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T18:00:46Z", "content": "DES MOINES, Iowa (AP) Democratic presidential candidate Marianne Williamson, the spiritual guru and bestselling author, ended her campaign on Friday, weeks before voting begins, saying she did not want to make it tougher for a progressive to win.\r\nShe also sa… [+794 chars]"}]}