{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MARK JOHNSON Lansing State Journal", "title": "Michigan State students skip holiday break to care for sheep", "description": "MERIDIAN TOWNSHIP, Mich. (AP) — While her classmates went home to celebrate the holidays over winter break, Michigan State University junior Rachel VonDoloski stayed behind to watch the flock.", "url": "https://apnews.com/02e5b8260ae317c1b4b2ebd6dd93dffe", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T06:01:09Z", "content": "MERIDIAN TOWNSHIP, Mich. (AP) While her classmates went home to celebrate the holidays over winter break, Michigan State University junior Rachel VonDoloski stayed behind to watch the flock.\r\nAfter all, its breeding season at the MSU Sheep Teaching and Resear… [+3283 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By FREDERICK MELO St. Paul Pioneer Press", "title": "St. Paul Animal Control sees opportunity for collaboration", "description": "ST. PAUL, Minn. (AP) — Molly Lunaris faced a cat crisis: 84 felines, most of them less than a year old, roaming largely unattended in a St. Paul home.", "url": "https://apnews.com/f143d2282ebe9d93046b8ed739b1fdac", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/3/a0/3a029f68-1dcd-53d5-8e8a-3a8aebdbe85d/5e1522dc30114.image.jpg?crop=1854%2C1043%2C0%2C37&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T06:01:08Z", "content": "ST. PAUL, Minn. (AP) Molly Lunaris faced a cat crisis: 84 felines, most of them less than a year old, roaming largely unattended in a St. Paul home.\r\nIn a different era, the intense animal hoarding might have been handled with back-to-back euthanasias rather … [+8667 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Danica Coto", "title": "Experts warn Puerto Rico not prepared for big earthquakes", "description": "SAN JUAN, Puerto Rico (AP) — More than two years ago, Hurricane Maria revealed that Puerto Rico was utterly unprepared for a powerful hurricane despite its location in one of the world's most...", "url": "https://apnews.com/8d5cbcf5b342038bd164fb7f0a5f081c", "urlToImage": "https://storage.googleapis.com/afs-prod/media/7bc8a07fe587410d810fa5f4766399da/3000.jpeg", "publishedAt": "2020-01-13T06:00:26Z", "content": "SAN JUAN, Puerto Rico (AP) More than two years ago, Hurricane Maria revealed that Puerto Rico was utterly unprepared for a powerful hurricane despite its location in one of the worlds most storm-vulnerable regions.\r\nNow, a flurry of earthquakes topped by a ma… [+5255 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Defending champ Sandgren wins 1st round match in Auckland", "description": "AUCKLAND, New Zealand (AP) — Defending champion Tennys Sandgren of the United States is into the second round of the ASB Classic, beating New Zealand doubles specialist Michael Venus 6-4, 6-3.", "url": "https://apnews.com/79783ae5280d0b7fd6fb2177a4ed5960", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-13T06:00:05Z", "content": "AUCKLAND, New Zealand (AP) Defending champion Tennys Sandgren of the United States is into the second round of the ASB Classic, beating New Zealand doubles specialist Michael Venus 6-4, 6-3.\r\nSandgren won his maiden ATP title in Auckland last year, beating Br… [+1012 chars]"}]}