{"status": "ok", "totalResults": 74, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Most state lawmakers gather in Helena for Legislative Week", "description": "HELENA, Mont. (AP) — About 120 of the state's 150 legislators were expected to gather in Helena for Legislative Week starting Monday.", "url": "https://apnews.com/11ae855901ea1136d8ecc2f6a29f1dd9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:26:24Z", "content": "HELENA, Mont. (AP) About 120 of the state's 150 legislators were expected to gather in Helena for Legislative Week starting Monday.\r\nLawmakers have scheduled several interim committee meetings this week in what they describe as a way of trying out meeting eve… [+451 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Batman bandit wanted for church burglaries", "description": "JASPER, Ala. (AP) — Police in Alabama are looking for a man who disguised himself as Batman while stealing musical instruments from churches.", "url": "https://apnews.com/2479536fe55ef782f574e81b7d906c53", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:24:42Z", "content": "JASPER, Ala. (AP) Police in Alabama are looking for a man who disguised himself as Batman while stealing musical instruments from churches.\r\nA burglary happened on Dec. 11 at King's Way Church in Irondale, AL.Comreported. The caped crook stole a keyboard and … [+978 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Pennsylvania cranks up PR campaign to boost census response", "description": "HARRISBURG, Pa. (AP) — Pennsylvania's second lady, Giselle Fetterman, will help lead a campaign to raise awareness of this year's Census Bureau count and éncourage residents to respond to the census, state officials said Monday.", "url": "https://apnews.com/2b1dfe882a676b4f2c62c0b09d72c0f0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:21:02Z", "content": "HARRISBURG, Pa. (AP) Pennsylvania's second lady, Giselle Fetterman, will help lead a campaign to raise awareness of this year's Census Bureau count and éncourage residents to respond to the census, state officials said Monday.\r\nFetterman, whose husband is Lt.… [+1309 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kansas adjutant general Tafanelli plans to retire in March", "description": "TOPEKA, Kan. (AP) — Kansas Adjutant General Maj. Gen. Lee Tafanelli plans to retire in March, Gov. Laura Kelly announced Monday.", "url": "https://apnews.com/434feae8c479bec0e5065fd84ebf6fbb", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-13T20:20:53Z", "content": "TOPEKA, Kan. (AP) Kansas Adjutant General Maj. Gen. Lee Tafanelli plans to retire in March, Gov. Laura Kelly announced Monday.\r\nTafanelli has been adjutant general since 2011. The office's responsibilities include overseeing the Kansas Army and Air National G… [+1005 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Leafs lose Rielly for at least 8 weeks with broken foot", "description": "TORONTO (AP) — The Toronto Maple Leafs have lost defenseman Morgan Rielly for at least eight weeks with a fractured foot.", "url": "https://apnews.com/41d444d0ef2a4793a6c100e580abb7fc", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/a/0c/a0c00713-3f4d-57c4-9877-1212451e5490/5e16ac5a8f3a8.image.jpg?crop=1757%2C988%2C0%2C95&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T20:19:54Z", "content": "TORONTO (AP) The Toronto Maple Leafs have lost defenseman Morgan Rielly for at least eight weeks with a fractured foot.\r\nRielly blocked a shot in the first period of Sunday night's 8-4 loss in Florida but managed to finish the game.\r\nTeenage defenseman Rasmus… [+1049 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man found dead in Tucson apartment complex after shooting", "description": "TUCSON, Ariz. (AP) — Pima County Sheriff’s deputies are investigating a suspicious death after responding to reports of a shooting northwest of Tucson.", "url": "https://apnews.com/ce602cc08483107c3e7687a4a6837de8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:19:48Z", "content": "TUCSON, Ariz. (AP) Pima County Sheriffs deputies are investigating a suspicious death after responding to reports of a shooting northwest of Tucson.\r\nAuthorities say two men were taken to a hospital for treatment of gunshot wounds after the incident at an apa… [+381 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Virginia town reports second slaying in four days", "description": "HOPEWELL, Va. (AP) — A Hopewell man found shot inside a home is the city's second homicide in four days, according to police.", "url": "https://apnews.com/f1334b13bf42fe3b19472b31165ef9d3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:17:22Z", "content": "HOPEWELL, Va. (AP) A Hopewell man found shot inside a home is the city's second homicide in four days, according to police.\r\nA news release said police and paramedics responded on Sunday night to a report of shots fired and an active disturbance, the Richmond… [+826 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TERESA M. WALKER AP Pro Football Writer", "title": "Embracing road warrior mentality why Titans go to KC next", "description": "Tennessee coach Mike Vrabel made it clear before flying to Houston needing to win their regular-season finale that the Titans would have to be road warriors to keep this season alive.", "url": "https://apnews.com/afcd54d6909611457ebb819d8fc3f06a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/0/65/065ec0e1-84d5-5c03-a255-9a8b43055b22/5e1aab8305edd.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T20:14:47Z", "content": "We knew our situation started in Houston and our playoffs started then. We had to win, center Ben Jones said. All we can focus on is this week. So this is a big one for us, and we just got to take care of this week.\r\nWHATS WORKING\r\nDerrick Henry, aka El Tract… [+906 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Arizona groups seek tax hike on wealthy for education", "description": "PHOENIX (AP) — Arizona's largest teachers union and other groups said Monday that they will ask voters to raise taxes on the wealthy to pay for educator raises, a fresh attempt to boost school funding after the state Supreme Court…", "url": "https://apnews.com/7a5bc803da0fdbc21cdcd9b73561f11a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:14:31Z", "content": "PHOENIX (AP) Arizona's largest teachers union and other groups said Monday that they will ask voters to raise taxes on the wealthy to pay for educator raises, a fresh attempt to boost school funding after the state Supreme Court blocked a 2018 ballot initiati… [+1768 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Illinois lawmaker seeking Capitol parking for pregnant women", "description": "SPRINGFIELD, Ill. (AP) — An Illinois legislator wants the state to set aside reserved parking spots for expectant mothers and parents with a newborn child at the Capitol Complex.", "url": "https://apnews.com/ce02060ded70672959ce7d60b0b6393c", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-13T20:14:28Z", "content": "SPRINGFIELD, Ill. (AP) An Illinois legislator wants the state to set aside reserved parking spots for expectant mothers and parents with a newborn child at the Capitol Complex.\r\nRep. Katie Stuart, an Edwardsville Democrat, said a pregnant lobbyist raised conc… [+1607 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JENNIFER SINCO KELLEHER Associated Press", "title": "Australia-bound flight lands in Honolulu with dead passenger", "description": "HONOLULU (AP) — An Air Canada flight bound for Australia diverted to Honolulu over the weekend because of a dead passenger.", "url": "https://apnews.com/2f0f5280bbdc9e431ea4ba5758dbc6bd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:12:11Z", "content": "HONOLULU (AP) An Air Canada flight bound for Australia diverted to Honolulu over the weekend because of a dead passenger.\r\nPassenger Christopher Woodgate, 38, was pronounced dead when the flight landed in Honolulu on Saturday, said Kira Paiva-Kimura, an admin… [+1187 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Astros fire manager AJ Hinch, general manager Jeff Luhnow after MLB suspensions for sign stealing", "description": "HOUSTON (AP) — Astros fire manager AJ Hinch, general manager Jeff Luhnow after MLB suspensions for sign stealing.", "url": "https://apnews.com/941b9c2c1d858bf045259725a6e664e1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-13T20:07:04Z", "content": "HOUSTON (AP) Astros fire manager AJ Hinch, general manager Jeff Luhnow after MLB suspensions for sign stealing.\r\nCopyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\r\nKeep up with… [+124 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Winter storms bound for Sierra, Lake Tahoe this week", "description": "RENO, Nev. (AP) — The National Weather Service in Reno has issued a series of winter weather advisories and watches up and down the Sierra's eastern front as a series of storms make their way into the region.", "url": "https://apnews.com/be3727cd98c3d169a614ba5151fab5dc", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:05:22Z", "content": "RENO, Nev. (AP) The National Weather Service in Reno has issued a series of winter weather advisories and watches up and down the Sierra's eastern front as a series of storms make their way into the region.\r\nA winter weather advisory goes into effect at 4 p.m… [+787 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "US Rep. Rob Bishop decides not to run for governor", "description": "SALT LAKE CITY (AP) — Republican U.S. Rep. Rob Bishop said Monday he won't run for Utah governor.", "url": "https://apnews.com/88199101f2e31b7e6306b62f1372397a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T20:02:30Z", "content": "SALT LAKE CITY (AP) Republican U.S. Rep. Rob Bishop said Monday he won't run for Utah governor.\r\nHe told the Deseret News that he is too old at 68 to run for another office, and he doesn't need to be governor to validate my feeling of self worth.\r\nBishop inst… [+820 chars]"}]}