{"status": "ok", "totalResults": 74, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Coroner: Fatal avalanche happened where you wouldn't expect", "description": "MISSOULA, Mont. (AP) — An avalanche that killed two snowmobilers on New Year's Day happened in an area that wouldn't have been expected to slide, a western Montana coroner said.", "url": "https://apnews.com/26168afe9ad7e220229a5414a8b3572e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T17:00:56Z", "content": "MISSOULA, Mont. (AP) An avalanche that killed two snowmobilers on New Year's Day happened in an area that wouldn't have been expected to slide, a western Montana coroner said.\r\nJade Green, 24, and Lowell Grosvold, 26, were buried under several feet of snow ne… [+1490 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "2 charged with murder in shooting death during home invasion", "description": "GLOUCESTER, N.J. (AP) — Two people have been charged in the shooting death of a New Jersey man during a home invasion, police said.", "url": "https://apnews.com/11603155a3cfb7a9c37158625203b08a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:58:11Z", "content": "GLOUCESTER, N.J. (AP) Two people have been charged in the shooting death of a New Jersey man during a home invasion, police said.\r\nRosealee Gomez, 36, of Franklinville, was charged with felony murder and Chamberlin Robinson, 41, of Vineland, was charged with … [+978 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "State senator seeks delay in Alaska Real ID requirement", "description": "ANCHORAGE, Alaska (AP) — A rural state senator has called on Gov. Mike Dunleavy to seek a delay in the implementation of Alaska Real ID driver licenses.", "url": "https://apnews.com/272a2d5aa416bd19504674d769492cb3", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:56:43Z", "content": "ANCHORAGE, Alaska (AP) A rural state senator has called on Gov. Mike Dunleavy to seek a delay in the implementation of Alaska Real ID driver licenses.\r\nSen. Donny Olson, D-Golovin, on Thursday said Dunleavy should use his influence with President Donald Trump… [+955 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Attorney, church leader dies in New Year's Day crash", "description": "BRIDGEPORT, Conn. (AP) — The victim of a fatal New Year's Day car crash in Connecticut has been identified as an attorney dedicated to helping troubled youth and a leader at a city church.", "url": "https://apnews.com/d16ccbfbfa48af79003cbe288f66b25f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:54:57Z", "content": "BRIDGEPORT, Conn. (AP) The victim of a fatal New Year's Day car crash in Connecticut has been identified as an attorney dedicated to helping troubled youth and a leader at a city church.\r\nPeter Tsimbidaros, 50, died Thursday from injuries suffered in a car cr… [+820 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Reward offered for information in killing of bald eagle", "description": "DECATURVILLE, Tenn. (AP) — A bald eagle was fatally shot in Tennessee and authorities are offering a reward for information.", "url": "https://apnews.com/9005f4aff3b4a7967ac4f58fbbd38e3e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-03T16:54:53Z", "content": "DECATURVILLE, Tenn. (AP) A bald eagle was fatally shot in Tennessee and authorities are offering a reward for information.\r\nThe Tennessee Wildlife Resources Agency and U.S. Fish and Wildlife Service are offering $2,500 for information on the shooting of the e… [+495 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ROCHELLE VALVERDE Lawrence Journal-World", "title": "Munsee tribe in Kansas works to regain federal recognition", "description": "LAWRENCE, Kan. (AP) — Connie Hildebrandt has long known she was Chippewa, but it wasn’t until 2005, when her hometown newspaper published a small announcement about a meeting of Munsee descendants, that her mother mentioned to her that she was…", "url": "https://apnews.com/be7c3067d6f423f38f0e2a57adc3db66", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:54:33Z", "content": "LAWRENCE, Kan. (AP) Connie Hildebrandt has long known she was Chippewa, but it wasnt until 2005, when her hometown newspaper published a small announcement about a meeting of Munsee descendants, that her mother mentioned to her that she was also part Munsee.\r… [+5910 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DAVID PITT Associated Press", "title": "Iowa court: Automated speeding tickets not a public record", "description": "DES MOINES, Iowa (AP) — The names of car owners ticketed by automated speed cameras are not a public record, a divided Iowa Supreme Court ruled on Friday.", "url": "https://apnews.com/1a9dc7907ef18962ad7b9b5f9367673a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:53:37Z", "content": "DES MOINES, Iowa (AP) The names of car owners ticketed by automated speed cameras are not a public record, a divided Iowa Supreme Court ruled on Friday.\r\nThe court was considering a lawsuit filed by a former Ottumwa police sergeant who was ticketed while driv… [+3497 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Houston Hogg, helped integrate SEC at Kentucky, dies at 71", "description": "LEXINGTON, Ky. (AP) — Houston Hogg, one of four African-American football players at Kentucky who helped break the Southeastern Conference color line in the late 1960s, has died. He was 71.", "url": "https://apnews.com/1bb8b759deaa1ae6858060c714a45628", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-03T16:51:48Z", "content": "LEXINGTON, Ky. (AP) Houston Hogg, one of four African-American football players at Kentucky who helped break the Southeastern Conference color line in the late 1960s, has died. He was 71.\r\nThe school announced Friday that Hogg died in Owensboro, Kentucky.\r\nTh… [+1638 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Credit union manager tells police about thefts from vault", "description": "AMES, Iowa (AP) — A credit union manager has been accused of stealing hundreds of thousands of dollars from a branch he managed in Ames.", "url": "https://apnews.com/ed0bfbde5ae3405eb7f202cdaca3970c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:50:33Z", "content": "AMES, Iowa (AP) A credit union manager has been accused of stealing hundreds of thousands of dollars from a branch he managed in Ames.\r\nHenry Hill is charged with fraudulent practice and theft, Story County court records say. His preliminary hearing is schedu… [+692 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Tottenham and England striker Kane out with torn hamstring", "description": "LONDON (AP) — Tottenham striker Harry Kane sustained a tear in his left hamstring muscle during the 1-0 loss at Southampton, the London club said Friday.", "url": "https://apnews.com/8f52bf392ed30fe3ab9cba5c92c20877", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/9/a3/9a391eec-9bcb-5147-ac56-037034a06de4/5e0d053b9b3ad.image.jpg?crop=1753%2C986%2C0%2C98&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-03T16:49:11Z", "content": "Tottenham Hotspur's Harry Kane, left and Southampton's Jan Bednarek battle for the ball, during the English Premier League soccer match between Southampton and Tottenham Hotspur at St Mary's Stadium, in Southampton, England, Wednesday Jan. 1, 2020.\r\nMark Kert… [+822 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ELLE MOXLEY KCUR", "title": "Few single Kansas, Missouri moms get state help with college", "description": "KANSAS CITY, Mo. (AP) — States can get a substantial return on investment if they help single mothers in college access child care, support services and financial aid, according to a new study from the Institute for Women’s Policy Research.", "url": "https://apnews.com/a6c2078bb73c13403993857295b8d2ce", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:44:54Z", "content": "KANSAS CITY, Mo. (AP) States can get a substantial return on investment if they help single mothers in college access child care, support services and financial aid, according to a new study from the Institute for Womens Policy Research.\r\nBut even though abou… [+4044 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JOHN SEEWER Associated Press", "title": "Sheriff hit by New Year's gunfire, bounced off flak jacket", "description": "TOLEDO, Ohio (AP) — A sheriff in Ohio was sitting in his cruiser on New Year's Eve when a round of celebratory gunfire ricocheted through his window, struck him in the chest and bounced off his bullet-proof vest.", "url": "https://apnews.com/a258cc90674f7f83ed56b0c08b877c84", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-03T16:43:38Z", "content": "TOLEDO, Ohio (AP) A sheriff in Ohio was sitting in his cruiser on New Year's Eve when a round of celebratory gunfire ricocheted through his window, struck him in the chest and bounced off his bullet-proof vest.\r\nAllen County Sheriff Matt Treglia said he wasn'… [+1942 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JAMES MacPHERSON Associated Press", "title": "Missouri River power from upstream dams increases in 2019", "description": "BISMARCK, N.D. (AP) — The wet weather that caused so many flooding problems around the Midwest in 2019 had one small silver lining: electric generation from the Missouri River's six upstream dams was up 5.6 percent, federal officials said.", "url": "https://apnews.com/45f7a560025595a7d911e83abe07414d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:37:36Z", "content": "BISMARCK, N.D. (AP) The wet weather that caused so many flooding problems around the Midwest in 2019 had one small silver lining: electric generation from the Missouri River's six upstream dams was up 5.6 percent, federal officials said.\r\nIt was the first tim… [+2202 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Wisconsin elevated to high flu category after spike in cases", "description": "MILWAUKEE (AP) — The Centers for Disease Control and Prevention has elevated Wisconsin to a high flu category after a dramatic increase of cases at the state's Children's Hospital.", "url": "https://apnews.com/197235d7c91cf4762c0a018d9b88532d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:35:50Z", "content": "MILWAUKEE (AP) The Centers for Disease Control and Prevention has elevated Wisconsin to a high flu category after a dramatic increase of cases at the state's Children's Hospital.\r\nWisconsin had been in the low flu category but the CDC made the change Thursday… [+614 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Mayor wants Gary Schools to demolish abandoned buildings", "description": "GARY, Ind. (AP) — The new mayor of Gary wants the city's school corporation to demolish 10 shuttered schools amid growing concerns that they have become havens for crime.", "url": "https://apnews.com/175525e46c7856a0b8c2d67b1ab91c90", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:33:42Z", "content": "GARY, Ind. (AP) The new mayor of Gary wants the city's school corporation to demolish 10 shuttered schools amid growing concerns that they have become havens for crime.\r\nMayor Jerome Prince directed his building commissioner, Kenneth Williams, to hold a heari… [+1021 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By EMILY WAGSTER PETTUS Associated Press", "title": "Mississippi senator loyal to Trump is filing for reelection", "description": "JACKSON, Miss. (AP) — Republican U.S. Sen. Cindy Hyde-Smith of Mississippi is filing papers Friday to run for reelection, and she's expected to campaign by emphasizing her loyalty to President Donald Trump.", "url": "https://apnews.com/40994dd13509c355a74a0d7cc181ce8a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/d/35/d350fd19-f00f-5210-9ab2-7a4a40fa2d1b/5e0c9bc9d35f2.image.jpg?crop=1679%2C944%2C0%2C145&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-03T16:33:17Z", "content": "JACKSON, Miss. (AP) Republican U.S. Sen. Cindy Hyde-Smith of Mississippi is filing papers Friday to run for reelection, and she's expected to campaign by emphasizing her loyalty to President Donald Trump.\r\nA Democratic challenger, Mike Espy, has been remindin… [+3038 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Schools ID boys who died after falling through ice", "description": "CHICOPEE, Mass. (AP) — The two boys who died after apparently falling through the ice of a Massachusetts river last weekend have been publicly identified by their schools.", "url": "https://apnews.com/59a6aae282e7ff61c70eef569dfd9e04", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:31:52Z", "content": "CHICOPEE, Mass. (AP) The two boys who died after apparently falling through the ice of a Massachusetts river last weekend have been publicly identified by their schools.\r\nMinhal Hussain, 10, was a fifth-grader at Litwin Elementary School in Chicopee, accordin… [+911 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Chemical spill in river shuts down Humboldt water plant", "description": "HUMBOLDT, Kan. (AP) — A southeast Kansas town has shut down its water plant while officials investigate possible contamination from a chemical spill in the Neosho River after a chemical spill possibly contaminated the river.", "url": "https://apnews.com/27ee93094ce81e2522bd495138db9554", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:26:53Z", "content": "HUMBOLDT, Kan. (AP) A southeast Kansas town has shut down its water plant while officials investigate possible contamination from a chemical spill in the Neosho River after a chemical spill possibly contaminated the river.\r\nHumboldt city officials on Thursday… [+650 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man sentenced to 7 years in prison for fentanyl trafficking", "description": "CONCORD, N.H. (AP) — A New Hampshire man was sentenced to seven years in federal prison for trafficking fentanyl into Maine and for possessing firearms, the U.S. attorney's office said.", "url": "https://apnews.com/20294c63fb82aeb2bdc1af51296e7385", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:25:34Z", "content": "CONCORD, N.H. (AP) A New Hampshire man was sentenced to seven years in federal prison for trafficking fentanyl into Maine and for possessing firearms, the U.S. attorney's office said.\r\nThe FBI's Southern Maine Safe Streets Gang Task Force investigated Justin … [+511 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-teacher charged with taking up-skirt photos of students", "description": "OTTSVILLE, Pa. (AP) — A former high school teacher has been charged with secretly taking indecent photos of three students and posting them online.", "url": "https://apnews.com/4eb6a9a2bc9deae2d8c5ef1143a03686", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T16:23:59Z", "content": "OTTSVILLE, Pa. (AP) A former high school teacher has been charged with secretly taking indecent photos of three students and posting them online.\r\nFrancis Reppert, 26, of Quakertown, was arraigned Thursday on charges of indecent exposure and invasion of priva… [+960 chars]"}]}