{"status": "ok", "totalResults": 85, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "UK defense secretary urges Iran to act with restraint", "description": "LONDON (AP) — Britain's defense secretary urged Iranian leaders on Tuesday to refrain from retaliating for the slaying of Gen. Qassem Soleimani in an American drone attack.", "url": "https://apnews.com/1166cee50c01f50a85205852aa8645cd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/7/8f/78f86efa-9ae5-56ff-a2ce-7a5e41d87d2a/5e14bcee6cbb5.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T17:08:32Z", "content": "LONDON (AP) Britain's defense secretary urged Iranian leaders on Tuesday to refrain from retaliating for the slaying of Gen. Qassem Soleimani in an American drone attack.\r\nBen Wallace appealed for calm even as he told the House of Commons that Iran's \"aggress… [+2832 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Lizzo, Tool, Tame Impala headline Bonnaroo festival", "description": "Nashville, Tenn. (AP) — After dominating 2019, singer-rapper Lizzo will be the first female act to headline the Bonnaroo Music and Arts Festival this June. Tool and Tame Impala will also headline the four-day festival.", "url": "https://apnews.com/2cb15a0a2759ec31bd07dab4f7fe558a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/3/93/39300cbd-683d-519c-b662-64df14e939fb/5e14bcef2e5ae.image.jpg?crop=1742%2C980%2C0%2C105&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T17:08:09Z", "content": "Nashville, Tenn. (AP) After dominating 2019, singer-rapper Lizzo will be the first female act to headline the Bonnaroo Music and Arts Festival this June. Tool and Tame Impala will also headline the four-day festival.\r\nThe festival announced the lineup Tuesday… [+617 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JULIET LINDERMAN and HOPE YEN Associated Press", "title": "HUD seeks to roll back Obama rule on housing desegregation", "description": "WASHINGTON (AP) — The Trump administration took steps Tuesday to roll back an Obama-era rule intended to ensure that communities confront and address racial segregation in housing, saying local governments have been overburdened by the requirements.", "url": "https://apnews.com/d46eb016f7ed3d9eae9a5e5de5c1bde4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/0/52/052fd2ba-50fc-5f71-8273-e3f79a4463dc/5e14bcefb6e8f.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T17:07:57Z", "content": "WASHINGTON (AP) The Trump administration took steps Tuesday to roll back an Obama-era rule intended to ensure that communities confront and address racial segregation in housing, saying local governments have been overburdened by the requirements.\r\nThe propos… [+4518 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kentucky lawmakers open 2020 session in new era of divided government", "description": "FRANKFORT, Ky. (AP) — Kentucky lawmakers open 2020 session in new era of divided government.", "url": "https://apnews.com/67629855807b7b6879a2018115f5410f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T17:07:17Z", "content": "Please purchase a subscription to continue reading.\r\nA subscription is required to continue reading.\r\nIf you are a current subscriber please click Sign Up or Login to activate your digital access. If not, please click Sign Up to subscribe.\r\nIf you are a curre… [+138 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Florida woman accused of throwing human feces at landlord", "description": "OSTEEN, Fla. (AP) — A Florida woman tossed a bucket of human feces at her landlord and somehow ended up with dried excrement smeared all over her own face, authorities said.", "url": "https://apnews.com/66370b7e157bb6063b39d8a9aa52f85f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T17:06:57Z", "content": "OSTEEN, Fla. (AP) A Florida woman tossed a bucket of human feces at her landlord and somehow ended up with dried excrement smeared all over her own face, authorities said.\r\nJoanne Mercader, 59, initially told deputies that her landlord first assaulted her wit… [+1441 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Great Smoky Mountains' cove to close to cars for 2 months", "description": "TOWNSEND, Tenn. (AP) — One of the Great Smoky Mountains National Park's most popular sites has been closed to all vehicles until repairs to a main access road tunnel are finished.", "url": "https://apnews.com/9adc0484285c3265e0ccc9595bd4cf5f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T17:06:33Z", "content": "TOWNSEND, Tenn. (AP) One of the Great Smoky Mountains National Park's most popular sites has been closed to all vehicles until repairs to a main access road tunnel are finished.\r\nThe Cades Cove closure started Sunday night and is expected to last until March,… [+653 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Eric Duncan promoted to hitting coach by Miami Marlins", "description": "MIAMI (AP) — Eric Duncan has been promoted to hitting coach by the Miami Marlins, who also announced five additions to their coaching staff Tuesday.", "url": "https://apnews.com/e08daca754f37c62a8023d34e878cbb4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-07T17:06:19Z", "content": "MIAMI (AP) Eric Duncan has been promoted to hitting coach by the Miami Marlins, who also announced five additions to their coaching staff Tuesday.\r\nNewcomers joining manager Don Mattingly will be bench coach James Rowson, first base-outfield coach Billy Hatch… [+965 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Couple sentenced to prison in child starvation case", "description": "PRINCETON, W.Va. (AP) — The aunt and uncle of a toddler who died of starvation have been sentenced to prison after pleading guilty to felony conspiracy in the boy's death.", "url": "https://apnews.com/83f99f58ab52c93b0ae68396d9d4354e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T17:06:10Z", "content": "PRINCETON, W.Va. (AP) The aunt and uncle of a toddler who died of starvation have been sentenced to prison after pleading guilty to felony conspiracy in the boy's death.\r\nCircuit Court Judge Mark Wills ruled on Monday that John and Janet Adkins of Princeton s… [+1298 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By JONATHAN MATTISE Associated Press", "title": "Tennessee to offer state workers 12 weeks paid family leave", "description": "NASHVILLE, Tenn. (AP) — Tennessee Gov. Bill Lee arnnounced a plan Tuesday to offer up to 12 weeks of annual paid family leave for state workers who are experiencing a variety of life events, including parental leave for the birth…", "url": "https://apnews.com/c7418f197943907a44b49c9d39ece1e7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T17:00:20Z", "content": "NASHVILLE, Tenn. (AP) Tennessee Gov. Bill Lee arnnounced a plan Tuesday to offer up to 12 weeks of annual paid family leave for state workers who are experiencing a variety of life events, including parental leave for the birth of a child, adoption or foster … [+1188 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MORGAN LEE Associated Press", "title": "New Mexico may stash away oil money for financial stability", "description": "SANTA FE, N.M. (AP) — The Legislature's lead budget-writing committee on Tuesday recommended a 6.5% increase in state general fund spending and endorsed plans to stash away a portion of New Mexico's windfall from oil production in trust funds to…", "url": "https://apnews.com/c04b33f0c567de0eec5968cda0109515", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:59:07Z", "content": "SANTA FE, N.M. (AP) The Legislature's lead budget-writing committee on Tuesday recommended a 6.5% increase in state general fund spending and endorsed plans to stash away a portion of New Mexico's windfall from oil production in trust funds to ensure future f… [+2690 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By The Associated Press", "title": "Excerpts from recent South Dakota editorials", "description": "Rapid City Journal, Jan. 5", "url": "https://apnews.com/910da015afc686e661e972ed95b26b8e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:58:02Z", "content": "Rapid City Journal, Jan. 5\r\nSen. Thune on impeachment, Russian meddling, hyper-partisanship\r\nSenator John Thune is not quick to criticize President Donald Trump or other Republican leaders, but that doesn't mean he always agrees with their policies.\r\nSen. Thu… [+10086 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Sainz latest new leader after Dakar Rally 3rd stage", "description": "NEOM, Saudi Arabia (AP) — Two-time winner Carlos Sainz became the third new leader of the Dakar Rally after winning the third stage ahead of defending champion Nasser Al-Attiyah on Tuesday.", "url": "https://apnews.com/0072f9458ca452c6ab7c5df27136cc54", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/c/79/c792cbfa-ca5d-5974-b0db-a63cef15661d/5e14bcb3dc354.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T16:55:42Z", "content": "NEOM, Saudi Arabia (AP) Two-time winner Carlos Sainz became the third new leader of the Dakar Rally after winning the third stage ahead of defending champion Nasser Al-Attiyah on Tuesday.\r\nSainz and Al-Attiyah vied for the lead throughout the 427-kilometer lo… [+1012 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "PAT EATON-ROBB Associated Press", "title": "Lawyer: Husband of missing woman charged with murder", "description": "FARMINGTON, Conn. (AP) — The estranged husband of a missing Connecticut mother of five has been charged with murder in her disappearance, his lawyer said.", "url": "https://apnews.com/f291cb890d830a18288e77a41fc52f41", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/4/93/49324a2f-10bc-5d7e-82f7-c28320184a2b/5e14b9bc81253.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-07T16:54:44Z", "content": "HARTFORD, Conn. (AP) The estranged husband of a missing Connecticut mother of five has been charged with murder in her disappearance, his lawyer said.\r\nState police took Fotis Dulos from his Farmington home Tuesday.\r\nJennifer Dulos, of New Canaan, disappeared… [+1866 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By KEN RITTER Associated Press", "title": "Group plans to re-file Nevada voter redistricting initiative", "description": "LAS VEGAS (AP) — A Nevada political group planned to revise and resubmit a proposed state constitutional amendment aimed at creating an appointed commission to redraw legislative and U.S. congressional voting districts, the president of the League of Women Vo…", "url": "https://apnews.com/3fdc7fdb0b335f1831ff5a697a175853", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:54:10Z", "content": "LAS VEGAS (AP) A Nevada political group planned to revise and resubmit a proposed state constitutional amendment aimed at creating an appointed commission to redraw legislative and U.S. congressional voting districts, the president of the League of Women Vote… [+3403 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Former senior care facility manager to pay settlement", "description": "BURLINGTON, Vt. (AP) — The former manager of a senior living facility in Vermont will pay $120,000 as part of a settlement with the state to resolve claims that it misrepresented the extent of its care.", "url": "https://apnews.com/f065071553e345845fb7ef0f645d7a0a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:51:52Z", "content": "BURLINGTON, Vt. (AP) The former manager of a senior living facility in Vermont will pay $120,000 as part of a settlement with the state to resolve claims that it misrepresented the extent of its care.\r\nMaryland-based Woodbine Senior Living, LLC managed Spring… [+1545 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Authorities end search for Sitka man missing on kayak trip", "description": "SITKA, Alaska (AP) — State and federal emergency responders have ended a search for a Sitka man missing on a kayak trip, Alaska State Troopers said.", "url": "https://apnews.com/b86141874757e611d5db27c3da20071e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:51:36Z", "content": "SITKA, Alaska (AP) State and federal emergency responders have ended a search for a Sitka man missing on a kayak trip, Alaska State Troopers said.\r\nKale Pastel, 36, left around 5 a.m. Sunday from Eliason Harbor on a paddling trip to Birdsnest Bay. He did not … [+544 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-pastor sentenced to 15 years in death of pregnant wife", "description": "TORONTO (AP) — A former Toronto pastor convicted in the death of his pregnant wife has been sentenced to 15 years behind bars.", "url": "https://apnews.com/ad68026fbd256723a072418dd46821f0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:48:51Z", "content": "TORONTO (AP) A former Toronto pastor convicted in the death of his pregnant wife has been sentenced to 15 years behind bars.\r\nPhilip Grandine was sentenced in a Toronto courtroom on Tuesday nearly a year after jurors found him guilty of manslaughter in the dr… [+822 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Maine governor nominates 4 candidates to judicial posts", "description": "AUGUSTA, Maine (AP) — Gov. Janet Mills will nominate four candidates to Maine judicial posts.", "url": "https://apnews.com/f45f25e63d52c09afbbbd6b67d7d7d62", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:47:16Z", "content": "AUGUSTA, Maine (AP) Gov. Janet Mills will nominate four candidates to Maine judicial posts.\r\nThe governor announced Monday she plans to recommend two candidates to Maine's Supreme Judicial Court and two candidates to Maine's Superior Court.\r\nPrivate attorney … [+527 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man charged with traveling to Rhode Island for sex with teen", "description": "PROVIDENCE, R.I. (AP) — A New Jersey man has been charged with flying to Rhode Island to have sex with someone he thought was a 14-year-old girl but was really an undercover state police trooper, authorities say.", "url": "https://apnews.com/d32f35dbf3fc1b6a69d623caff5db9a4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:45:26Z", "content": "PROVIDENCE, R.I. (AP) A New Jersey man has been charged with flying to Rhode Island to have sex with someone he thought was a 14-year-old girl but was really an undercover state police trooper, authorities say.\r\nAmish Jayant Patel, 47, of Swedesboro, New Jers… [+1019 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Guns owned by domestic violence offenders probed in Denver", "description": "DENVER (AP) — A domestic violence gun investigator was hired by Denver prosecutors amid efforts to enforce a law banning most domestic violence offenders and suspected offenders from possessing firearms.", "url": "https://apnews.com/6ce6bd9f3f3b9c095f27af15a89e3fad", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-07T16:43:54Z", "content": "DENVER (AP) A domestic violence gun investigator was hired by Denver prosecutors amid efforts to enforce a law banning most domestic violence offenders and suspected offenders from possessing firearms.\r\nDenver District Attorney's Office officials hired the in… [+1414 chars]"}]}