{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By IVAN MORENO and SCOTT BAUER Associated Press", "title": "Voter purge case back to court in battleground Wisconsin", "description": "PORT WASHINGTON, Wis. (AP) — The push to remove up to 209,000 registered voters from the polls in Wisconsin heads back to court on Monday for a hearing on whether the state elections commission is in contempt for not immediately…", "url": "https://apnews.com/cf306f8ffada6f356ec9f1c43e7ff0aa", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-13T15:11:46Z", "content": "PORT WASHINGTON, Wis. (AP) The push to remove up to 209,000 registered voters from the polls in Wisconsin heads back to court on Monday for a hearing on whether the state elections commission is in contempt for not immediately purging the voters as ordered la… [+2904 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge wants answer: Where did some of the zoo animals go?", "description": "MANCHESTER, Iowa (AP) — A judge has ordered the owners of a closed-down roadside zoo in eastern Iowa to explain what happened to some animals that were supposed to be removed.", "url": "https://apnews.com/6bce02fb4403a36da6c2cfa00c2355ec", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:10:25Z", "content": "MANCHESTER, Iowa (AP) A judge has ordered the owners of a closed-down roadside zoo in eastern Iowa to explain what happened to some animals that were supposed to be removed.\r\nIn late November Judge Monica Wittig found the Cricket Hollow Zoo near Manchester to… [+1023 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Marshall University launches pediatric medicine fellowship", "description": "HUNTINGTON, W.Va. (AP) — A West Virginia university's school of medicine will welcome two fellows to a new pediatric hospital medicine program launching this summer.", "url": "https://apnews.com/3f858e749c199605d4ae7e10ff6369fe", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:08:25Z", "content": "HUNTINGTON, W.Va. (AP) A West Virginia university's school of medicine will welcome two fellows to a new pediatric hospital medicine program launching this summer.\r\nThe Marshall University Joan C. Edwards School of Medicine says the two-year program focuses o… [+895 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Southern California Uber driver accused of raping passenger", "description": "FONTANA, Calif. (AP) — An Uber driver was arrested on suspicion of raping a woman who said she fell asleep in his car after a night of drinking and woke up to him assaulting her, authorities said.", "url": "https://apnews.com/76684f10357b06c29454c02996ad2a23", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:07:29Z", "content": "FONTANA, Calif. (AP) An Uber driver was arrested on suspicion of raping a woman who said she fell asleep in his car after a night of drinking and woke up to him assaulting her, authorities said.\r\nThe suspect, Alonso Calle, had contacted police and said he was… [+784 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Supreme Court rejects appeal in texting suicide case", "description": "WASHINGTON (AP) — The Supreme Court on Monday left in place the conviction of a Massachusetts woman who sent her boyfriend text messages urging him to kill himself.", "url": "https://apnews.com/cc38e0b9f4449773babb929e58706301", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/8/5a/85a005af-9bde-5d74-8ebe-7a0268da6492/5e0496954bed5.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T15:05:14Z", "content": "WASHINGTON (AP) The Supreme Court on Monday left in place the conviction of a Massachusetts woman who sent her boyfriend text messages urging him to kill himself.\r\nMichelle Carter is serving a 15-month sentence after being convicted of involuntary manslaughte… [+851 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Woman drowns after driving through low-water crossing", "description": "CONWAY, Mo. (AP) — Authorities say a woman has drowned after attempting to drive through a low-water crossing in southern Missouri after heavy rain.", "url": "https://apnews.com/543ae09bcfdff379f788d7778e7529a6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:02:54Z", "content": "CONWAY, Mo. (AP) Authorities say a woman has drowned after attempting to drive through a low-water crossing in southern Missouri after heavy rain.\r\nThe Missouri State Highway Patrol says 53-year-old Kristi Yates, of Grovespring, made an unsuccessful attempt t… [+494 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Sign welcoming people to Kennebunkport has been found", "description": "KENNEBUNKPORT, Maine (AP) — A sign welcoming people to the community of Kennebunkport has been found, police said Monday.", "url": "https://apnews.com/0a4a1c7381bd91afef94f290a3296a10", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:02:40Z", "content": "KENNEBUNKPORT, Maine (AP) A sign welcoming people to the community of Kennebunkport has been found, police said Monday.\r\nIn a Facebook post, police said the sign was, unfortunately, taken by those who would rather take that which is not their own.\"\r\nOn Friday… [+626 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By The Associated Press", "title": "Editorial Roundup:", "description": "Omaha World Herald. January 10, 2020", "url": "https://apnews.com/f68fa6dab32a440bccc755031f352bb6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:00:09Z", "content": "Omaha World Herald. January 10, 2020\r\nOversight of Nebraskas child welfare system is vital\r\nMore than 3,000 vulnerable young people receive services each day through Nebraskas child welfare system. Problems for these young people include family instability, a… [+8557 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By The Associated Press", "title": "Editorial Roundup:", "description": "The Dallas Morning News. January 10, 2020", "url": "https://apnews.com/29fd3324dc6618393daaa92171ab02cc", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T15:00:08Z", "content": "The Dallas Morning News. January 10, 2020\r\nTroopers shot a man 16 times, and video evidence shows they made a tragic but correct call\r\nNo one wants to see someone killed in a hail of gunfire, especially not in the driveway of the persons grandmother. So when … [+11339 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Investigators try to identify human remains found by kids", "description": "JACKSON, Ohio (AP) — Authorities are investigating human remains found by children at a property in Ohio, a sheriff's office said.", "url": "https://apnews.com/354d89ed8c6f33c2957423b201e37338", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:59:15Z", "content": "JACKSON, Ohio (AP) Authorities are investigating human remains found by children at a property in Ohio, a sheriff's office said.\r\nA man called the Jackson County Sheriff's Office on Saturday, saying his children had found human bones at a site near Jackson, r… [+751 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police in Delaware investigating string of church burglaries", "description": "MILLSBORO, Del. (AP) — Police in Delaware are investigating a string of church burglaries.", "url": "https://apnews.com/46f12550878806dffc9475c3bbbcd4e8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:56:28Z", "content": "Please purchase a subscription to continue reading.\r\nA subscription is required to continue reading.\r\nIf you are a current subscriber please click Sign Up or Login to activate your digital access. If not, please click Sign Up to subscribe.\r\nIf you are a curre… [+138 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "2 volunteer troopers catch sleeping car thief on I-95", "description": "OAK HILL, Fla. (AP) — Two volunteer troopers helped catch a suspected carjacker who was sleeping in a car on Sunday that had been stolen miles the night before, officials said.", "url": "https://apnews.com/69d151f2223359abb30d87a973f09564", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:54:48Z", "content": "OAK HILL, Fla. (AP) Two volunteer troopers helped catch a suspected carjacker who was sleeping in a car on Sunday that had been stolen miles the night before, officials said.\r\nThe auxiliary Florida Highway Patrol troopers were patrolling along Interstate 95 i… [+812 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Prague inks partnership with Taipei after snubbing Beijing", "description": "PRAGUE (AP) — The Czech capital, Prague, on Monday signed a partnership agreement with the capital of Taiwan, Taipei - three months after canceling a similar deal with Beijing and angering the Chinese government.", "url": "https://apnews.com/fd0af536a7fd1fe727afa5ceaf65f173", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:52:48Z", "content": "PRAGUE (AP) The Czech capital, Prague, on Monday signed a partnership agreement with the capital of Taiwan, Taipei - three months after canceling a similar deal with Beijing and angering the Chinese government.\r\nThe disagreement over Beijing began after the C… [+1124 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Stocks open a bit higher on Wall Street ahead of busy week", "description": "NEW YORK (AP) — Stocks are opening slightly higher on Wall Street ahead of a busy week for investors. Major banks including JPMorgan Chase start reporting their latest quarterly results on Tuesday and the U.S. and China are set to…", "url": "https://apnews.com/21fdddaa1908238a414ad6cb8c0d7445", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/5/d2/5d211d6f-e00e-522c-9008-7bf0503bb240/5e1c82c5091af.image.jpg?crop=1743%2C980%2C0%2C104&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-13T14:43:32Z", "content": "NEW YORK (AP) Stocks are opening slightly higher on Wall Street ahead of a busy week for investors. Major banks including JPMorgan Chase start reporting their latest quarterly results on Tuesday and the U.S. and China are set to sign and disclose details abou… [+3586 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Cops: Drive-by shooting leaves toddler, his uncle wounded", "description": "PHILADELPHIA (AP) — A shooter in a passing vehicle opened fire a man holding a toddler in his arms on a Philadelphia street, hitting the man in the shoulder and leaving the child with a graze wound on his head.", "url": "https://apnews.com/6d6a1c78abd441fea9682c7308124fdf", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:41:52Z", "content": "PHILADELPHIA (AP) A shooter in a passing vehicle opened fire a man holding a toddler in his arms on a Philadelphia street, hitting the man in the shoulder and leaving the child with a graze wound on his head.\r\nThe shooting occurred around 5 p.m. Sunday.\r\nThe … [+596 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Tom Krisher", "title": "Corvette wins car of year award, Kia Telluride takes top SUV", "description": "DETROIT (AP) — The new mid-engine Chevrolet Corvette won the North American Car of the Year award on Monday.  The Kia Telluride took Sport Utility of the Year honors and the Jeep Gladiator...", "url": "https://apnews.com/5a7af2f5fa1516db884b5ec94b3188ec", "urlToImage": "https://storage.googleapis.com/afs-prod/media/0d95df0b97b747f0af03fa90ced22910/3000.jpeg", "publishedAt": "2020-01-13T14:36:58Z", "content": "DETROIT (AP) The new mid-engine Chevrolet Corvette won the North American Car of the Year award on Monday. \r\nThe Kia Telluride took Sport Utility of the Year honors and the Jeep Gladiator won the Truck of the Year Award. \r\nAbout 50 automotive journalists serv… [+1254 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Two Rivers officer cleared in fatal shooting", "description": "TWO RIVERS, Wis. (AP) — A Two Rivers police officer was justified in using deadly force when he fatally shot a man during a traffic stop, according to investigators.", "url": "https://apnews.com/f0f3d8d1f5251c1fd0eae65b4f64c560", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:35:37Z", "content": "TWO RIVERS, Wis. (AP) A Two Rivers police officer was justified in using deadly force when he fatally shot a man during a traffic stop, according to investigators.\r\nNash Fiske, 31, was a passenger in a vehicle when he was killed on Nov. 4, 2019.\r\nInvestigator… [+1128 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-SAU student settles, withdraws lawsuit against university", "description": "FAYETTEVILLE, Ark. (AP) — A former Southern Arkansas University student has settled a lawsuit with the university in Magnolia alleging SAU acted with “deliberate indifference” when she reported being sexually assaulted in 2015.", "url": "https://apnews.com/5bfdf8d4df83dd85b614f4d57257e7c5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:34:58Z", "content": "FAYETTEVILLE, Ark. (AP) A former Southern Arkansas University student has settled a lawsuit with the university in Magnolia alleging SAU acted with deliberate indifference when she reported being sexually assaulted in 2015.\r\nThe woman's filed a Title IX lawsu… [+1148 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ivanka Trump to meet sex trafficking survivors in Atlanta", "description": "ATLANTA (AP) — Ivanka Trump is expected to travel to Atlanta on Tuesday to tour facilities that help human trafficking survivors.", "url": "https://apnews.com/2d399c5957334185a070a09b910f684b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-13T14:34:04Z", "content": "ATLANTA (AP) Ivanka Trump is expected to travel to Atlanta on Tuesday to tour facilities that help human trafficking survivors.\r\nThe presidents daughter and adviser will be accompanied by Gov. Brian Kemp, first lady Marty Kemp, U.S. Sen. Kelly Loeffler, Secre… [+960 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MELINDA DESLATTE Associated Press", "title": "House speaker dispute marks new Louisiana legislative term", "description": "BATON ROUGE, La. (AP) — Louisiana's new Legislature is starting with a dispute over House speaker, just like the old Legislature did four years ago.", "url": "https://apnews.com/b08f18168c83f28f3be358215a1e7506", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-13T14:32:08Z", "content": "BATON ROUGE, La. (AP) Louisiana's new Legislature is starting with a dispute over House speaker, just like the old Legislature did four years ago.\r\nThe 105 members of the House and 39 members of the Senate take their oaths of office Monday as the new term of … [+3364 chars]"}]}