{"status": "ok", "totalResults": 58, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "The Associated Press", "title": "Impeachment, immigration, Brexit: How 2019 looked in charts", "description": "For many reasons, 2019 was historic. The U.S. House impeached the president for the third time in history. The most diverse slate of Democrats ever vied to be their party's nominee for the White House. Britain pushed to extricate itself…", "url": "https://apnews.com/8cc0fd060884dd322a2d6a3d92002f2e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/1/17/11785097-eda1-5445-9423-2c25e17df73e/5e0f99c3a9dd6.image.jpg?crop=1000%2C563%2C0%2C517&resize=1000%2C563&order=crop%2Cresize", "publishedAt": "2020-01-03T19:25:39Z", "content": "HEAT ON HIGH\r\nWhile 2019 wont end up as the absolute hottest on record and Arctic sea ice has shrunk slightly less than in the past, it will go down in many indicators as a year where Earth flirted with record warmth and record melting. Smaller monthly and da… [+1768 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By ERIC TUCKER Associated Press", "title": "Appeals court weighs Mueller grand jury access for Congress", "description": "WASHINGTON (AP) — Democrats in Congress are seeking access to secret grand jury testimony from special counsel Robert Mueller's Russia investigation, arguing in court Friday that it's relevant to President Donald Trump's impeachment and could even be a basis …", "url": "https://apnews.com/6c9d3cb098facd4757e9189b79a7f63f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:24:45Z", "content": "WASHINGTON (AP) Democrats in Congress are seeking access to secret grand jury testimony from special counsel Robert Mueller's Russia investigation, arguing in court Friday that it's relevant to President Donald Trump's impeachment and could even be a basis fo… [+1374 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge: Man not competent for trial in 2017 killing of wife", "description": "BURLINGTON, Vt. (AP) — A Vermont judge has ruled that a man charged with killing his wife with a meat cleaver is not competent to stand trial.", "url": "https://apnews.com/02a30e79b295e5fe1d697c5eb7808c3f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:20:24Z", "content": "BURLINGTON, Vt. (AP) A Vermont judge has ruled that a man charged with killing his wife with a meat cleaver is not competent to stand trial.\r\nThe legal filing this week agreed with an evaluation by a court-appointed doctor that Aita Gurung cannot stand trial,… [+2021 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man sentenced to life plus 15 years in 2008 cartel killing", "description": "ALBUQUERQUE, N.M. (AP) — A man extradited to the United States from Mexico in 2015 to stand trial in a 2008 killing for a drug cartel was sentenced Friday to life plus 15 years in prison.", "url": "https://apnews.com/6dc8dca7eb0da7bcfb355b8b9c96ef05", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:17:08Z", "content": "ALBUQUERQUE, N.M. (AP) A man extradited to the United States from Mexico in 2015 to stand trial in a 2008 killing for a drug cartel was sentenced Friday to life plus 15 years in prison.\r\nA state District Court judge in Albuquerque sentenced Jaime Veleta for h… [+672 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Proposed Washington state bill to cap insulin at $100", "description": "SEATTLE (AP) — A Washington state lawmaker has announced plans to introduce legislation that would cap insulin costs at $100 a month.", "url": "https://apnews.com/b5cf11c3987880ad7425919feee3b2e6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:16:55Z", "content": "SEATTLE (AP) A Washington state lawmaker has announced plans to introduce legislation that would cap insulin costs at $100 a month.\r\nState Sen. Karen Keiser introduced the bill last month after a report showed patients have spent three times more on insulin i… [+846 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By RICARDO ALONSO-ZALDIVAR Associated Press", "title": "Democratic states appeal Obamacare ruling to Supreme Court", "description": "WASHINGTON (AP) — In a move that could put the Obama-era health law squarely in the middle of the 2020 election, Democratic-led states Friday asked the Supreme Court for a fast-track review of a recent appeals court decision declaring a…", "url": "https://apnews.com/ead5bf99e53288ec0bd467ffd28c118d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/assets/v3/editorial/7/66/76689c92-4bf7-545d-9b6c-79f7ef75a07e/5df7fefb2795a.image.jpg?crop=1466%2C825%2C0%2C76&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-03T19:15:20Z", "content": "WASHINGTON (AP) In a move that could put the Obama-era health law squarely in the middle of the 2020 election, Democratic-led states Friday asked the Supreme Court for a fast-track review of a recent court ruling that declared part of the statute unconstituti… [+3490 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man holds 5 hostage, including a relative, before release", "description": "FAIRFIELD, Ala. (AP) — Five people in Alabama are free after being held hostage on New Year's Day before letting them go.", "url": "https://apnews.com/b5236ad8d3c12ba7dda9f43124b9a1e0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:11:38Z", "content": "FAIRFIELD, Ala. (AP) Five people in Alabama are free after being held hostage on New Year's Day before letting them go.\r\nThe Jefferson County Sheriff's Office said it received a call Thursday from a woman who reported the situation at a home in Fairfield. Whe… [+766 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Cassidy, Berube, Reirden, Gallant named NHL All-Star coaches", "description": "NEW YORK (AP) — Boston's Bruce Cassidy, Craig Berube of the St. Louis Blues, Washington's Todd Reirden and Gerard Gallant of the Vegas Golden Knights will be the head coaches at NHL All-Star Weekend later this month.", "url": "https://apnews.com/65fcc3dff63c698351cf7c89e5faf1a5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/f/07/f076bbad-97cd-5459-8323-f35c29bf8fbe/5e0f965822236.image.jpg?crop=1763%2C992%2C0%2C92&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-03T19:09:57Z", "content": "NEW YORK (AP) Boston's Bruce Cassidy, Craig Berube of the St. Louis Blues, Washington's Todd Reirden and Gerard Gallant of the Vegas Golden Knights will be the head coaches at NHL All-Star Weekend later this month.\r\nGet all the Blues coverage from Jim Thomas … [+527 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Kentucky man claims he killed, skinned dogs to make coat", "description": "PRESTONSBURG, Ky. (AP) — A Kentucky man who claimed to have skinned four of his neighbors' dogs to make a “doggy coat” has been charged with animal torture.", "url": "https://apnews.com/d59f5e254be605eb8f37173f26766931", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-03T19:09:13Z", "content": "PRESTONSBURG, Ky. (AP) A Kentucky man who claimed to have skinned four of his neighbors' dogs to make a doggy coat has been charged with animal torture.\r\nJonathan D. Watkins, 38, was arrested in the Floyd County community of David on Dec. 23 after a neighbor … [+1332 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Springfield man charged in death of 19-year-old woman", "description": "SPRINGFIELD, Mo. (AP) — A Missouri man was charged Friday with killing a 19-year-old woman whose body was found more than a week after she went missing.", "url": "https://apnews.com/b18d84924d0c284f774c5f4fe2f9ff8f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:08:28Z", "content": "SPRINGFIELD, Mo. (AP) A Missouri man was charged Friday with killing a 19-year-old woman whose body was found more than a week after she went missing.\r\nLonnie Leroy Williams, 32, of Springfield, faces one count of first-degree murder in the death of Mackenna … [+1205 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Slain Rhode Island woman cared for children at local YMCA", "description": "PAWTUCKET, R.I. (AP) — The 54-year-old Rhode Island woman shot and killed on New Year's Day was a trusted member of the child care team at a local YMCA, officials said.", "url": "https://apnews.com/c78f3dac724a22be6f3bb36183bcfe88", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:06:40Z", "content": "PAWTUCKET, R.I. (AP) The 54-year-old Rhode Island woman shot and killed on New Year's Day was a trusted member of the child care team at a local YMCA, officials said.\r\nCheryl Smith was killed in her Pawtucket home on Wednesday.\r\nSmith was a beloved member of … [+824 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "New Mexico state senator challenger also has DWI conviction", "description": "ESPANOLA, N.M. (AP) — A leading challenger of an embattled New Mexico state senator convicted of drunken driving has acknowledged he also has a DWI conviction from his younger years.", "url": "https://apnews.com/7c7111a0904269f91ac3dcbfbd2e69ff", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-03T19:05:30Z", "content": "ESPANOLA, N.M. (AP) A leading challenger of an embattled New Mexico state senator convicted of drunken driving has acknowledged he also has a DWI conviction from his younger years.\r\nRio Arriba County Commissioner Leo Jaramillo has challenged state Sen. Richar… [+887 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By STEVE LeBLANC Associated Press", "title": "Massachusetts delegation asks Trump to explain Iran attack", "description": "BOSTON (AP) — Members of Massachusetts' all-Democratic congressional delegation are calling on President Donald Trump to brief lawmakers on his decision to authorize the killing of Iran's top general in an airstrike.", "url": "https://apnews.com/d3df310dcc8877c58464996b5ddafe5c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T19:01:23Z", "content": "BOSTON (AP) Members of Massachusetts' all-Democratic congressional delegation are calling on President Donald Trump to brief lawmakers on his decision to authorize the killing of Iran's top general in an airstrike.\r\nPresident Donald Trump said in a tweet Frid… [+2350 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Report: Minnesota sees impaired driving arrests rise in 2019", "description": "MINNEAPOLIS (AP) — The number of people in Minnesota arrested for driving while impaired grew by nearly 5% last year, partly due to people driving with cannabis, opioids and methamphetamine in their system, according to a state agency's report.", "url": "https://apnews.com/470ed4a140d20d5993c42214a734f311", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:58:35Z", "content": "MINNEAPOLIS (AP) The number of people in Minnesota arrested for driving while impaired grew by nearly 5% last year, partly due to people driving with cannabis, opioids and methamphetamine in their system, according to a state agency's report.\r\nThe Minnesota D… [+2100 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Oklahoma governor hires law firm in tribal gambling battle", "description": "OKLAHOMA CITY (AP) — Oklahoma Gov. Kevin Stitt announced Friday the hiring of an out-of-state law firm to represent him in his ongoing dispute with Native American tribes over casino gambling.", "url": "https://apnews.com/67c75c24336c51cd37750984450613e9", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:58:28Z", "content": "OKLAHOMA CITY (AP) Oklahoma Gov. Kevin Stitt announced Friday the hiring of an out-of-state law firm to represent him in his ongoing dispute with Native American tribes over casino gambling.\r\nStitt hired Seattle-based Perkins Coie to advise his office in his … [+838 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Train derailment in eastern Iowa leaves mess, slows traffic", "description": "LECLAIRE, Iowa (AP) — A train derailment Friday morning sent at least a dozen rail cars and tankers off their tracks in downtown LeClaire, shutting down a nearby highway and sending a hazardous materials team scrambling to the site.", "url": "https://apnews.com/ec56e3fbdc412c2686c3ad09ad419f3c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:57:08Z", "content": "LECLAIRE, Iowa (AP) A train derailment Friday morning sent at least a dozen rail cars and tankers off their tracks in downtown LeClaire, shutting down a nearby highway and sending a hazardous materials team scrambling to the site.\r\nThe derailment happened jus… [+1026 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "REBECCA SANTANA Associated Press", "title": "Gleason to receive Congressional Gold Medal Jan. 15", "description": "NEW ORLEANS (AP) — Former New Orleans Saints player Steve Gleason, who become a leading advocate for people struggling with Lou Gehrig's disease after he was diagnosed with the paralyzing condition, will be awarded the Congressional Gold Medal during a…", "url": "https://apnews.com/cd92e62d50096d7cf0a757e15ddacaae", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:55:49Z", "content": "NEW ORLEANS (AP) Former New Orleans Saints player Steve Gleason, who become a leading advocate for people struggling with Lou Gehrig's disease after he was diagnosed with the paralyzing condition, will be awarded the Congressional Gold Medal during a ceremony… [+1900 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Rhode Island congressmen urge Trump to avoid war with Iran", "description": "PROVIDENCE, R.I. (AP) — Members of Rhode Island's congressional delegation are urging the Trump administration to use diplomacy and “de-escalate” to avoid war with Iran, following a U.S. airstrike near Baghdad's airport that killed a top Iranian general.", "url": "https://apnews.com/dc2b360db8c7e38d7f03d36d8193f871", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:50:52Z", "content": "PROVIDENCE, R.I. (AP) Members of Rhode Island's congressional delegation are urging the Trump administration to use diplomacy and de-escalate to avoid war with Iran, following a U.S. airstrike near Baghdad's airport that killed a top Iranian general.\r\nU.S. Se… [+1437 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ohio State Heisman finalist Chase Young to enter NFL draft", "description": "COLUMBUS, Ohio (AP) — Record-setting defensive end Chase Young is leaving Ohio State early to enter the NFL draft, a widely expected move.", "url": "https://apnews.com/67b0ab2d6ad504575b207c6998718bd6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:50:03Z", "content": "COLUMBUS, Ohio (AP) Record-setting defensive end Chase Young is leaving Ohio State early to enter the NFL draft, a widely expected move.\r\nThe junior Heisman Trophy finalist made the announcement Friday on Twitter. He says he looks forward to \"joining a new fa… [+644 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Arkansas revenue boosted by sales, corporate tax collections", "description": "LITTLE ROCK, Ark. (AP) — Arkansas' finance office on Friday said higher than expected sales and corporate income tax collections in December helped keep the state's revenue above forecast for the current fiscal year.", "url": "https://apnews.com/939f59e60103caca9a225e4e15dab197", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-03T18:39:53Z", "content": "LITTLE ROCK, Ark. (AP) Arkansas' finance office on Friday said higher than expected sales and corporate income tax collections in December helped keep the state's revenue above forecast for the current fiscal year.\r\nThe Department of Finance and Administratio… [+903 chars]"}]}