{"status": "ok", "totalResults": 49, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Hunter 1, rattlesnake 0 after scary encounter in deer stand", "description": "LEXINGTON, Miss. (AP) — A Mississippi hunter says he was trapped in his deer stand when a rattlesnake joined him there last month, but the snake ended up the loser.", "url": "https://apnews.com/89ab1ec5d9e1900889e6af422f457c3f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T15:16:15Z", "content": "LEXINGTON, Miss. (AP) A Mississippi hunter says he was trapped in his deer stand when a rattlesnake joined him there last month, but the snake ended up the loser.\r\nMack Ginn of Lexington said he was about two hours into his Dec. 28 stakeout for a deer when he… [+1261 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ex-mayor in Florida town guilty in scheme with predecessor", "description": "PORT RICHEY, Fla. (AP) — The former acting mayor of a Florida city was sentenced to probation after pleading guilty to a scheme with his jailed predecessor.", "url": "https://apnews.com/019e72a3666139d685c5303a6b50c034", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T15:10:29Z", "content": "PORT RICHEY, Fla. (AP) The former acting mayor of a Florida city was sentenced to probation after pleading guilty to a scheme with his jailed predecessor.\r\nThe Tampa Bay Times reported Thursday that 65-year-old Terrence Rowe was sentenced recently to two year… [+943 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Mississippi human services agency will get new director", "description": "JACKSON, Miss. (AP) — The head of the Mississippi Department of Human Services is the latest state agency leader to announce his departure as the state prepares for a new administration.", "url": "https://apnews.com/201a38371a3017e782c4dc28812db4cc", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T15:10:13Z", "content": "JACKSON, Miss. (AP) The head of the Mississippi Department of Human Services is the latest state agency leader to announce his departure as the state prepares for a new administration.\r\nChristopher Freeze will leave his job Jan. 14. That's the same day Tate R… [+539 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By BARRY WILNER AP Pro Football Writer", "title": "NFL to select greatest moments as part of 100th season", "description": "NEW YORK (AP) — From the Immaculate Reception, already voted the best play in NFL history, to the Dolphins' perfect season that has been selected as the all-time top team, the NFL is searching for its greatest moment.", "url": "https://apnews.com/add82fc2068f820370d38449283b204a", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-02T15:00:07Z", "content": "NEW YORK (AP) From the Immaculate Reception, already voted the best play in NFL history, to the Dolphins' perfect season that has been selected as the all-time top team, the NFL is searching for its greatest moment.\r\nAs part of its celebration of the 100th se… [+2681 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Police: Surveillance video showed suspected abduction victim", "description": "LAS VEGAS (AP) — Las Vegas police said they're seeking information on a suspected abduction involving a woman seen on home surveillance video running from a car and screaming for help at a home's front door before she's hit, kicked…", "url": "https://apnews.com/4df2d5d3fb83e349abf7981e6a27919e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:59:32Z", "content": "LAS VEGAS (AP) Las Vegas police said they're seeking information on a suspected abduction involving a woman seen on home surveillance video running from a car and screaming for help at a home's front door before she's hit, kicked and dragged back to the car.\r… [+752 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Albuquerque City Councilor Ken Sanchez dead at 63", "description": "ALBUQUERQUE, N.M. (AP) — Ken Sanchez, a four-term member of the Albuquerque City Council, has died at age 63.", "url": "https://apnews.com/8802b2eec0dfd0e977fe48de5a6436eb", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:56:12Z", "content": "ALBUQUERQUE, N.M. (AP) Ken Sanchez, a four-term member of the Albuquerque City Council, has died at age 63.\r\nCause of Sanchez's death wasn't released but Mayor Tim Keller's announcement said Sanchez hadn't returned to his council duties since having a medical… [+530 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Power outage at Madison apartment building could last a week", "description": "MADISON, Wis. (AP) — Dozens of residents at a Madison apartment building could spend nearly a week without power after a New Year's Eve fire in the parking garage.", "url": "https://apnews.com/9e67241a9288c03ddb730230a91396d7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:55:47Z", "content": "MADISON, Wis. (AP) Dozens of residents at a Madison apartment building could spend nearly a week without power after a New Year's Eve fire in the parking garage.\r\nAuthorities say the fire was quickly put out by the sprinkler system at the Ovation apartment co… [+503 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Small undersea quake strikes off Southern California", "description": "PORT HUENEME, Calif. (AP) — An earthquake under the ocean gave an early wake-up jolt to some Southern California residents Thursday morning.", "url": "https://apnews.com/70a69dbf39977d2f9e959fb551065f11", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:52:27Z", "content": "PORT HUENEME, Calif. (AP) An earthquake under the ocean gave an early wake-up jolt to some Southern California residents Thursday morning.\r\nThe magnitude 4 temblor occurred at 2:13 a.m. near the Channel Islands, west of the Los Angeles region.\r\nThe U.S. Geolo… [+393 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "New Jersey minimum wage climbs $1 to $11 an hour", "description": "TRENTON, N.J. (AP) — The new year brought with it a bump in New Jersey's minimum wage to $11 an hour, up from $10.", "url": "https://apnews.com/ebe0f2f9603a1591b970d79c7967e337", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:51:36Z", "content": "TRENTON, N.J. (AP) The new year brought with it a bump in New Jersey's minimum wage to $11 an hour, up from $10.\r\nThe increase went into effect New Year's Day, as part of a law that Democratic Gov. Phil Murphy signed last February to phase in a $15-per-hour m… [+590 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Bahrain names GCC chief country's new foreign minister", "description": "DUBAI, United Arab Emirates (AP) — Bahrain has appointed the head of the six-nation Gulf Cooperation Council as the country’s next foreign minister, state media reported Thursday.", "url": "https://apnews.com/d9db2b853ab399f1c26ea6fd523b474f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-02T14:51:07Z", "content": "DUBAI, United Arab Emirates (AP) Bahrain has appointed the head of the six-nation Gulf Cooperation Council as the countrys next foreign minister, state media reported Thursday.\r\nThe Bahrain News Agency reported that Bahrains king named Abdullatif al-Zayani as… [+495 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By SCOTT BAUER Associated Press", "title": "Conservatives seek immediate purge of voters in Wisconsin", "description": "MADISON, Wis. (AP) — The leader of a conservative law firm said Thursday it will ask a judge to find the Wisconsin Elections Commission in contempt and fine its members $2,000 a day until it immediately purges more than 200,000…", "url": "https://apnews.com/ea39036616cb894830236e091ab4bb08", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/custom/image/aacc4e10-0064-11e7-adc2-d3321407a1f8.jpg", "publishedAt": "2020-01-02T14:48:48Z", "content": "MADISON, Wis. (AP) A conservative law firm on Thursday asked a judge to find the Wisconsin Elections Commission in contempt and fine its members $2,000 a day until it immediately purges more than 200,000 voters from the rolls, a move Democrats are fighting in… [+2954 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Maryland's governor says he'll keep door open to refugees", "description": "ANNAPOLIS, Md. (AP) — Maryland's governor has indicated that he'll continue to allow refugees into the state.", "url": "https://apnews.com/eb6d92ab3b5d1637a71e306672ae7dee", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:44:51Z", "content": "ANNAPOLIS, Md. (AP) Maryland's governor has indicated that he'll continue to allow refugees into the state.\r\nThe Capital Gazette reports that Gov. Larry Hogans office released a letter on Wednesday that was sent to the Trump Administration. The letter said th… [+1135 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Slight minimum wage increase for South Dakota workers", "description": "SIOUX FALLS, S.D. (AP) — South Dakota's minimum wage is increasing slightly with the the start of the new year", "url": "https://apnews.com/9bb0e02c6552d562f6800c3bec17bb62", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:43:59Z", "content": "SIOUX FALLS, S.D. (AP) South Dakota's minimum wage is increasing slightly with the the start of the new year\r\nThe state's minimum wage will now be $9.30 per hour an increase of 20 cents from 2019. Workers who receive tips are seeing their minimum wage rise to… [+513 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "US stock indexes open higher on first trading day of 2020", "description": "NEW YORK (AP) — Stocks are opening higher on Wall Street on the first trading day of the year following gains overseas. Traders are looking forward to an an initial trade deal between the U.S. and China being signed later…", "url": "https://apnews.com/ddf7133df1045cf20c08a2f537d16db5", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/4/43/443ca31b-ebf0-517f-9f33-f69cf3721291/5e0e05a05a3fc.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-02T14:42:58Z", "content": "NEW YORK (AP) Stocks are opening higher on Wall Street on the first trading day of the year following gains overseas. Traders are looking forward to an an initial trade deal between the U.S. and China being signed later this month, and they were also encourag… [+3482 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Jonathan Landrum Jr.", "title": "GOLDEN GLOBES will serve plant-based meal at awards ceremony...", "description": "LOS ANGELES (AP) — The Golden Globes, known as the “party of the year,” is going with a meatless menu for its 77th annual awards show. Guests will be served a 100% plant-based meal just...", "url": "https://apnews.com/2ba7e05ccb8fb6cdd27280de4d6ef973", "urlToImage": "https://storage.googleapis.com/afs-prod/media/c3f8e8efbf69437caa91d6e61db17eac/3000.jpeg", "publishedAt": "2020-01-02T14:40:38Z", "content": "LOS ANGELES (AP) The Golden Globes, known as the party of the year, is going with a meatless menu for its 77th annual awards show.\r\nGuests will be served a 100% plant-based meal just ahead of showtime Sunday. The Hollywood Foreign Press Association said Thurs… [+2263 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "2 snowmobilers dead after avalanche in northwestern Montana", "description": "MISSOULA, Mont. (AP) — Two snowmobilers reported missing after an avalanche in northwestern Montana were found buried in the slide and pronounced dead Wednesday night.", "url": "https://apnews.com/7f09c2c2d01ab7605bfa699e6299323c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:39:19Z", "content": "MISSOULA, Mont. (AP) Two snowmobilers reported missing after an avalanche in northwestern Montana were found buried in the slide and pronounced dead Wednesday night.\r\nEarlier in the day, a snowmobiler called 911 to report that he was caught in an avalanche in… [+751 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Russia beats Switzerland 3-1 to reach semis at world juniors", "description": "OSTRAVA, Czech Republic (AP) — Dmitri Voronkov scored two power-play goals and Russia beat Switzerland 3-1 at the world junior hockey championship on Thursday to become the first team to reach the semifinals.", "url": "https://apnews.com/f8a3e51768208025d7e206745e0849e2", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/9/b1/9b1d7033-26e5-5b19-8252-74c472745d2d/5e0bc8ecec1ad.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-02T14:39:16Z", "content": "Goalkeeper Tobias Ancicka, left, and Eric Mik, right, of Germany and Yegor Sokolov of Russia during the 2020 IIHF World Junior Ice Hockey Championships Group B match between Russia and Germany in Ostrava, Czech Republic, on Tuesday Dec. 31, 2019.\r\nOzana Jaros… [+916 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Turkey's parliament approves sending troops to Libya in support of UN-backed government", "description": "ANKARA, Turkey (AP) — Turkey's parliament approves sending troops to Libya in support of UN-backed government.", "url": "https://apnews.com/0bc768c425e5e8442f4f06db8c12fc60", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-02T14:38:45Z", "content": null}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "1 hurt, 20 displaced by Massachusetts apartment fire", "description": "ROCKLAND, Mass. (AP) — One woman was taken to the hospital and about 20 people were displaced by a fire at a Massachusetts apartment building early Thursday, authorities said.", "url": "https://apnews.com/a345de63d892f693b3a84e583ed626d7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:36:58Z", "content": "ROCKLAND, Mass. (AP) One woman was taken to the hospital and about 20 people were displaced by a fire at a Massachusetts apartment building early Thursday, authorities said.\r\nCrews responded to the Rockland building at about midnight and firefighters found th… [+751 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Residents take steps to keep open only grocery store in town", "description": "GOWRIE, Iowa (AP) — Some residents have banded together in an effort to keep open the only grocery store in their central Iowa town.", "url": "https://apnews.com/b52bbb3d1d7d5496a9f72959c6b88478", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-02T14:33:13Z", "content": "GOWRIE, Iowa (AP) Some residents have banded together in an effort to keep open the only grocery store in their central Iowa town.\r\nThe newly formed Gowrie Grocery LLC has scheduled a meeting Monday to answer questions and address local concerns about the Jam… [+1026 chars]"}]}