{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By COURTNEY DURHAM Daily Nonpareil", "title": "Omaha artists' unique carvings displayed in Council Bluffs", "description": "COUNCIL BLUFFS, Iowa (AP) — Within a few years, Chad Belt’s yard on 28th Street has become something of a work of art.", "url": "https://apnews.com/befb0cc60590bebe0ef8f3bacafe473c", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-05T06:01:09Z", "content": "COUNCIL BLUFFS, Iowa (AP) Within a few years, Chad Belts yard on 28th Street has become something of a work of art.\r\nTwo wood carvings decorate the yard, one featuring an eagle and another featuring a nearly completed Atlas sculpture. The carver, Scott Pries,… [+2166 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By GABRIEL NEELY-STREIT The Southern Illinoisan", "title": "Girls bring growth to Boy Scouts in Southern Illinois", "description": "MURPHYSBORO, Ill. (AP) — In February, four girls from Holly Wolfe’s Murphysboro Cub Scout pack will walk across a ceremonial bridge marking their transition into the Boy Scouts of America.", "url": "https://apnews.com/3b1e56963767ecba13a0736064120a17", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-05T06:01:09Z", "content": "MURPHYSBORO, Ill. (AP) In February, four girls from Holly Wolfes Murphysboro Cub Scout pack will walk across a ceremonial bridge marking their transition into the Boy Scouts of America.\r\nIt will be the first time Wolfe has ever promoted females within the pro… [+7382 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By RICK RUGGLES Omaha World-Herald", "title": "UNO confident in direction of school's athletic department", "description": "OMAHA, Neb. (AP) — Trev Alberts knows that University of Nebraska at Omaha Maverick sports will never be a cash cow, but he believes the university can profit from athletics in other ways.", "url": "https://apnews.com/64f6207131ff6156b3b2abf54bcd288d", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-05T06:01:08Z", "content": "OMAHA, Neb. (AP) Trev Alberts knows that University of Nebraska at Omaha Maverick sports will never be a cash cow, but he believes the university can profit from athletics in other ways.\r\nAn income statement provided by UNO shows that in the 2018-19 budget ye… [+6410 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By SHELBY FLEIG The Des Moines Register", "title": "Celebrated Des Moines chef eager to encourage students", "description": "WEST DES MOINES, Iowa (AP) — When the celebrated former chef-owner of Proof restaurant walked into a new position this summer as the culinary lead of a job training program for at-risk youth, he grabbed the cleaning supplies and got…", "url": "https://apnews.com/ba777523aacec827ad6fcf1363a1729f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-05T06:01:08Z", "content": "WEST DES MOINES, Iowa (AP) When the celebrated former chef-owner of Proof restaurant walked into a new position this summer as the culinary lead of a job training program for at-risk youth, he grabbed the cleaning supplies and got to work.\r\nSean Wilson scoure… [+4506 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By AUSTIN KOELLER The Grand Island Independent", "title": "Hastings library program brings together kids and dogs", "description": "HASTINGS, Neb. (AP) — Kids are able to read to, pet and interact with dogs as part of a monthly event at the Hastings Public Library.", "url": "https://apnews.com/8fc881d7902456fa726748fe10c904bd", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-05T06:01:07Z", "content": "HASTINGS, Neb. (AP) Kids are able to read to, pet and interact with dogs as part of a monthly event at the Hastings Public Library.\r\nOn Saturday morning, the library hosted its Tales for Tails event where members of the local K-9 and Friends group brought in … [+2837 chars]"}]}