{"status": "ok", "totalResults": 66, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Chicago airports add boxes for travelers to dump marijuana", "description": "CHICAGO (AP) — Chicago's O’Hare and Midway international airports have added boxes where travelers can dispose of recreational marijuana before they board their flights.", "url": "https://apnews.com/26f68254a2c006408c59dae7c8b560d1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-08T14:15:21Z", "content": "CHICAGO (AP) Chicago's OHare and Midway international airports have added boxes where travelers can dispose of recreational marijuana before they board their flights.\r\nThe cannabis amnesty boxes, as theyre called, were installed at each airport last week, jus… [+1361 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By AMANDA CUDA Connecticut Post", "title": "Man’s life saved by technology he helped develop", "description": "BRIDGEPORT, Conn. (AP) — It’s not lost on Louis Voros that he helped create something that saved his life.", "url": "https://apnews.com/d80faa08b45f8642c7339336215cc9c0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-08T14:14:45Z", "content": "BRIDGEPORT, Conn. (AP) Its not lost on Louis Voros that he helped create something that saved his life.\r\nVoros, 77, of Fairfield, is a retired mechanical engineer. During his career, he said, he worked on a lot of medical products, including da Vinci Surgical… [+3678 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "One dead, three injured in shooting in central Ottawa", "description": "OTTAWA, Ontario (AP) — Ottawa police said Wednesday one person was killed and three seriously injured in a shooting in a central part of the city.", "url": "https://apnews.com/0f107c2e38d157303e337f3fc60cd1ee", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-08T14:13:37Z", "content": "OTTAWA, Ontario (AP) Ottawa police said Wednesday one person was killed and three seriously injured in a shooting in a central part of the city.\r\nActing Insp. Francois D'Aoust said police were looking for a suspect.\r\nOfficers were called to the scene at Gilmo… [+508 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "Associated Press", "title": "Troopers: 2 men die when car slams into tree in Fort Myers", "description": "FORT MYERS, Fla. (AP) — Two men are dead following a car crash early Wednesday morning in Fort Myers, the Florida Highway Patrol said.", "url": "https://apnews.com/da98a008479008bba57db4fde4fffc05", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-08T14:11:38Z", "content": "FORT MYERS, Fla. (AP) Two men are dead following a car crash early Wednesday morning in Fort Myers, the Florida Highway Patrol said.\r\nPorter Danforth White, 19, apparently lost control of his Volkswagen Golf, ran off the road and hit a concrete median and the… [+337 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MICHAEL PUFFER Republican-American", "title": "Connecticut at forefront of local census outreach efforts", "description": "WATERBURY, Conn. (AP) — Arixsa Vargas has lived and worked in the city’s South End all her life, but the 46-year-old said she’s never seen a census form.", "url": "https://apnews.com/32ded11b3be62216878cefde83c7b9ab", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-08T14:07:15Z", "content": "WATERBURY, Conn. (AP) Arixsa Vargas has lived and worked in the citys South End all her life, but the 46-year-old said shes never seen a census form.\r\nI figured if they never mailed it to me, its not that important, said Vargas, owner of Marias Hair Styling S… [+6100 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By DARLENE SUPERVILLE Associated Press", "title": "Poll: World skeptical Trump will do right in global affairs", "description": "WASHINGTON (AP) — The world is still skeptical that after nearly three years in office President Donald Trump will do the right thing on foreign affairs, according to Pew Research Center polling released Wednesday.", "url": "https://apnews.com/05b237b3767206904c9687f2f6f2926e", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/8/4c/84cf84a3-e813-5910-bab3-da6c93b5da0a/5e14eafbd89fa.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-08T14:00:15Z", "content": "WASHINGTON (AP) The world is still skeptical that after nearly three years in office President Donald Trump will do the right thing on foreign affairs, according to Pew Research Center polling released Wednesday.\r\nThe poll was conducted well before Trump sign… [+3276 chars]"}]}