{"status": "ok", "totalResults": 71, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By LOLITA C. BALDOR Associated Press", "title": "US warship faces aggressive moves by Russia ship in Mideast", "description": "WASHINGTON (AP) — An American warship was “aggressively approached” by a Russian Navy ship in the North Arabian Sea, the U.S. Navy said Friday.", "url": "https://apnews.com/9774fa6062aee1a8ab9a29a8f20d2a0b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/tulsaworld.com/content/tncms/custom/image/aacc4e10-0064-11e7-adc2-d3321407a1f8.jpg", "publishedAt": "2020-01-10T16:19:42Z", "content": "WASHINGTON (AP) An American warship was aggressively approached by a Russian Navy ship in the North Arabian Sea, the U.S. Navy said Friday.\r\nNavy Cmdr. Josh Frey, spokesman for U.S. 5th Fleet, said that the USS Farragut was conducting routine operations Thurs… [+488 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Reynolds names interim director of Transportation Department", "description": "DES MOINES, Iowa (AP) — A civil engineer who has worked at the Iowa Department of Transportation for 28 years has been chosen as the agency's interim director, Iowa Gov. Kim Reynolds said Friday.", "url": "https://apnews.com/9c086606b7c2482ee53b1af0a11b6574", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T16:16:25Z", "content": "DES MOINES, Iowa (AP) A civil engineer who has worked at the Iowa Department of Transportation for 28 years has been chosen as the agency's interim director, Iowa Gov. Kim Reynolds said Friday.\r\nStuart Anderson has begun his new duties and will lead the depar… [+570 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TODD RICHMOND Associated Press", "title": "Army Reserve leaders accused of mishandling assault claims", "description": "WOODRIDGE, Ill. (AP) — Leaders of a U.S. Army Reserve unit that controls thousands of soldiers across the western United States have mishandled at least two sexual assault complaints by not referring them for outside investigation, according to victims, their…", "url": "https://apnews.com/737a0e63504cb998b728ccd76ef41126", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/f/d6/fd6f3c32-bddf-55ab-84cb-f3d79764d38f/5e18a357d36b7.image.jpg?crop=1764%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T16:14:30Z", "content": "WOODRIDGE, Ill. (AP) Leaders of a U.S. Army Reserve unit that controls thousands of soldiers across the western United States have mishandled at least two sexual assault complaints by not referring them for outside investigation, according to victims, their a… [+7649 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By KATHLEEN RONAYNE Associated Press", "title": "How independents can vote in California presidential primary", "description": "SACRAMENTO, Calif. (AP) — More than 5 million independent voters, called “no party preference” in California, are eligible to vote in the March 3 presidential primary. Here's what you need to know:", "url": "https://apnews.com/2519051ade072361ed4bc9e944158123", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T16:14:26Z", "content": "SACRAMENTO, Calif. (AP) More than 5 million independent voters, called no party preference in California, are eligible to vote in the March 3 presidential primary. Here's what you need to know:\r\nWHO CAN THEY VOTE FOR?\r\nThe Democratic, Libertarian and American… [+2741 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By NICHOLAS RICCARDI and HANNAH FINGERHUT Associated Press", "title": "AP-NORC poll: Americans split on personal, country's future", "description": "WASHINGTON (AP) — At home and in their own lives, Americans by and large have an upbeat view of the year to come. When it comes to how the country will fare in 2020, well, that's another matter.", "url": "https://apnews.com/e97f8df530fbce0ddaf16fe89c96b93f", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/a/72/a720032c-ea7b-5dcd-b548-081e99630b2e/5e18a3595af2e.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T16:14:18Z", "content": "WASHINGTON (AP) At home and in their own lives, Americans by and large have an upbeat view of the year to come. When it comes to how the country will fare in 2020, well, that's another matter.\r\nA new poll released Friday by The Associated Press-NORC Center fo… [+5445 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Boeing travails begins to ripple, 2,800 jobs in Kansas", "description": "WICHITA, Kan. (AP) — Aircraft parts maker Spirit AeroSystems has announced it is laying off 2,800 employees at its Wichita, Kansas, facility due to the grounding of the Boeing 737 Max.", "url": "https://apnews.com/930574810f993a6590190da74a3e4757", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/a/90/a90b15d8-a8d2-5dff-a00b-a030fbc759aa/5e18a35a13d73.image.jpg?crop=1822%2C1025%2C99%2C0&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T16:13:48Z", "content": "WICHITA, Kan. (AP) Aircraft parts maker Spirit AeroSystems has announced it is laying off 2,800 employees at its Wichita, Kansas, facility due to the grounding of the Boeing 737 Max.\r\nThe layoffs threaten to hurt a state economy that's been solid for months, … [+1513 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By MARTHA BELLISLE Associated Press", "title": "List of firearms bills to be proposed at Legislature", "description": "SEATTLE (AP) — When lawmakers return to Olympia on Monday for the 2020 legislative session, they’ll take up a list of bills that aim to prevent gun violence, ranging from bans on certain types of weapons to an increase in…", "url": "https://apnews.com/d72b20e8538eed2baa1c841c90edcfe4", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T16:13:14Z", "content": "SEATTLE (AP) When lawmakers return to Olympia on Monday for the 2020 legislative session, theyll take up a list of bills that aim to prevent gun violence, ranging from bans on certain types of weapons to an increase in training and background checks.\r\nAttorne… [+5793 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "By TAMARA LUSH Associated Press", "title": "Will Puerto Ricans new to Florida swing state to Democrats?", "description": "DAVENPORT, Fla. (AP) — When Martha Santiago moved to Polk County, Florida, from Puerto Rico in 1979 to teach in one of the county's first bilingual schools, there were two certainties.", "url": "https://apnews.com/84a1fb34b62bd84cf1c7ee666654cf17", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/editorial/d/53/d537271b-dbba-5d25-b0ea-03081a9d3c59/5e18a35a6b927.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-10T16:13:01Z", "content": "DAVENPORT, Fla. (AP) When Martha Santiago moved to Polk County, Florida, from Puerto Rico in 1979 to teach in one of the county's first bilingual schools, there were two certainties.\r\nOne was that oranges were an economic engine in the county that is wedged b… [+8160 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Judge sides with Kushner-owned company in apartment lawsuit", "description": "BALTIMORE (AP) — A Baltimore judge has ruled in favor of an apartment company owed by President Donald Trump's son-in-law and White House adviser Jared Kushner in a lawsuit that claimed the company charged improper fees.", "url": "https://apnews.com/8082266923118431853c2ad2b529d1ab", "urlToImage": "https://bloximages.chicago2.vip.townnews.com/billingsgazette.com/content/tncms/custom/image/77758902-e169-11e5-a168-77ef9f7ff013.png", "publishedAt": "2020-01-10T16:09:59Z", "content": "BALTIMORE (AP) A Baltimore judge has ruled in favor of an apartment company owed by President Donald Trump's son-in-law and White House adviser Jared Kushner in a lawsuit that claimed the company charged improper fees.\r\nWestminster Management was granted a mo… [+1697 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Man charged with posing as ride-service driver, raping woman", "description": "BOSTON (AP) — A man posed as a driver for a ride-hailing company, kidnapped a woman looking for a ride home after leaving a Boston nightclub, then drove her to Rhode Island and raped her, prosecutors say.", "url": "https://apnews.com/46c3d039f88329c909831928fad75aa6", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T16:07:16Z", "content": "BOSTON (AP) A man posed as a driver for a ride-hailing company, kidnapped a woman looking for a ride home after leaving a Boston nightclub, then drove her to Rhode Island and raped her, prosecutors say.\r\nAlvin Campbell Jr. was held on $250,000 cash bail after… [+991 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Student, teacher killed in Mexico school shooting", "description": "MEXICO CITY (AP) — At least two people were killed at an elementary school in northern Mexico Friday, authorities said.", "url": "https://apnews.com/9ba4a408103b5a02624b395ae971bbb1", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-10T16:03:20Z", "content": "MEXICO CITY (AP) At least two people were killed at an elementary school in northern Mexico Friday, authorities said.\r\nRegional public security coordinator Adelaido Flores told Milenio TV that an armed student had arrived at the Colegio Cervantes in Torreon, … [+301 chars]"}]}