{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Garbine Muguruza advances to Shenzhen Open quarterfinals", "description": "SHENZHEN, China (AP) — Former world No. 1 and two-time Grand Slam champion Garbine Muguruza had a 6-1, 7-6 (2) win over American Shelby Rogers to advance to the quarterfinals of Shenzhen Open on Wednesday.", "url": "https://apnews.com/bf6333c90351d3c96eedfa4a9b61361b", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/custom/image/4ce82390-59b2-11e6-a3c5-b77ec6e8d16d.png?resize=600%2C517", "publishedAt": "2020-01-08T09:03:59Z", "content": "SHENZHEN, China (AP) Former world No. 1 and two-time Grand Slam champion Garbine Muguruza had a 6-1, 7-6 (2) win over American Shelby Rogers to advance to the quarterfinals of Shenzhen Open on Wednesday.\r\nMuguruza will play Zarina Diyas in the quarterfinals a… [+974 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Strike by millions of workers hit businesses in India", "description": "NEW DELHI (AP) — Banking and other businesses across India suffered Wednesday as millions of workers went on strike protesting the Hindu nationalist government’s economic policies, especially the planned sale of several state-owned companies including Air Ind…", "url": "https://apnews.com/523063d993c67a1e8e894406411fd0b8", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/custom/image/00f1ee32-f2d0-11e6-9926-f7249dbfe53a.jpg", "publishedAt": "2020-01-08T08:59:10Z", "content": "NEW DELHI (AP) Banking and other businesses across India suffered Wednesday as millions of workers went on strike protesting the Hindu nationalist governments economic policies, especially the planned sale of several state-owned companies including Air India.… [+2032 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "EU promises to try to save Iran nuclear deal despite setback", "description": "BRUSSELS (AP) — The European Union said Wednesday it “will spare no efforts” in its attempts to keep alive an international deal preventing Iran from developing atomic weapons.", "url": "https://apnews.com/1851a415c0045108e2f41804ba30e2c7", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/assets/v3/editorial/e/14/e1477808-eaf4-5e1e-98e5-35446d19ffb1/5e159db527b6e.image.jpg?crop=1884%2C1060%2C0%2C20&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-08T08:55:53Z", "content": "BRUSSELS (AP) The European Union said Wednesday it will spare no efforts in its attempts to keep alive an international deal preventing Iran from developing atomic weapons.\r\nEU Commission President Ursula von der Leyen said her foreign affairs chief Josep Bor… [+1409 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Ukraine minister: Tehran plane crash killed Iranian, Canadian, Ukrainian, Swedish, Afghan, British and German nationals", "description": "KYIV, Ukraine (AP) — Ukraine minister: Tehran plane crash killed Iranian, Canadian, Ukrainian, Swedish, Afghan, British and German nationals.", "url": "https://apnews.com/9a14effcd945de91b61aad5bd6a4f008", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/richmond.com/content/tncms/custom/image/6a12cdcc-99eb-11e9-910a-20677ce06c14.jpg?resize=600%2C600", "publishedAt": "2020-01-08T08:44:03Z", "content": "KYIV, Ukraine (AP) Ukraine minister: Tehran plane crash killed Iranian, Canadian, Ukrainian, Swedish, Afghan, British and German nationals.\r\nCopyright 2020 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or … [+13 chars]"}, {"source": {"id": "associated-press", "name": "Associated Press"}, "author": "", "title": "Serena Williams, Wozniacki win again in Auckland in doubles", "description": "AUCKLAND, New Zealand (AP) — Serena Williams and Caroline Wozniacki prolonged their one-time-only doubles partnership Wednesday when they won through to the semifinals of the ASB Classic.", "url": "https://apnews.com/866dc9e7efe3f8e6c97f79ad6dd727f0", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/stltoday.com/content/tncms/assets/v3/editorial/0/92/092c6a10-834f-56ca-9ed4-31429ca10f67/5e1594c3b8e0a.image.jpg?crop=1763%2C992%2C0%2C91&resize=1120%2C630&order=crop%2Cresize", "publishedAt": "2020-01-08T08:08:21Z", "content": "AUCKLAND, New Zealand (AP) Serena Williams and Caroline Wozniacki prolonged their one-time-only doubles partnership Wednesday when they won through to the semifinals of the ASB Classic.\r\nPlaying in combination for the first time in their careers, Williams and… [+1199 chars]"}]}