{"status": "ok", "totalResults": 22, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Sam Dorman", "title": "Pro-life doctors, leaders criticize study that purportedly casts doubt on abortion reversals", "description": "Pro-life advocates responded en masse after media outlets portrayed abortion reversals as dangerous by promoting a study that's being described as \"misleading\" and \"ethically bankrupt.\"", "url": "https://www.foxnews.com/media/pro-life-doctors-leaders-abortion-reversals", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/iStock-Ultrasound.jpg", "publishedAt": "2019-12-14T00:12:11Z", "content": "Pro-life advocates responded en masse after media outlets portrayed abortion reversals as dangerous by promoting a study that's being described as misleading and \"ethically bankrupt.\"\r\n\"The only conclusion this supposed study from the abortion industry is tha… [+6942 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joseph Wulfsohn", "title": "Meghan McCain rips Tom Steyer during 'View' appearance: 'You bought your way' onto debate stage", "description": "\"The View\" co-host Meghan McCain got very confrontational with billionaire Democratic donor Tom Steyer during his Friday morning appearance on the daytime talk show, particularly over his participation in the upcoming Democratic debate.", "url": "https://www.foxnews.com/media/meghan-mccain-rips-tom-steyer-during-view-appearance-you-bought-your-way-onto-debate-stage", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/Tom-Steyer-Meghan-McCain-AP-Getty.jpg", "publishedAt": "2019-12-14T00:11:35Z", "content": "\"The View\" co-host Meghan McCain got very confrontational with billionaire Democratic donor Tom Steyer during his Friday morning appearance on the daytime talk show, particularly over his participation in the upcoming Democratic debate.\r\nMcCain began the host… [+2494 chars]"}]}