{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joshua Nelson", "title": "Bongino says Soleimani 'having a pulse' was an imminent threat, blasts 'shameful' media coverage on Iran", "description": "Former Secret Service agent Dan Bongino on Monday blasted the \"shameful\" media for having skewed coverage of the killing of top Iranian Gen. Qassem Soleimani.", "url": "https://www.foxnews.com/media/dan-bongino-iran-trump-soleimani-having-pulse-imminent-threat", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/Screen-Shot-2020-01-13-at-7.39.49-AM.png", "publishedAt": "2020-01-13T13:10:42Z", "content": "Former Secret Service agent Dan Bongino blasted the \"shameful\" media for having skewed coverage of the killing of top Iranian Gen. Qassem Soleimani, maintaining that there was an imminent threat posed by Soleimani, which prompted President Trump to order the … [+2193 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Chris Ciaccia", "title": "Viking's left Greenland because they over-hunted walruses, research claims", "description": "The mystery of why the Vikings abandoned their settlements in western Greenland has puzzled historians for hundreds of years. New research is shedding light on why they left the world’s largest island during the 15th century.", "url": "https://www.foxnews.com/science/viking-left-greenland-overhunted-walruses", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/viking-bonner-3.jpg", "publishedAt": "2020-01-13T13:03:25Z", "content": "The mystery of why the Vikings abandoned their settlements in western Greenland has puzzled historians for hundreds of years. New research is shedding light on why they left the world’s largest island during the 15th century.\r\nThe study, led by Dr. James Barr… [+3706 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Michael Goodwin", "title": "Michael Goodwin: Trump's 'peace through strength' philosophy on Iran is what America needs", "description": "After Trump’s decision to target Qassem Soleimani, the media’s favorite go-to critics featured members of Obama’s administration who crafted and sold the failed nuclear deal with Iran.", "url": "https://www.foxnews.com/opinion/michael-goodwin-trumps-peace-through-strength-philosophy-on-iran-is-what-america-needs", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/2trump-soleimani-split-216am.jpg", "publishedAt": "2020-01-13T12:00:06Z", "content": "For a few days, the band was back together. Following President Trump’s decision to target Qassem Soleimani, the media’s favorite go-to critics featured members of President Obama’s administration who crafted and sold the failed nuclear deal with Iran.\r\nJohn … [+1116 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "William Sanchez", "title": "Nazee Moinian Weighs In on Iranian Reaction To Soleimani Killing", "description": "This week, Martha is joined by Iranian-American, Nazee Moinian, consultant on Iranian foreign policy, to discuss the reaction of the Iranian people to the killing of Soleimani and more.", "url": "https://radio.foxnews.com/2020/01/13/nazee-moinian-weighs-in-on-iranian-reaction-to-soleimani-killing/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2019/04/THE_UNTOLD_STORY_FEATURED_IMAGE.png", "publishedAt": "2020-01-13T12:00:01Z", "content": "This week, Martha is joined by Iranian-American, Nazee Moinian, consultant on Iranian foreign policy, to discuss the reaction of the Iranian people to the airstrike that killed General Qasem Soleimani, a recent article Nazee wrote about giving President Trump… [+145 chars]"}]}