{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brie Stimson", "title": "Rudy Giuliani says dismissal of impeachment articles should be allowed under Senate trial rules", "description": "President Trump’s personal lawyer Rudy Giuliani said Wednesday that dismissal of the articles of impeachment against the president should be allowed under the Senate's trial rules because the allegations don’t amount to high crimes and misdemeanors.", "url": "https://www.foxnews.com/politics/rudy-giuliani-says-dismissal-of-impeachment-articles-should-be-allowed-under-impeachment-trial-rules", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/Rudy-Giuliani-Getty.jpg", "publishedAt": "2020-01-16T09:20:13Z", "content": "President Trump’s personal lawyer Rudy Giuliani said Wednesday that dismissal of the articles of impeachment against the president should be allowed under the Senate's trial rules because the allegations don’t amount to high crimes and misdemeanors.\r\nThe arti… [+2388 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Danielle Wallace", "title": "'OK, Boomer' uttered in Supreme Court for first time by Chief Justice Roberts in age discrimination lawsuit", "description": "“OK, Boomer,” was uttered for the first time in a Supreme Court session Wednesday as Chief Justice John Roberts, who will turn 65 this month, referenced the phrase used by younger people to dismiss their elders during a case about age discrimination in the wo…", "url": "https://www.foxnews.com/politics/ok-boomer-supreme-court-john-roberts-impeachment", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rtx38jul.jpg", "publishedAt": "2020-01-16T09:07:58Z", "content": "“OK, Boomer,” was uttered for the first time in a Supreme Court session Wednesday as Chief Justice John Roberts, who will turn 65 this month, referenced the phrase used by younger people to dismiss their elders during a case about age discrimination in the wo… [+2849 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Bossie", "title": "David Bossie: Pelosi’s impeachment hoax will soon end with Trump’s acquittal, followed by his reelection", "description": "The facts will ultimately show that President Trump did nothing that rises to the level of an impeachable offense and will leave senators with only one viable option: a swift acquittal.", "url": "https://www.foxnews.com/opinion/david-bossie-pelosis-impeachment-hoax-will-soon-end-with-trumps-acquittal-followed-by-his-reelection", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2020/01/15/694940094001_6122885269001_6122887439001-vs.jpg", "publishedAt": "2020-01-16T09:00:15Z", "content": "House Speaker Nancy Pelosi’s partisan impeachment circus is finally headed to the Senate to meet its rightful doom.\r\nPelosi, D-Calif., compared her unpopular impeachment hoax Wednesday to Paul Revere’s famous ride in 1775. Senators have now been warned: The r… [+5703 chars]"}]}