{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Talia Kaplan", "title": "Netanyahu rushed to bomb shelter after rocket attack on southern Israel", "description": "Israel’s Prime Minister Benjamin Netanyahu was rushed off stage and into a bomb shelter during a campaign event after the Israel Defense Forces (IDF) confirmed at least one rocket was fired into the country.", "url": "https://www.foxnews.com/world/israel-rocket-attack-benjamin-netanyahu-bomb-shelter", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/11/benjamin-netanyahu-2-AP.jpg", "publishedAt": "2019-12-25T20:35:15Z", "content": "Israel’s Prime Minister Benjamin Netanyahu was rushed off stage and into a bomb shelter during a campaign event after the Israel Defense Forces (IDF) confirmed at least one rocket was fired into the country. \r\nThe IDF tweeted Wednesday, “On Hanukkah, the fest… [+2605 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Deroy Murdock", "title": "Deroy Murdock: Pelosi’s blocking of Senate trial leaves Trump unable to defend himself", "description": "From Russia! Russia! Russia!, to the Emoluments Clause, to tax returns, and finally Ukraine-o-rama, Democrats have tortured Trump and his supporters for the high crime of defeating Hillary Clinton for president.", "url": "https://www.foxnews.com/opinion/deroy-murdock-pelosis-blocking-of-senate-trial-leaves-trump-unable-to-defend-himself", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/12/25/694940094001_6118153363001_6118158382001-vs.jpg", "publishedAt": "2019-12-25T20:32:38Z", "content": "House Democrats finally impeached President Trump. Senate Republicans now need to make the Democrats’ victory as Pyrrhic as possible.\r\nThis leftist triumph is less than a half-hour younger than the Trump presidency itself. “The campaign to impeach President T… [+1543 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ronn Blitzer", "title": "President Trump, Melania Trump share holiday video: 'We wish everyone a joyous and merry Christmas'", "description": "President Trump has mostly taken the day off of Twitter on Christmas, with the exception of posting holiday greetings.", "url": "https://www.foxnews.com/politics/president-trump-melania-christmas-video", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/12/24/694940094001_6118075349001_6118086057001-vs.jpg", "publishedAt": "2019-12-25T20:10:08Z", "content": "President Trump has mostly taken the day off of Twitter on Christmas, with the exception of posting holiday greetings from his family.\r\nWednesday morning, the president simply tweeted, \"MERRY CHRISTMAS,\" then followed that up by retweeting a video message fro… [+2221 chars]"}]}