{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nick Givas", "title": "Trump supporter grabs spotlight at Sanders rally with a message for the president", "description": "A protestor took center-stage at an Iowa campaign rally for 2020 presidential candidate Sen. Bernie Sanders, I-Vt., on Saturday, when he stood up and delivered a message to President Trump.", "url": "https://www.foxnews.com/politics/trump-supporter-bernie-sanders-rally-2020", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/bernie-sanders-donald-trump-AP.jpg", "publishedAt": "2019-12-15T03:03:51Z", "content": "A Trump supporter took center stage at an Iowa campaign rally for 2020 presidential candidate Sen. Bernie Sanders, I-Vt., on Saturday, where he stood up and delivered a message to President Trump.\r\nSanders sensed trouble from the beginning when he saw the you… [+1287 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Charles Creitz", "title": "Nancy Grace: 'I find it very, very hard to believe' Jeffrey Epstein killed himself", "description": "Former longtime cable news host Nancy Grace said she finds it \"hard to believe\" but however not \"impossible\" that disgraced financier Jeffrey Epstein killed himself while in law enforcement detention.", "url": "https://www.foxnews.com/media/nancy-grace-jeffrey-epstein-theories", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/NancyGrace1.jpg", "publishedAt": "2019-12-15T02:00:09Z", "content": "Former longtime cable news host Nancy Grace said she finds it \"hard to believe,\" but not \"impossible,\" that disgraced financier Jeffrey Epstein killed himself while in prison.\r\nGrace, a former prosecutor in Georgia's Fulton County District Attorney's office, … [+1814 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Nick Givas", "title": "Joe Burrow wins 2019 Heisman Trophy as LSU heads into College Football Playoff", "description": "The 2019 Heisman Trophy was awarded to Louisiana State University (LSU) quarterback Joe Burrow on Saturday after he led the team to an undefeated 13-0 season and birth in the College Football Playoff.", "url": "https://www.foxnews.com/sports/joe-burrow-heisman-trophy-ceremony-winner", "urlToImage": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "publishedAt": "2019-12-15T01:55:07Z", "content": "The 2019 Heisman Trophy was awarded to Louisiana State University (LSU) quarterback Joe Burrow on Saturday after he led the team to an undefeated 13-0 season and berth in the College Football Playoff.\r\nHe denied the Oklahoma Sooners the opportunity to boast t… [+1716 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Gary Gastelu", "title": "Lawsuit says $44M Ferrari 250 GTO is missing a part", "description": "One of the most expensive cars ever sold is at the center of a lawsuit over a missing part.", "url": "https://www.foxnews.com/auto/lawsuit-says-44-million-ferrari-250-gto-is-missing-a-part", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/gt3.jpg", "publishedAt": "2019-12-15T00:49:49Z", "content": "One of the most expensive cars ever sold is at the center of a lawsuit over a missing part.\r\n(SWNS)\r\nAmerican collector Bernard Carl sold the 1962 Ferrari 250 GTO for $44 million to British classic car trader Gregor Fisken in 2017. The blue coupe is the secon… [+1508 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "Phone scam: North Dakota father gets call saying his Marine son was killed on active duty", "description": "A North Dakota father received a piece of horrible news that left him searching for options after a private phone number reached out to tell him that his son, a Marine, had been killed while on active duty.", "url": "https://www.foxnews.com/us/north-dakota-father-hoax-call-son-marine-dead-scam", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/Holding-Phone-iStock.jpg", "publishedAt": "2019-12-15T00:48:51Z", "content": "A North Dakota father received a piece of horrible news that left him searching for options after a private phone number reached out to tell him that his son, a Marine, had been killed while on active duty.\r\nThat phone call -- which turned out to be scam -- s… [+2488 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Sam Dorman", "title": "Dershowitz spars with former law student, CNN analyst over impeachment: 'C'mon Alan'", "description": "Harvard Law Professor Alan Dershowitz debated Democrats' impeachment push with CNN Chief Legal Analyst Jeffrey Toobin, who also happened to be his former law student.", "url": "https://www.foxnews.com/media/dershowitz-toobin-impeachment", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/Alan-Dershowitz-Getty.jpg", "publishedAt": "2019-12-15T00:39:34Z", "content": "Harvard Law Professor Alan Dershowitz debated Democrats' impeachment push with CNN Chief Legal Analyst Jeffrey Toobin, who also happens to be his former law student.\r\nToobin and Dershowitz disagreed on Friday over whether Trump met the constitutional criteria… [+2674 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Sam Dorman", "title": "California man charged with murder after allegedly forcing girlfriend to induce miscarriage", "description": "A California man faces a first degree murder charge after allegedly holding his girlfriend at gun point and forcing her to effectively abort her own child.", "url": "https://www.foxnews.com/us/california-man-charged-murder-miscarriage-abortion", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/Police-lights-.jpg", "publishedAt": "2019-12-15T00:32:25Z", "content": "A California man faces a first-degree murder charge after allegedly holding his girlfriend at gunpoint and forcing her to take pills and effectively abort her own child.\r\nPolice arrested the man, 23-year-old Jagmeet Sandhu, on Wednesday after receiving a repo… [+2727 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "David Aaro", "title": "FBI arrests North Carolina man who flaunted cash after stealing $88G from bank vault", "description": "A criminal indictment was unsealed this week following the arrest of a North Carolina bank employee who the FBI says stole thousands from a bank vault and posted pictures on Facebook of him holding the cash.", "url": "https://www.foxnews.com/us/fbi-arrests-north-carolina-man-flaunted-cash-bank-robbery", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/12/Judge-Gavel-Money-iStock.jpg", "publishedAt": "2019-12-15T00:22:58Z", "content": "A criminal indictment was unsealed this week following the arrest of a North Carolina bank employee whom the FBI says allegedly stole thousands from a bank vault and posted pictures of himself on Facebook holding the cash, according to the Department of Justi… [+2719 chars]"}]}