{"status": "ok", "totalResults": 83, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joshua Nelson", "title": "Sanders on war powers resolution: Nothing could be 'dumber' than having Congress 'take over foreign policy'", "description": "Following Speaker Nancy Pelosi announcing plans for the House to vote Thursday on a War Powers Resolution that aims to limit President Trump’s military action toward Iran, former White House press secretary Sarah Sanders on Thursday blasted the resolution.", "url": "https://www.foxnews.com/media/sarah-sanders-iran-pelosi-war-powers-trump", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/Screen-Shot-2020-01-09-at-10.32.59-AM.png", "publishedAt": "2020-01-09T16:16:49Z", "content": "Following Speaker Nancy Pelosi announcing plans for the House to vote Thursday on a war powers resolution that aims to limit President Trump’s ability to conduct military action against Iran, former White House Press Secretary Sarah Sanders took aim at Democr… [+1777 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Peter Caterina", "title": "Chris Wallace – Fox News Chief International Celebrity Resort Correspondent", "description": "Fox News Sunday Anchor and newly titled Fox News Chief International Celebrity Resort Correspondent, Chris Wallace, joined Brian Kilmeade and asked for advice as a best-selling author on how to best promote his upcoming book. Wallace and Kilmeade also discuss…", "url": "https://radio.foxnews.com/2020/01/09/chris-wallace-fox-news-chief-international-celebrity-resort-correspondent/", "urlToImage": "https://radio.foxnews.com/wp-content/uploads/2016/06/Chris-Wallace-Kilmeade.jpg", "publishedAt": "2020-01-09T16:09:36Z", "content": "Fox News Sunday Anchor and newly titled Fox News Chief International Celebrity Resort Correspondent, Chris Wallace, joined Brian Kilmeade and asked for advice as a best-selling author on how to best promote his upcoming book. \r\nWallace and Kilmeade also discu… [+216 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Adam Shaw", "title": "US defends Soleimani killing as ‘self-defense’ ahead of tense UN meeting", "description": "The Trump administration is defending the strike that killed Iranian Gen. Qassem Soleimani last week as self-defense, while warning it is prepared to take \"additional actions\" if needed -- ahead of what is expected to be a tense meeting of the U.N. Security C…", "url": "https://www.foxnews.com/politics/us-defends-soleimani-killing-as-self-defense-ahead-of-tense-un-meeting", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2020/01/09/694940094001_6120947888001_6120947724001-vs.jpg", "publishedAt": "2020-01-09T16:02:05Z", "content": "UNITED NATIONS -- The Trump administration is defending the strike that killed Iranian Gen. Qassem Soleimani last week as self-defense, while warning it is prepared to take \"additional actions\" if needed -- ahead of what is expected to be a tense meeting of t… [+3837 chars]"}]}