{"status": "ok", "totalResults": 69, "articles": [{"source": {"id": "fox-news", "name": "Fox News"}, "author": "Jill Gamberg", "title": "Jill Gamberg, MD: Australia's fires and my country's health crisis – A view from the ground", "description": "We are devastated by what has happened to our country and what is happening in the world.", "url": "https://www.foxnews.com/opinion/jill-gamberg-md-australias-fires-and-my-countrys-health-crisis-a-view-from-the-ground", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2020/01/06/694940094001_6120082604001_6120085910001-vs.jpg", "publishedAt": "2020-01-08T17:52:43Z", "content": "A patient sits down in my room and says, “it feels like there is an elephant sitting on my chest, I just cannot catch my breath when exerting myself, and I am up all night coughing.”\r\nShe is an otherwise healthy young person who has the occasional flare-up of… [+4154 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Alexandra Deabler", "title": "8-year-old Toronto Maple Leafs fan wants hockey-themed birthday cake, gets bologna company's logo instead", "description": "Well, it's pretty close...", "url": "https://www.foxnews.com/food-drink/8-year-toronto-maple-leafs-fan-hockey-birthday-cake-fail", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/Gateau-Jacob.jpg", "publishedAt": "2020-01-08T17:50:37Z", "content": "Well, it’s technically a maple leaf.\r\nAn 8-year-old Toronto Maple Leafs fan celebrating his birthday was surprised -- and quite disappointed -- when his cake was brought out.\r\n'PATHETIC' FROG BIRTHDAY CAKE FROM SUPERMARKET LEAVES PARENTS 'MORTIFIED': 'IT WAS … [+2279 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Julia Musto", "title": "Democrat Manchin calls for 'super diplomacy' with Iran, says DC partisanship must end", "description": "Now is the time for President Trump to show \"super diplomacy\" in handling relations with the Iranian regime, Democratic Vermont Senator Joe Manchin said Wednesday.", "url": "https://www.foxnews.com/media/joe-manchin-diplomacy-trump-iran-missile-attacks", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/MANCHIN.jpg", "publishedAt": "2020-01-08T17:46:17Z", "content": "Now is the time for President Trump to show \"super diplomacy\" in handling U.S. relations with the rogue Iranian regime, DemocraticWest VirginiaSenator Joe Manchin said Wednesday.\r\nAppearing on \"America's Newsroom\" with co-host Bill Hemmer, Manchin said that a… [+2513 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "ESPN star critical of New York Giants' head coach hire: 'This is what you come up with?'", "description": "The New York Giants reportedly hired Joe Judge as their next head coach Tuesday to replace Pat Shurmur after two straight losing seasons and a total of nine wins over that stretch.", "url": "https://www.foxnews.com/sports/espn-giants-head-coach-hire-joe-judge", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/1703a2a9-Joe-Judge.jpg", "publishedAt": "2020-01-08T17:45:25Z", "content": "Not everyone is happy with the New York Giants' choice for a new coach, including ESPN's Stephen A. Smith, who said that in hiring Joe Judge the team made a \"mockery\" of the NFL's Rooney Rule.\r\nThe broadcaster was among the critics of the Giants' hire of the … [+3435 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": null, "title": "Pictures: Iran attacks Iraqi air bases housing US troops", "description": "The Jan. 7 missile attacks resulted in no casualties.", "url": "https://www.foxnews.com/world/pictures-iran-attack-on-the-al-asad-air-base-in-iraq", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/01_sat04.jpg", "publishedAt": "2020-01-08T17:44:37Z", "content": "This material may not be published, broadcast, rewritten,\r\n or redistributed. ©2020 FOX News Network, LLC. All rights reserved.\r\n All market data delayed 20 minutes."}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Paulina Dedaj", "title": "Connecticut lawyer, 'close personal friend' of Fotis Dulos, possibly dug hole described as '100 percent a human grave'", "description": "A Connecticut attorney and “a close personal friend” of Fotis Dulos, the estranged husband of missing mother of five Jennifer Dulos, was arrested this week in connection with her murder after court documents revealed he may have dug the grave she was to be bu…", "url": "https://www.foxnews.com/us/connecticut-lawyer-close-personal-friend-of-fotis-dulos-may-have-dug-grave-at-gun-club-days-before-jennifer-dulos-disappeared-affidavit", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/dulos.jpg", "publishedAt": "2020-01-08T17:36:11Z", "content": "A Connecticut attorney and “a close personal friend” of Fotis Dulos, the estranged husband of a missing mother of five, was arrested this week after court documents revealed he may have dug a grave for her.\r\nKent Mawhinney, a 54-year-old practicing attorney f… [+4464 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Utah confirms first flu death of season", "description": "The person died recently and was under the age of 65.", "url": "https://www.foxnews.com/health/utah-confirms-first-flu-death", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/09/694940094001_6093389669001_6093387722001-vs.jpg", "publishedAt": "2020-01-08T17:26:42Z", "content": "SALT LAKE CITY Utah health officials have confirmed the state’s first flu death this season.\r\nTEXAS BOY, 10, DIES AFTER CONTRACTING FLU OVER WINTER BREAK\r\nThe person died recently, was under the age of 65 and lived in one of five southern counties: Beaver, Ga… [+579 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Chris Ciaccia", "title": "New method to detect oxygen on exoplanets developed by researchers", "description": "Even before its launch in 2021, researchers have discovered a new way to use NASA's James Webb Space Telescope (JWST) to look for signs of oxygen on distant exoplanets.", "url": "https://www.foxnews.com/science/new-method-detect-oxygen-on-exoplanets", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/exoplanet-oxygen-molecules.jpg", "publishedAt": "2020-01-08T17:24:47Z", "content": "Even before its launch in 2021, researchers have discovered a new way to use NASA's James Webb Space Telescope (JWST) to look for signs of oxygen on distant exoplanets, according to a new study.\r\nThe research notes that by looking for signals of oxygen molecu… [+3069 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "NFL teams come under fire for failing to hire black head coaches", "description": "The Dallas Cowboys hired Mike McCarthy, the Carolina Panthers hired Matt Rhule and the New York Giants hired Joe Judge to become their next head coaches over the last two days.", "url": "https://www.foxnews.com/sports/nfl-teams-under-fire-failing-hire-black-head-coaches", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/McCarthy-Rhule-Judge.jpg", "publishedAt": "2020-01-08T17:20:15Z", "content": "The Dallas Cowboys hired Mike McCarthy, the Carolina Panthers chose Matt Rhule and the New York Giants tapped Joe Judge to become their next head coaches over the last two days.\r\nThe flurry of hirings brought the NFL under fire Tuesday from those who think th… [+2680 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Associated Press", "title": "Cancer group finds biggest 1-year drop in US death rate", "description": "The overall cancer death rate has been falling about 1.5 percent a year since 1991. It fell 2.2 percent from 2016 to 2017, according to the new American Cancer Society report.", "url": "https://www.foxnews.com/health/cancer-group-biggest-1-year-drop-us-death-rate", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/12/17/694940094001_6116393746001_6116401274001-vs.jpg", "publishedAt": "2020-01-08T17:19:12Z", "content": "Researchers on Wednesday reported the largest-ever one-year decline in the U.S. cancer death rate, a drop they credited to advances in lung-tumor treatments.\r\nThe overall cancer death rate has been falling about 1.5 percent a year since 1991. It fell 2.2 perc… [+2479 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Travis Fedschun", "title": "'Significant' severe weather event, including tornado threat, for millions across South", "description": "A potential large-scale severe weather outbreak is expected to put millions of people at risk for severe storms and tornadoes across the Deep South later this week.", "url": "https://www.foxnews.com/us/significant-severe-weather-event-south-tornado-threat-heavy-rain", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/severe2.jpg", "publishedAt": "2020-01-08T17:14:13Z", "content": "It may be well into winter, but a potential large-scale severe weather outbreak is expected to put millions of people at risk for severe storms and tornadoes across the Deep South later this week.\r\nThe National Weather Service's Weather Prediction Center said… [+2239 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Ryan Gaydos", "title": "Tom Brady's potential Patriots departure draws reactions from Massachusetts politicians", "description": "Tom Brady’s future with the New England Patriots has all kinds of question marks but Massachusetts politicians are offering the legendary quarterback some perks if he chooses to stay in Foxborough.", "url": "https://www.foxnews.com/sports/tom-brady-patriots-departure-massachusetts-politicians-reactions", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/Tom-Brady22.jpg", "publishedAt": "2020-01-08T17:08:26Z", "content": "Tom Brady’s future with the New England Patriots raises all kinds of questions, but Massachusetts politicians are offering the legendary quarterback some perks if he chooses to stay in Foxborough.\r\nBoston Mayor Martin Walsh said Tuesday he would be willing to… [+1698 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Sam Dorman", "title": "Warren's climate change plan: No new homes or buildings unless they're carbon-neutral", "description": "Sen. Elizabeth Warren, D-Mass., proposed radically restricting construction in the United States on Wednesday, telling MSNBC that she would require any new houses and buildings have \"zero carbon footprint.\"", "url": "https://www.foxnews.com/media/elizabeth-warren-buildings-homes-climate-change-carbon-footprint", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2019/11/AP19327855271919.jpg", "publishedAt": "2020-01-08T17:00:20Z", "content": "Sen. Elizabeth Warren, D-Mass., proposed radically restricting construction in the United States on Wednesday, telling MSNBC that as president, she would require any new houses or buildings to have \"zero carbon footprint\" by 2028.\r\n\"What scares me is every ti… [+1735 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Greg Norman", "title": "Child stowaway found dead on Air France plane that landed in Paris from Ivory Coast", "description": "A “lifeless body of a stowaway” has been found on an Air France plane that arrived in Paris Wednesday, the airline says.", "url": "https://www.foxnews.com/world/child-stowaway-dead-air-france-plane", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/iStock-Air-France.jpg", "publishedAt": "2020-01-08T17:00:18Z", "content": "A “lifeless body of a stowaway” was found in the landing gear area of an Air France plane that arrived in Paris on Wednesday, the airline says.\r\nThe body is believed to be of a child around 10 years old, the BBC reported, citing local media. The aircraft orig… [+718 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Fox News", "title": "Transcript of Trump’s remarks on Iran", "description": "The following is a transcript of President Trump's remarks on Iran Wednesday morning:", "url": "https://www.foxnews.com/politics/transcript-of-trumps-remarks-on-iran", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/Trump010620.jpg", "publishedAt": "2020-01-08T16:52:46Z", "content": "The following is a transcript of President Trump's remarks on Iran Wednesday morning:\r\nAs long as I'm president of the United States, Iran will never be allowed to have a nuclear weapon. Good morning. I'm pleased to inform you the American people should be ex… [+6079 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Alexandria Hein", "title": "Texas boy, 10, dies after contracting flu over winter break", "description": "The state has reported eight pediatric influenza-related deaths since October.", "url": "https://www.foxnews.com/health/texas-boy-10-dies-contracting-flu", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095666100001_6095663710001-vs.jpg", "publishedAt": "2020-01-08T16:48:34Z", "content": "A 10-year-old boy in Texas died late last month after coming down with the flu, his family said, although officials are working to determine whether the virus was the cause of the child’s death. Jaxon Campbell, a student at Austin Elementary School in Coppell… [+1487 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Joshua Nelson", "title": "DNC spokeswoman on Iran tensions: Americans are 'scared' by Trump and want a president with 'even hand'", "description": "As foreign policy takes center stage on the campaign trail after escalating tensions with Iran, DNC Communications Director Xochitl Hinojosa argued on Wednesday that the 2020 Democratic hopefuls are delivering better ideas than President Trump.", "url": "https://www.foxnews.com/media/dnc-iran-americans-scared-trump-hinojosa", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/Screen-Shot-2020-01-08-at-11.09.54-AM.png", "publishedAt": "2020-01-08T16:48:25Z", "content": "As foreign policy takes center stage on the campaign trail amid escalating U.S. tensions with Iran, the spokeswoman for the Democratic National Committee argued Wednesday that the 2020 Democratic hopefuls are delivering better foreign policy ideas than Presid… [+2052 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Madeline Farber", "title": "Mom’s RSV warning goes viral after infant son sickened: ‘Just do what you’re asked’", "description": "A young mother is warning others not to kiss infants after her son contracted a potentially deadly infection from strangers doing just that.", "url": "https://www.foxnews.com/health/moms-rsv-warning-son-sickened", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/iStock-1167978175.jpg", "publishedAt": "2020-01-08T16:38:51Z", "content": "A young mother is warning others not to kiss infants after her son contracted a potentially deadly infection from family and friends doing just that.\r\nZoe McGlade, 22, from Dublin, Ireland, took to Facebook in late December after her baby son, Koby, was hospi… [+3913 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Brian Flood", "title": "CNN International doesn't mention guest was spokesperson for Iranian hostage-takers during 1979 crisis", "description": "CNN International anchor Christiane Amanpour spoke with Iranian vice president for women and global affairs Massoumeh Ebtekar on Tuesday but failed to mention she played a key role in the 1979 Iran hostage crisis.", "url": "https://www.foxnews.com/media/cnn-international-guest-iran-hostage-takers-spokesperson", "urlToImage": "https://media2.foxnews.com/BrightCove/694940094001/2019/11/04/694940094001_6100392021001_6100389801001-vs.jpg", "publishedAt": "2020-01-08T16:36:06Z", "content": "CNN International anchor Christiane Amanpour spoke with Iranian vice president for women and global affairs Massoumeh Ebtekar on Tuesday but failed to mention Ebtekar played a key role in the 1979 Iran hostage crisis.\r\nAmanpour began by asking Ebtekar if Iran… [+2490 chars]"}, {"source": {"id": "fox-news", "name": "Fox News"}, "author": "Travis Fedschun", "title": "Puerto Rico earthquake, power outage spurs state of emergency, many sleep outside amid 'uncertainty'", "description": "Schools across Puerto Rico remained closed on Wednesday as more than a half a million people remained without electricity after the island's worst earthquake in a century killed at least one person and caused homes to collapse.", "url": "https://www.foxnews.com/us/puerto-rico-earthquake-state-of-emergency-sleep-outside-electricity-outage-aftershock", "urlToImage": "https://static.foxnews.com/foxnews.com/content/uploads/2020/01/PR_5.jpg", "publishedAt": "2020-01-08T16:34:35Z", "content": "Schools across Puerto Rico remained closed on Wednesday as more than a half-million people remained without electricity after the island's worst earthquake in a century.\r\nPresident Trump declared an emergency, freeing up federal funds, and Puerto Rico Gov. Wa… [+3933 chars]"}]}