{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "Associated Press", "title": "Uganda police detain Bobi Wine, foil meeting with supporters", "description": "Ugandan police have detained the singer and political activist known as Bobi Wine", "url": "https://abcnews.go.com/International/wireStory/uganda-police-detain-bobi-wine-foil-meeting-supporters-68091180", "urlToImage": "null", "publishedAt": "2020-01-06T09:44:47Z", "content": "KAMPALA, Uganda -- \r\nUgandan police have detained the singer and political activist known as Bobi Wine, who planned Monday to hold his first public meeting with supporters as a presidential aspirant.\r\nPolice fired tear gas as they dispersed the crowd outside … [+828 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "TOM ODULA Associated Press", "title": "Kenya police: 3 arrested trying to enter British Army camp", "description": "Kenyan police say they have arrested three men who tried to force their way into a British Army training camp", "url": "https://abcnews.go.com/International/wireStory/kenya-police-arrested-enter-british-army-camp-68091113", "urlToImage": "null", "publishedAt": "2020-01-06T09:27:37Z", "content": "NAIROBI, Kenya -- \r\nKenyan police say they have arrested three men who tried to force their way into a British Army training camp on the same day that al-Shabab extremists attacked a military base and killed three U.S. military personnel.\r\nThe internal police… [+761 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Associated Press", "title": "Over 1,000 protest in Bangladesh after student is raped", "description": "More than 1,000 students and activists have linked their hands, chanted slogans and marched through Bangladesh's main public university after a second-year student was raped", "url": "https://abcnews.go.com/International/wireStory/1000-protest-bangladesh-student-raped-68091112", "urlToImage": "null", "publishedAt": "2020-01-06T09:19:32Z", "content": "DHAKA, Bangladesh -- \r\nMore than 1,000 students and activists on Monday linked their hands, chanted slogans and marched through Bangladesh's main public university after a second-year student was raped, police said.\r\nThe protesters gathered on the campus in D… [+974 chars]"}]}