{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "Mark Hanrahan", "title": "Pope Francis apologizes for slapping woman's hand after she grabbed him", "description": "Pope Francis was pulled off balance by a woman and had to slap her hand in order to free himself during a New Year's Even event in St. Peter’s Square.", "url": "https://abcnews.go.com/International/pope-francis-apologizes-slapping-womans-hand-grabbed/story?id=68016574", "urlToImage": "https://s.abcnews.com/images/International/pope-4-gty-ps-200101_hpMain_16x9_992.jpg", "publishedAt": "2020-01-01T14:32:21Z", "content": "Pope Francis apologized for slapping the hand of a woman who grabbed him and pulled him off balance at a New Years Eve event in St. Peters Square.\r\nVideo from Vatican TV shows Francis, accompanied by what appear to be security officers, greeting pilgrims acro… [+1299 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Security tight, Jews gather at stadium for religious event", "description": "A large gathering of Jews at MetLife Stadium will draw a significant security presence after recent anti-Semitic attacks in the New York City area", "url": "https://abcnews.go.com/US/wireStory/security-tight-jews-gather-stadium-religious-event-68018163", "urlToImage": "null", "publishedAt": "2020-01-01T14:10:17Z", "content": "EAST RUTHERFORD, N.J. -- \r\nMore than 92,000 Jewish people will congregate Wednesday at MetLife Stadium in New Jersey to celebrate the reading of the entire Talmud in an event called Siyum HaShas and will draw a significant security presence after recent anti-… [+966 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Family of 4, including twin boys, killed in Puerto Rico", "description": "Authorities in Puerto Rico say a family of four, including twin boys, was shot to death inside their home in Puerto Rico after celebrating New Year's Eve", "url": "https://abcnews.go.com/International/wireStory/family-including-twin-boys-killed-puerto-rico-68018128", "urlToImage": "null", "publishedAt": "2020-01-01T14:08:17Z", "content": "SAN JUAN, Puerto Rico -- \r\nA family of four, including twin boys, was shot to death inside their home in Puerto Rico after celebrating New Year's Eve, authorities said.\r\nPolice said the couple's 16-year-old son was seriously injured and is hospitalized.\r\nThe … [+790 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Simone Miranda", "title": "Download Our First Digital Wallpaper of 2020 Now", "description": "Celebrate the new year and new decade with this Disney Parks Blog 2020 wallpaper, designed by Disney artist LeeAnn Clayton! Watch for midnight as the fireworks light up Cinderella Castle. Add this wallpaper to your desktop or mobile device now, and please be …", "url": "https://disneyparks.disney.go.com/blog/2020/01/download-our-first-digital-wallpaper-of-2020-now/", "urlToImage": "https://cdn1.parksmedia.wdprapps.disney.com/media/blog/wp-content/uploads/2019/12/2020_HappyNewYear_1366x768.jpg", "publishedAt": "2020-01-01T14:00:57Z", "content": "By submitting this form, you are granting Disney Parks Blog permission to email you. You can revoke permission to mail your email address at any time using the unsubscribe link, found at the bottom of every email. We take your privacy seriously. For more info… [+495 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Man caught on video snatching woman from NYC subway train", "description": "Police have arrested a man after a video surfaced showing him apparently trying to abduct a woman on the New York City subway", "url": "https://abcnews.go.com/US/wireStory/man-caught-video-snatching-woman-nyc-subway-train-68017292", "urlToImage": "null", "publishedAt": "2020-01-01T13:01:57Z", "content": "NEW YORK -- \r\nNew York police arrested a man after a video surfaced showing him apparently trying to abduct a woman on the subway.\r\nSonny Alloway, 48, was charged with unlawful imprisonment on suspicion of grabbing a young woman and carrying her off a No. 6 t… [+916 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Greens likely to be in Austria's next coalition government", "description": "Austria's main center-right party and the environmentalist Greens are likely to announce a coalition deal that would return ex-Chancellor Sebastian Kurz to power", "url": "https://abcnews.go.com/International/wireStory/greens-austrias-coalition-government-68017291", "urlToImage": "https://s.abcnews.com/images/International/WireAP_8c45061c867a4383bfe810c2eadb5f43_16x9_992.jpg", "publishedAt": "2020-01-01T12:55:32Z", "content": "BERLIN -- \r\nAustria's main center-right party and the environmentalist Greens are likely to announce a coalition deal Wednesday night that would return ex-Chancellor Sebastian Kurz to power.\r\nThe 33-year-old Kurz's People's Party embarked on negotiations with… [+1075 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "At least five shot at bar in West Virginia on New Year's Day", "description": "News reports say at least five people were injured, some seriously, after being shot inside a bar early New Year's Day", "url": "https://abcnews.go.com/US/wireStory/shot-bar-west-virginia-years-day-68017290", "urlToImage": "null", "publishedAt": "2020-01-01T12:50:32Z", "content": "HUNTINGTON, W. Va. -- \r\nNews reports say at least five people were injured, some seriously, after being shot inside a bar early New Year's Day. \r\nInterim Police Chief Ray Cornwell of the Huntington Police Department told local news stations Wednesday that the… [+375 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Shelling hit school killing 6 in rebel-held Syrian village", "description": "Syrian opposition activists say government forces have shelled a rebel-held village in the country's northwest, hitting a school and killing at least six people", "url": "https://abcnews.go.com/International/wireStory/shelling-hit-school-killing-rebel-held-syrian-village-68017289", "urlToImage": "https://s.abcnews.com/images/International/WireAP_5aeea5da074c4aa29c25e98434a851e3_16x9_992.jpg", "publishedAt": "2020-01-01T12:41:33Z", "content": "BEIRUT -- \r\nSyrian government forces shelled a rebel-held village in the country's northwest on Wednesday, hitting a school and killing at least six people, opposition activists said.\r\nThe attack in Idlib province, the last rebel stronghold Syria, was part of… [+1618 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Pope: Sorry I lost patience with hand-shaker who yanked me", "description": "Pope Francis has apologized for hitting the hand of a well-wisher who grabbed him and yanked him toward her", "url": "https://abcnews.go.com/International/wireStory/pope-lost-patience-hand-shaker-yanked-68017255", "urlToImage": "https://s.abcnews.com/images/International/WireAP_9d2c8b2550e54d28a46d17233d496db2_16x9_992.jpg", "publishedAt": "2020-01-01T12:36:21Z", "content": "VATICAN CITY -- \r\nPope Francis has apologized for hitting the hand of a well-wisher who grabbed him and yanked him toward her. \r\nIn his new year's wishes to the public in St. Peter's Square on Wednesday, Francis confessed to losing his patience with the woman… [+552 chars]"}]}