{"status": "ok", "totalResults": 3, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "China says world should stick to 'One China' after Tsai win", "description": "China says that the international community should abide by the idea that there is only one China, ruled by the Communist Party, after Taiwan reelected its democratic leader", "url": "https://abcnews.go.com/International/wireStory/china-world-stick-china-tsai-win-68223979", "urlToImage": "https://s.abcnews.com/images/International/WireAP_a73f81536dc547f2b1fded1da82ba2eb_16x9_992.jpg", "publishedAt": "2020-01-12T03:49:16Z", "content": "BEIJING -- \r\nChina said Sunday that the world should abide by the idea that there is only one China, ruled by the Communist Party, after Taiwan reelected its democratic leader.\r\nWe hope and believe that the international community will continue adhering to th… [+1092 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Miami Beach officer injured in South Beach shooting", "description": "A shooting in Miami Beach’s tourist-filled South Beach neighborhood has left a police officer and one other person hospitalized", "url": "https://abcnews.go.com/US/wireStory/miami-beach-officer-injured-south-beach-shooting-68222961", "urlToImage": "null", "publishedAt": "2020-01-12T02:55:17Z", "content": "MIAMI BEACH, Fla. -- \r\nA shooting in Miami Beachs tourist-filled South Beach neighborhood left a police officer and one other person hospitalized Saturday night. \r\nMiami Beach police tweeted that the shooting occurred on Ocean Drive in the citys famous Art De… [+197 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "NICK PERRY Associated Press", "title": "Firefighter dies as Australia plans to adapt to wildfires", "description": "A firefighter has died battling the Australian wildfire crisis and the prime minister has said his government is adapting and building resilience to the fire danger posed by climate change", "url": "https://abcnews.go.com/Technology/wireStory/firefighter-dies-australia-plans-adapt-wildfires-68221288", "urlToImage": "null", "publishedAt": "2020-01-12T00:03:17Z", "content": "BURRAGATE, Australia -- \r\nAnother firefighter has died battling the Australian wildfire crisis and the prime minister on Sunday said his government was adapting and building resilience to the fire danger posed by climate change.\r\nThe firefighter one of the fe… [+2960 chars]"}]}