{"status": "ok", "totalResults": 5, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Minor league goalie misses NHL call-up after losing passport", "description": "Penguins minor league goalie missed a chance to join the team in Montreal.", "url": "https://abcnews.go.com/Sports/wireStory/minor-league-goalie-misses-nhl-call-losing-passport-68072291", "urlToImage": "null", "publishedAt": "2020-01-05T02:40:36Z", "content": "MONTREAL -- \r\nPittsburgh Penguins minor league goalie Casey DeSmith missed a chance to join the NHL team in Montreal on Saturday because he lost his passport.\r\nThe Penguins wanted to promote DeSmith from the AHL's Wilkes-Barre/Scranton for Saturday's game aga… [+683 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Abc News", "title": "Trump says 52 targets already lined up if Iran retaliates", "description": "Trump says 52 targets already lined up if Iran retaliates go.com", "url": "https://abcnews.go.com/Politics/wireStory/trump-52-targets-lined-iran-retaliates-68071780", "urlToImage": "https://s.abcnews.com/images/Politics/WireAP_ce73bf42d3804b3aab56f8a92bb20344_16x9_992.jpg", "publishedAt": "2020-01-05T01:58:29Z", "content": "WEST PALM BEACH, Fla. -- \r\nPresident Donald Trump issued a stark warning to Iran on Saturday, threatening to hit dozens of targets in the Islamic Republic very fast and very hard if it retaliates for the targeted killing of the head of Iran's elite Quds Force… [+3895 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JOHN CARUCCI Associated Press", "title": "McGowan and Arquette reflect as Weinstein trial approaches", "description": "Rose McGowan and Rosanna Arquette are among the more prominent women to accuse Harvey Weinstein of sexual misconduct", "url": "https://abcnews.go.com/US/wireStory/mcgowan-arquette-reflect-weinstein-trial-approaches-68072020", "urlToImage": "https://s.abcnews.com/images/Entertainment/WireAP_5a7afe18c52d4aaf9dca5b2ba4385e67_16x9_992.jpg", "publishedAt": "2020-01-05T01:29:19Z", "content": "NEW YORK -- \r\nRose McGowan doesn't plan be in the courtroom when Harvey Weinstein's criminal trial starts next week: One of Weinstein's most prominent accusers, McGowan says the trauma the fallen Hollywood mogul caused her is so great she couldn't bear the pa… [+4045 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JONATHAN LANDRUM Jr. AP Entertainment Writer", "title": "Bill O'Reilly guest spot on TV show not apart of Discovery", "description": "The Discovery Channel says a television show featuring Bill O’Reilly is not an official program on their network after receiving backlash for the former Fox News host's appearance on the show amid sexual harassment allegations against him", "url": "https://abcnews.go.com/Entertainment/wireStory/bill-oreilly-guest-spot-tv-show-discovery-68071778", "urlToImage": "null", "publishedAt": "2020-01-05T01:02:32Z", "content": "LOS ANGELES -- \r\nThe Discovery Channel says a television show featuring Bill OReilly is not an official program on their network after receiving backlash for the former Fox News host's appearance on the show amid sexual harassment allegations against him.\r\nA … [+971 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Cooler weather brings respite in Australian wildfire crisis", "description": "Milder temperatures are bringing hope of a respite from wildfires that have ravaged three Australian states, claiming 24 lives and destroying almost 2,000 homes", "url": "https://abcnews.go.com/International/wireStory/cooler-weather-brings-respite-australian-wildfire-crisis-68071672", "urlToImage": "https://s.abcnews.com/images/International/WireAP_fba94cf120c64e069af4bee067302ef8_16x9_992.jpg", "publishedAt": "2020-01-05T00:30:23Z", "content": "SYDNEY -- \r\nMilder temperatures Sunday brought hope of a respite from wildfires that have ravaged three Australian states, claiming 24 lives and destroying almost 2,000 homes.\r\nSaturday was a day of high tension as soaring temperatures and strong winds fanned… [+2984 chars]"}]}