{"status": "ok", "totalResults": 50, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "TERENCE CHEA and JULIET WILLIAMS Associated Press", "title": "Homeless women who took over California home gain support", "description": "Some California lawmakers say they support a group of homeless women who have been illegally living in a vacant three-bedroom house in Oakland since November", "url": "https://abcnews.go.com/Business/wireStory/homeless-women-california-home-gain-support-68127275", "urlToImage": "https://s.abcnews.com/images/Politics/WireAP_c0af236f3f7c481a8ed7359b9d6fe3fb_16x9_992.jpg", "publishedAt": "2020-01-07T21:16:04Z", "content": "OAKLAND, Calif. -- \r\nSome California lawmakers said they support a group of homeless women who have been illegally living in a vacant three-bedroom house since November, partly to protest real estate speculators who drive up housing costs in the pricey San Fr… [+3805 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Ben Gittleson", "title": "President Trump backs off threat to hit Iranian cultural sites", "description": "President Donald Trump on Tuesday backed off his threat to strike Iranian cultural sites, which would be war crime, amid elevated tensions with Iran.", "url": "https://abcnews.go.com/Politics/president-trump-wavers-threat-hit-iranian-cultural-sites/story?id=68123577", "urlToImage": "https://s.abcnews.com/images/Politics/trump-greets-wh-rt-ps-200107_hpMain_16x9_992.jpg", "publishedAt": "2020-01-07T21:14:18Z", "content": "WASHINGTON -- \r\nPresident Donald Trump on Tuesday backed off his threat to strike Iranian cultural sites, a war crime under international conventions, amid elevated tensions with Iran.\r\nAsked about his weekend warnings to Iran that the United States was consi… [+1543 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "The top 10 audiobooks on Audible.com", "description": "The top 10 audiobooks on Audible", "url": "https://abcnews.go.com/Entertainment/wireStory/top-10-audiobooks-audible-68127175", "urlToImage": "null", "publishedAt": "2020-01-07T21:13:45Z", "content": "Audible best-sellers for week ending January 3rd:\r\nFiction: \r\n1. Junkyard Cats by Faith Hunter, narrated by Khristine Hvam (Audible Original)\r\n2. Interview with the Robot by Lee Bacon, narrated by Kevin T. Collins, Ellen Archer, Josh Hurley, Eileen Stevens, E… [+2069 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "RACHEL LERMAN and JOSEPH PISANI AP Technology Writer", "title": "CES tech show: Say no to junk food; machines make cocktails", "description": "You can spend more time with guests at parties by letting machines make the cocktails", "url": "https://abcnews.go.com/Business/wireStory/ces-tech-show-junk-food-machines-make-cocktails-68127122", "urlToImage": "https://s.abcnews.com/images/Lifestyle/WireAP_aed649116a13455d9e96849b5fe2b7b2_16x9_992.jpg", "publishedAt": "2020-01-07T21:12:58Z", "content": "LAS VEGAS -- \r\nA wristband that will help you say no\" to junk food. A machine that will mix drinks for you. \r\nThese were among the gadgets showcased this week at the CES technology conference in Las Vegas. \r\nThe four-day show, which opened Tuesday, is a place… [+5613 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "DAVID SHARP Associated Press", "title": "Maine governor pardons tribal attorney for 1968 pot charge", "description": "Maine’s governor has issued a posthumous pardon for a tribal attorney convicted of possession of marijuana while asserting land claims by the Passamaquoddy tribe", "url": "https://abcnews.go.com/US/wireStory/maine-governor-pardons-tribal-attorney-1968-pot-charge-68126971", "urlToImage": "https://s.abcnews.com/images/US/WireAP_d79cc666231a4156be206d0bfbf4172c_16x9_992.jpg", "publishedAt": "2020-01-07T21:08:30Z", "content": "PORTLAND, Maine -- \r\nA tribal attorney arrested for possessing marijuana while fighting for Passamaquoddy tribe land rights in 1968 was granted a posthumous pardon on Tuesday.\r\nDemocratic Gov. Janet Mills had tears in her eyes after signing the pardon for the… [+2612 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Greek PM says IMF to close its Athens offices within months", "description": "Greece's prime minister says the International Monetary Fund will close its offices in Athens in coming months, about ten years after joining in a huge bailout program that kept the country afloat during its financial crisis", "url": "https://abcnews.go.com/International/wireStory/greek-pm-imf-close-athens-offices-months-68126860", "urlToImage": "null", "publishedAt": "2020-01-07T21:06:18Z", "content": "ATHENS, Greece -- \r\nThe International Monetary Fund will close its offices in Athens in coming months, a decade after it joined in a huge bailout program that kept Greece afloat, Greece's prime minister said Tuesday.\r\nKyriakos Mitsotakis said Greece would con… [+1184 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Karma Allen", "title": "High school evacuated after explosion on campus", "description": "A firework exploded in the school's cafeteria, causing at least one possible injury.", "url": "https://abcnews.go.com/US/houston-high-school-evacuated-explosion-campus/story?id=68126190", "urlToImage": "https://s.abcnews.com/images/General/Breaking-News-banner-abc-ps-181024_hpMain_16x9_992.jpg", "publishedAt": "2020-01-07T21:05:27Z", "content": "A Houston high school was evacuated on Tuesday due to an explosion on campus.\r\nStudents and administrators were ordered to leave Klein Forest High School at around 1 p.m. after a firework exploded in the school's cafeteria, causing at least one possible injur… [+800 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Kelsey Noland", "title": "Personalize Your 2020 Walt Disney World Marathon Weekend Merchandise at Disney Springs", "description": "It’s a new year which means it’s time for another runDisney race as we gear up for 2020 Walt Disney World Marathon Weekend presented by Cigna starting this week. No matter if this is your first marathon or your 15th, we’re so excited to welcome you and your f…", "url": "https://disneyparks.disney.go.com/blog/2020/01/personalize-your-2020-walt-disney-world-marathon-weekend-merchandise-at-disney-springs/", "urlToImage": "https://cdn1.parksmedia.wdprapps.disney.com/media/blog/wp-content/uploads/2020/01/kmh2039840294802.jpg", "publishedAt": "2020-01-07T21:03:06Z", "content": "Its a new year which means its time for another runDisney race as we gear up for 2020 Walt Disney World Marathon Weekend presented by Cigna starting this week. No matter if this is your first marathon or your 15th, were so excited to welcome you and your frie… [+1801 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Michael Ramirez", "title": "R2-D2 Now Gliding Around Star Wars: Galaxy’s Edge at Disneyland Park", "description": "If you are planning on visiting Star Wars: Galaxy’s Edge at Disneyland or Walt Disney World Resorts, you’ll encounter plenty characters from around the galaxy—from members of the First Order and the Resistance, to cosmic creatures and of course, droids!", "url": "https://disneyparks.disney.go.com/blog/2020/01/r2-d2-now-gliding-around-star-wars-galaxys-edge-at-disneyland-park/", "urlToImage": "https://cdn1.parksmedia.wdprapps.disney.com/media/blog/wp-content/uploads/2020/01/mmnvbcgftdre423.jpg", "publishedAt": "2020-01-07T21:03:04Z", "content": "If you are planning on visiting Star Wars: Galaxys Edge at Disneyland or Walt Disney World Resorts, youll encounter plenty of characters from around the galaxyfrom members of the First Order and the Resistance, to cosmic creatures and of course, droids!\r\nOn y… [+1806 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "PHILIP MARCELO Associated Press", "title": "Ex-'Bachelor' contestant's $1M fantasy sports win probed", "description": "Sports gambling giant DraftKings is reviewing a former \"Bachelor” contestant's $1 million win in an online fantasy football contest after she and her husband are accused of cheating", "url": "https://abcnews.go.com/Entertainment/wireStory/bachelor-contestants-1m-fantasy-sports-win-probed-68126681", "urlToImage": "null", "publishedAt": "2020-01-07T21:01:17Z", "content": "BOSTON -- \r\nSports gambling giant DraftKings is reviewing a former \"Bachelor contestant's $1 million win in an online fantasy football contest after she and her husband are accused of cheating.\r\nJade Roper-Tolbert, who appeared in The Bachelor and \"Bachelor i… [+2518 chars]"}]}