{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "Emily Amato", "title": "9/11 First Responder Overcomes Cancer To Conquer Walt Disney World Half Marathon", "description": "In 2018, Heather Yang was training to run her first half marathon when she was blindsided by a stage 3 colon cancer diagnosis. The diagnosis derailed Yang’s training and led to five months of chemotherapy – but none of that stopped her from running the Walt D…", "url": "https://disneyparks.disney.go.com/blog/2020/01/9-11-first-responder-overcomes-cancer-to-conquer-walt-disney-world-half-marathon/", "urlToImage": "https://cdn1.parksmedia.wdprapps.disney.com/media/blog/wp-content/uploads/2020/01/yuwtfgyebhw7391o3.png", "publishedAt": "2020-01-16T21:05:56Z", "content": "In 2018, Heather Yang was training to run her first half marathon when she was blindsided by a stage 3 colon cancer diagnosis. The diagnosis derailed Yangs training and led to five months of chemotherapy but none of that stopped her from running the Walt Disn… [+1205 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "MELANIE J. SIMS Associated Press", "title": "Like Miami, 'Bad Boys for Life' soundtrack is hot and fun", "description": "The“Bad Boys for Life” soundtrack plays its part, bringing high energy to the Miami-based movie that sees characters Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) back on-screen", "url": "https://abcnews.go.com/Entertainment/wireStory/miami-bad-boys-life-soundtrack-hot-fun-68335782", "urlToImage": "https://s.abcnews.com/images/Entertainment/WireAP_766cdcca84614520bc433b5b478b1de0_16x9_992.jpg", "publishedAt": "2020-01-16T21:05:06Z", "content": "Various artists, Bad Boys for Life Original Motion Picture Soundtrack\" (Epic/We the Best Music)\r\nSome soundtracks are as important to their movies as the actors delivering lines on-screen. But the Bad Boys for Life soundtrack is less of an unseen character, a… [+1493 chars]"}]}