{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Endangered brown bat may become DC's official 'state' mammal", "description": "A small, brown endangered bat would become the “official state mammal” of America's capital city, under a proposed ordinance that will get a public hearing in January", "url": "https://abcnews.go.com/US/wireStory/endangered-brown-bat-dcs-official-state-mammal-67980690", "urlToImage": "null", "publishedAt": "2019-12-30T12:32:33Z", "content": "WASHINGTON -- \r\nA small, brown endangered bat would become the official state mammal of America's capital city, under a proposed ordinance that will get a public hearing in January.\r\nThe idea was proposed earlier this year by several Girl Scout troops after t… [+1345 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Russia warns Iran nuclear deal in danger of 'falling apart'", "description": "Russian's foreign minister has warned that Iran's nuclear deal with world powers is in danger of “falling apart\" as neither the United States nor the European Union is complying with the accord", "url": "https://abcnews.go.com/Business/wireStory/russia-warns-iran-nuclear-deal-danger-falling-67980637", "urlToImage": "https://s.abcnews.com/images/Business/WireAP_4e3f41044bda4e48ae0b3e24a3101f9c_16x9_992.jpg", "publishedAt": "2019-12-30T12:32:03Z", "content": "MOSCOW -- \r\nIran's nuclear deal with world powers is in danger of falling apart\" without the compliance of the United States and the European Union, Russia's foreign minister warned Monday after meeting with his Iranian counterpart in Moscow.\r\nThe 2015 deal b… [+1383 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "LIZ WESTON NerdWallet", "title": "Liz Weston: When leasing a car is the more frugal option", "description": "Car buying has changed enough over the years — Americans are buying more expensive cars, financing larger amounts and taking out longer loans — that leasing may no longer be the costliest option to have a car of your own", "url": "https://abcnews.go.com/US/wireStory/liz-weston-leasing-car-frugal-option-67980094", "urlToImage": "null", "publishedAt": "2019-12-30T12:15:15Z", "content": "If you need a car, the most frugal option is to buy one thats 2 to 3 years old, pay cash and drive it until the wheels fall off.\r\nThe least frugal option traditionally has been leasing, where you make monthly payments to drive a car but dont own it. Youre pay… [+4331 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Michelle Stoddart", "title": "Outpouring of support follows Rep. John Lewis' cancer diagnosis", "description": "Outpouring of support follows Rep. John Lewis' cancer diagnosis go.com", "url": "https://abcnews.go.com/Politics/outpouring-support-rep-john-lewis-cancer-diagnosis/story?id=67979813", "urlToImage": "https://s.abcnews.com/images/Politics/john-lewis-obama-mo_hpMain_20191230-064109_16x9_992.jpg", "publishedAt": "2019-12-30T12:12:17Z", "content": "As soon as Rep. John Lewis announced on Sunday he is fighting stage 4 pancreatic cancer a massive outpouring of support followed.\r\nLewis, 79, who has served in the House of Representatives since 1987, said he plans to fight the disease as he's fought througho… [+1526 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "BUSABA SIVASOMBOON Associated Press", "title": "Thai official warns of water shortages due to weather, dams", "description": "A top water management official in Thailand says the country should brace for serious water shortages when the hot season begins in March, after a year with unusually little rainfall", "url": "https://abcnews.go.com/International/wireStory/thai-official-warns-water-shortages-due-weather-dams-67979976", "urlToImage": "null", "publishedAt": "2019-12-30T12:11:32Z", "content": "BANGKOK -- \r\nThailand should brace for serious water shortages when the hot season begins in March after a year with unusually little rainfall, one of the country's top water management officials said Monday.\r\nRetention of water by dams in upstream areas of t… [+4103 chars]"}]}