{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "JUAN A. LOZANO and MICHAEL GRACZYK Associated Press", "title": "Texas inmate faces execution for killing wife in 2005", "description": "A Texas inmate with a history of violence against women faces execution for fatally shooting his wife, who had feared she would never get out of her marriage alive", "url": "https://abcnews.go.com/US/wireStory/texas-inmate-faces-execution-killing-wife-2005-68291388", "urlToImage": "https://s.abcnews.com/images/US/WireAP_5250257f6dba4ce694c0a5dc477aa33e_16x9_992.jpg", "publishedAt": "2020-01-15T05:54:21Z", "content": "HOUSTON -- \r\nA Texas inmate with a history of violence against women is set to be executed Wednesday evening for fatally shooting his wife, who had feared she would never get out of her marriage alive. \r\nJohn Gardner, 64, is facing lethal injection for the Ja… [+3717 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Kendall Karson, Molly Nagle, Cheyenne Haslett", "title": "5 takeaways from the last Democratic debate before the Iowa caucuses", "description": "Six Democrats clashed on the smallest debate stage yet in Iowa, only 20 days before caucusgoers across the Hawkeye state are set to cast the first votes of the primary.", "url": "https://abcnews.go.com/Politics/takeaways-democratic-debate-iowa-caucuses/story?id=68266837", "urlToImage": "https://s.abcnews.com/images/Politics/democratic-debate-iowa-cnn-14-ap-jc-200114_hpMain_16x9_992.jpg", "publishedAt": "2020-01-15T05:16:26Z", "content": "Six Democrats clashed on the smallest debate stage yet in Iowa, only 20 days before caucusgoers across the Hawkeye state are set to cast the first votes of the primary, bringing a heightened sense of urgency to the matchup Tuesday night.\r\nAmid visible fissure… [+8171 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "SCOTT SMITH Associated Press", "title": "AP Explains: Fight for Venezuela's National Assembly deepens", "description": "Venezuela's political landscape has recently taken a turn from messy to downright chaotic", "url": "https://abcnews.go.com/International/wireStory/ap-explains-fight-venezuelas-national-assembly-deepens-68290619", "urlToImage": "https://s.abcnews.com/images/International/WireAP_e607fd8055d24915a57a3d9f8a7680ca_16x9_992.jpg", "publishedAt": "2020-01-15T05:08:28Z", "content": "CARACAS, Venezuela -- \r\nWith two men claiming the presidency for nearly a year, Venezuela's political landscape has been messy for a while now. But it is set to become flat out chaotic, with confusion over who is in charge of the National Assembly and plans f… [+5424 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "CHRISTOPHER SHERMAN Associated Press", "title": "AP Explains: US sending asylum seekers to Central America", "description": "The U.S. government plans to begin sending Mexican asylum seekers to Guatemala and has finalized steps with Honduras to begin sending asylum seekers from other countries there", "url": "https://abcnews.go.com/International/wireStory/ap-explains-us-sending-asylum-seekers-central-america-68290284", "urlToImage": "https://s.abcnews.com/images/International/WireAP_d50a7d1e25304f5583561cead0d55339_16x9_992.jpg", "publishedAt": "2020-01-15T05:01:31Z", "content": "MEXICO CITY -- \r\nThe United States began sending Honduran and Salvadoran asylum seekers to Guatemala in November and last week said it would expand the practice to Mexicans. The U.S. could also start sending asylum seekers from Mexico, El Salvador, Nicaragua,… [+4722 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "4h person pleads guilty in $1B California energy scam", "description": "An executive of a San Francisco Bay Area solar energy company has pleaded guilty to participating in what federal prosecutors said was a massive Ponzi scheme scheme that defrauded investors of $1 billion", "url": "https://abcnews.go.com/US/wireStory/4h-person-pleads-guilty-1b-california-energy-scam-68290027", "urlToImage": "null", "publishedAt": "2020-01-15T04:51:02Z", "content": "SACRAMENTO, Calif. -- \r\nAn executive of a San Francisco Bay Area solar energy company pleaded guilty Tuesday to participating in what federal prosecutors said was a massive Ponzi scheme scheme that defrauded investors of $1 billion.\r\nRyan Guidry, 43, of Pleas… [+2191 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JENNIFER SINCO KELLEHER Associated Press", "title": "Marine sentenced to 3 years for illegal firearms", "description": "A Marine stationed in Hawaii has pleaded guilty to possessing unlawful firearms. Ali Al-kazahg was accused of trying to bring weapons onto an Air Force base while home in Nebraska", "url": "https://abcnews.go.com/US/wireStory/marine-sentenced-years-illegal-firearms-68288651", "urlToImage": "null", "publishedAt": "2020-01-15T04:02:17Z", "content": "HONOLULU -- \r\nA Marine stationed in Hawaii pleaded guilty to possession unlawful firearms during a military court hearing Tuesday for allegations he tried to bring weapons onto an Air Force base while home in Nebraska.\r\nAli Al-kazahg's sentence includes a bad… [+2162 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "ROD McGUIRK Associated Press", "title": "Australian wildfire smoke stokes health fears in cities", "description": "Fire alarms have been sounding in high-rise buildings across downtown Sydney and Melbourne as dense smoke from distant wildfires confuse electronic sensors", "url": "https://abcnews.go.com/Technology/wireStory/australian-wildfire-smoke-stokes-health-fears-cities-68288524", "urlToImage": "https://s.abcnews.com/images/Technology/WireAP_772d17920b8342b394a4048fd60907a2_16x9_992.jpg", "publishedAt": "2020-01-15T03:56:08Z", "content": "CANBERRA, Australia -- \r\nFire alarms have been sounding in high-rise buildings across downtown Sydney and Melbourne as dense smoke from distant wildfires confuse electronic sensors. Modern government office blocks in the Australian capital Canberra have been … [+6743 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Kaitlyn Folmer, Alex Stone, Josh Margolin, Stacy Chen", "title": "Michael Avenatti arrested at courthouse during hearing", "description": "Michael Avenatti shot to fame representing Stormy Daniels.", "url": "https://abcnews.go.com/US/michael-avenatti-arrested-los-angeles-courthouse-state-bar/story?id=68286995", "urlToImage": "https://s.abcnews.com/images/US/michael-avenatti-mo_hpMain_20200114-221140_16x9_992.jpg", "publishedAt": "2020-01-15T03:49:42Z", "content": "Attorney Michael Avenatti was abruptly taken into federal custody in Los Angeles Tuesday evening, following a day-long disciplinary hearing in which the California State Bar is asking a judge to prevent Avenatti from practicing law based upon their belief he … [+2841 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "China says Taiwan policy intact despite election results", "description": "China says it will not change its policy of annexing Taiwan through its \"one country, two systems\" framework, despite the heavy turnout in favor of pro-independence candidates in last weekend's presidential and legislative elections", "url": "https://abcnews.go.com/International/wireStory/china-taiwan-policy-intact-election-results-68288224", "urlToImage": "https://s.abcnews.com/images/International/WireAP_c08c5a6e25b0487dad57ca4be271d4a0_16x9_992.jpg", "publishedAt": "2020-01-15T03:44:05Z", "content": "BEIJING -- \r\nA Chinese official said Wednesday that Beijing will not change its policy of annexing Taiwan through its one country, two systems\" framework, despite the heavy turnout in favor of pro-independence candidates in last weekend's presidential and leg… [+1211 chars]"}]}