{"status": "ok", "totalResults": 23, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "Conor Finnegan", "title": "What's behind the latest European bid to save the Iran nuclear deal", "description": "While the European powers hope they have found an avenue to fix the Iran nuclear deal, it may actually spell its end.", "url": "https://abcnews.go.com/Politics/latest-european-bid-save-iran-nuclear-deal-end/story?id=68274525", "urlToImage": "https://s.abcnews.com/images/Politics/iran-nuclear-program-file-gty-jef-200114_hpMain_16x9_992.jpg", "publishedAt": "2020-01-15T00:20:44Z", "content": "While the European powers hope they have found an avenue to fix the Iran nuclear deal, it may actually spell its end.\r\nFrance, Germany and the United Kingdom filed a formal complaint within the nuclear agreement on Tuesday to force its remaining parties to co… [+7218 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Meat Leaf sues hotel, blaming negligence for disabling fall", "description": "Meat Loaf has filed a lawsuit against a hotel at Dallas-Fort Worth International Airport and organizers of a horror convention held there, blaming them for negligence when he fell from a stage while answering questions from convention goers last May", "url": "https://abcnews.go.com/Entertainment/wireStory/meat-leaf-sues-hotel-blaming-negligence-disabling-fall-68282737", "urlToImage": "null", "publishedAt": "2020-01-15T00:20:02Z", "content": "FORT WORTH, Texas -- \r\nMeat Loaf has filed a lawsuit against a hotel at Dallas-Fort Worth International Airport and organizers of a horror convention held there, blaming them for negligence when he fell from a stage while answering questions from convention g… [+1011 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "TOM KRISHER AP Auto Writer", "title": "Trump administration signals compromise on gas mileage rules", "description": "The Trump administration is signaling that it could increase fuel economy standards, possibly compromising from its push to freeze them at 2020 levels", "url": "https://abcnews.go.com/Business/wireStory/trump-administration-signals-compromise-gas-mileage-rules-68282736", "urlToImage": "null", "publishedAt": "2020-01-15T00:15:17Z", "content": "DETROIT -- \r\nThe Trump administration is signaling that it could increase fuel economy standards, possibly compromising on its push to freeze them at 2020 levels.\r\nIn one of the administration's hardest-fought battles to roll back Obama-era environmental regu… [+735 chars]"}]}