{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Ex-North Carolina trooper pleads guilty in arrest beating", "description": "A former North Carolina Highway Patrol trooper accused of involvement in a 2018 beating and K9 attack on a homeless man has been convicted of misdemeanor charges in the case", "url": "https://abcnews.go.com/US/wireStory/north-carolina-trooper-pleads-guilty-arrest-beating-68252406", "urlToImage": "null", "publishedAt": "2020-01-13T19:12:32Z", "content": "RALEIGH, N.C. -- \r\nA former North Carolina State Highway Patrol trooper accused of involvement in a 2018 beating and K9 attack on a homeless man has been convicted of misdemeanor charges in the case.\r\nMichael Blake pleaded guilty to two counts of willful fail… [+1727 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JAKE BLEIBERG and STEFANIE DAZIO Associated Press", "title": "Design of AR-15 could derail charges tied to popular rifle", "description": "A subtle design feature of the AR-15 rifle has raised a technical legal question that is derailing criminal cases tied to one of America's most popular weapons", "url": "https://abcnews.go.com/US/wireStory/design-ar-15-derail-charges-tied-popular-rifle-68252403", "urlToImage": "https://s.abcnews.com/images/US/WireAP_477c5ed8dc084c35beb3c91e78568ab2_16x9_992.jpg", "publishedAt": "2020-01-13T19:09:58Z", "content": "DALLAS -- \r\nA subtle design feature of the AR-15 rifle has raised a technical legal question that is derailing cases against people who are charged with illegally buying and selling the gun's parts or building the weapon.\r\nAt issue is whether a key piece of o… [+7103 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Catherine Thorbecke", "title": "Lonely billionaire seeks 'female partner to go to the moon with him'", "description": "Japanese billionaire Yusaku Maezawa is holding another contest of sorts on Twitter, this time he is hoping to find his \"life partner\" who will accompany him on his upcomi", "url": "https://abcnews.go.com/Business/lonely-japanese-billionaire-seeks-female-partner-moon/story?id=68245273", "urlToImage": "https://s.abcnews.com/images/Business/yusaku-maezawa-file-ap-ml-200110_hpMain_16x9_992.jpg", "publishedAt": "2020-01-13T19:09:26Z", "content": "A lonely Japanese billionaire is seeking a \"life partner\" who can accompany him on his upcoming trip to the moon.\r\nYusaku Maezawa, the eccentric head of an online fashion empire with a net worth of approximately $2 billion, according to Forbes, famously paid … [+1333 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Arizona store gives 'Star Wars' record back to Mark Hamill", "description": "The force was strong enough at an Arizona store to reunite Luke Skywalker with his long-lost vinyl record", "url": "https://abcnews.go.com/Entertainment/wireStory/arizona-store-star-wars-record-back-mark-hamill-68252220", "urlToImage": "null", "publishedAt": "2020-01-13T19:05:32Z", "content": "FLAGSTAFF, Ariz. -- \r\nThe force was strong enough at an Arizona store to reunite Luke Skywalker with his long-lost vinyl record.\r\nActor Mark Hamill is praising workers at Bookmans Entertainment Exchange in Flagstaff for returning the Star Wars: A New Hope sou… [+1108 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JAKE COYLE AP Film Writer", "title": "‘Joker’ leads Oscar noms; ‘1917,’ ‘Irishman’ close behind", "description": "Female filmmakers have been shut out, “Parasite” has made history and “Joker” has edged out all other films in this year's Academy Awards nominations", "url": "https://abcnews.go.com/Entertainment/wireStory/joker-leads-oscar-noms-1917-irishman-close-68251916", "urlToImage": "https://s.abcnews.com/images/Entertainment/WireAP_63ed774394c04bce9a39c062cf314740_16x9_992.jpg", "publishedAt": "2020-01-13T18:55:49Z", "content": "Female filmmakers were shut out, Parasite made history and Joker edged out The Irishman,\" 1917 and Once Upon a Time ... in Hollywood in Monday's Oscar nominations.\r\nTodd Phillips R-rated superhero smash Joker topped all films with 11 nominations to the 92nd A… [+9196 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "MAURICIO SAVARESE Associated Press", "title": "Brazil documentary gets Oscar nomination, exposes division", "description": "The Academy Award nomination for a documentary about the impeachment of then-President Dilma Rousseff has once again laid bare the polarization of Latin America's largest democracy", "url": "https://abcnews.go.com/Entertainment/wireStory/brazil-documentary-oscar-nomination-exposes-division-68251484", "urlToImage": "https://s.abcnews.com/images/Entertainment/WireAP_cd7e7ad04a5d4264b004bef8132f46d7_16x9_992.jpg", "publishedAt": "2020-01-13T18:49:55Z", "content": "SAO PAULO -- \r\nThe Academy Award nomination for a Brazilian documentary about the impeachment of then-President Dilma Rousseff has once again laid bare the polarization of Latin America's largest democracy.\r\nIn The Edge of Democracy,\" 36-year-old filmmaker Pe… [+1679 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Judge: Hanukkah attack suspect may need death-penalty lawyer", "description": "A judge says a man charged in a bloody attack on a Hanukkah celebration may need attorneys specializing in death penalty cases if a stabbing victim dies", "url": "https://abcnews.go.com/US/wireStory/judge-hanukkah-attack-suspect-death-penalty-lawyer-68251593", "urlToImage": "null", "publishedAt": "2020-01-13T18:48:47Z", "content": "WHITE PLAINS, N.Y. -- \r\nA man charged in a bloody attack at a Hanukkah celebration may need attorneys specializing in death penalty cases if a stabbing victim dies, a judge said Monday.\r\nU.S. District Judge Cathy Seibel raised the subject during a court heari… [+2309 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Julia Jacobo", "title": "Teens charged after 2-year-old seen vaping on social media", "description": "Pennsylvania police are investigating a video that appears to show a 2-year-old boy inhaling from a vaping device while under the care of two teenagers.", "url": "https://abcnews.go.com/US/year-vaping-social-media-teenagers-charged/story?id=68245175", "urlToImage": "https://s.abcnews.com/images/US/electronic-cigarette-rf-gty-jc-200113_hpMain_16x9_992.jpg", "publishedAt": "2020-01-13T18:42:16Z", "content": "Pennsylvania police are investigating a video that appears to show a 2-year-old boy using a vaping device while under the care of two teenagers.\r\nVideo obtained by ABC Pittsburgh affiliate WTAE appears to show the boy coughing after he inhales from the device… [+1016 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "MIKE SCHNEIDER Associated Press", "title": "NAACP lawsuit claims Census Bureau is unprepared for count", "description": "The NAACP is suing the U.S. Census Bureau, demanding that the agency send more workers into the field and spend more money on encouraging people to participate in the once-a-decade head count", "url": "https://abcnews.go.com/US/wireStory/naacp-lawsuit-claims-census-bureau-unprepared-count-68251251", "urlToImage": "null", "publishedAt": "2020-01-13T18:42:02Z", "content": "ORLANDO, Fla. -- \r\nCalling preparations for the 2020 Census conspicuously deficient, the NAACP is suing the U.S. Census Bureau, demanding that the agency send more workers into the field and spend more money on encouraging people to participate in the once-a-… [+1941 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Alexander Mallin, Luke Barr, Elizabeth McLaughlin", "title": "US to expel more than 20 Saudi trainees amid probe of Pensacola shooter", "description": "The U.S. will announce Monday that more than 20 Saudi military trainees will be expelled from the country amid an investigation of the Pensacola shooting last month.", "url": "https://abcnews.go.com/Politics/us-announce-expulsion-20-saudi-trainees-amid-probe/story?id=68247439", "urlToImage": "https://s.abcnews.com/images/US/pensacola-1-ht-er-191208_hpMain_16x9_992.jpg", "publishedAt": "2020-01-13T18:40:33Z", "content": "More than 20 Saudi students are expected to be expelled from the U.S. amid an ongoing investigation into the Saudi military officer who killed three sailors and wounded eight others at the Naval Air Station in Pensacola last month, an administration official … [+3876 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Gene-editing tool's pioneers win Israel's Wolf Prize", "description": "Two global pioneers of modern gene-editing technology have been awarded Israel's prestigious Wolf Prize in medicine", "url": "https://abcnews.go.com/International/wireStory/gene-editing-tools-pioneers-win-israels-wolf-prize-68251170", "urlToImage": "null", "publishedAt": "2020-01-13T18:30:17Z", "content": "JERUSALEM -- \r\nTwo global pioneers of modern gene-editing technology were awarded Monday Israel's prestigious Wolf Prize in medicine.\r\nThe Wolf Foundation said it was recognizing Jennifer Doudna and Emmanuelle Charpentier for their work in developing the gene… [+1622 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Aaron Katersky, Julia Jacobo", "title": "Hanukkah stabbing suspect pleads not guilty to federal hate crime charges", "description": "The man charged with federal hate crimes for allegedly stabbing six people during a Hanukkah celebration in New York has pleaded not guilty.", "url": "https://abcnews.go.com/US/hanukkah-stabbing-suspect-pleads-guilty-federal-hate-crime/story?id=68245176", "urlToImage": "https://s.abcnews.com/images/US/deli-01-as-ap-191214_hpMain_16x9_992.jpg", "publishedAt": "2020-01-13T18:25:08Z", "content": "The man charged with federal hate crimes for allegedly stabbing six people during a Hanukkah celebration has pleaded not guilty.\r\nGrafton Thomas, 37, appeared in federal court in White Plains, New York, Monday morning, days after he was indicted on 10 counts … [+2026 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Soo Rin Kim", "title": "House investigators given contents of Giuliani associate's cell phones: Lawyer", "description": "Lev Parnas, Rudy Giuliani's associate embroiled in the impeachment inquiry against President Donald Trump, has submitted contents of his cell phones to House Intelligence", "url": "https://abcnews.go.com/Politics/house-investigators-contents-giuliani-associates-cell-phones-lawyer/story?id=68247740", "urlToImage": "https://s.abcnews.com/images/Politics/lev-parnas-rt-ps-200103_hpMain_16x9_992.jpg", "publishedAt": "2020-01-13T18:20:50Z", "content": "Lev Parnas, one of Rudy Giuliani's Soviet-born associates embroiled in the impeachment inquiry against President Donald Trump, has submitted the contents of his cell phones to the House Intelligence Committee, according to his lawyer.\r\nParnas' attorney Joseph… [+3186 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "BRIAN MELLEY Associated Press", "title": "Family of dead crew member sue California dive boat operator", "description": "The family of the lone crew member who died with 33 passengers in a fire aboard a scuba diving boat off the coast of Southern California has sued the owners of the vessel", "url": "https://abcnews.go.com/US/wireStory/family-dead-crew-member-sue-california-dive-boat-68250771", "urlToImage": "null", "publishedAt": "2020-01-13T18:18:02Z", "content": "LOS ANGELES -- \r\nThe family of the lone crew member to die in a fiery scuba boat disaster that killed all 33 passengers off the Southern California coast last year sued the vessel's owner Monday in federal court. \r\nThe lawsuit by the family of Allie Kurtz cla… [+1787 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "Erin Schumaker", "title": "First case of new mystery virus identified outside of China", "description": "A case of the mysterious new coronavirus strain was identified in a Chinese tourist in Thailand, marking the first such infection outside of China.", "url": "https://abcnews.go.com/Health/case-mystery-virus-identified-china/story?id=68245274", "urlToImage": "https://s.abcnews.com/images/Health/coronavirus-hong-kong-ap-jt-200113_hpMain_16x9_992.jpg", "publishedAt": "2020-01-13T18:14:45Z", "content": "A case of the mysterious new coronavirus strain was identified in Thailand, health officials said Monday, marking the first such known infection outside of China.\r\nThe patient, a tourist from Wuhan, China, was hospitalized in Thailand on Jan. 8, according to … [+2372 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Greece orders anti-abortion ads removed from Athens metro", "description": "Greece's center-right government has ordered the removal of anti-abortion posters put up in Athens underground billboards as part of a paid public awareness campaign by a pro-life group", "url": "https://abcnews.go.com/International/wireStory/greece-orders-anti-abortion-ads-removed-athens-metro-68250674", "urlToImage": "null", "publishedAt": "2020-01-13T18:13:17Z", "content": "ATHENS, Greece -- \r\nGreece's center-right government ordered the removal of anti-abortion posters put up Monday in Athens underground billboards under a paid public awareness campaign by a pro-life group.\r\nA transport ministry statement said the posters, whic… [+1016 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "GILLIAN FLACCUS Associated Press", "title": "High anxiety: Proposed US hemp rules worry industry", "description": "Hemp growers and entrepreneurs rejoiced a year ago when U.S. lawmakers reclassified the plant as a legal agricultural crop", "url": "https://abcnews.go.com/Technology/wireStory/high-anxiety-proposed-us-hemp-rules-worry-industry-68250605", "urlToImage": "https://s.abcnews.com/images/Health/WireAP_63d05a10814c48ddbf319a2d4c198329_16x9_992.jpg", "publishedAt": "2020-01-13T18:06:18Z", "content": "PORTLAND, Ore. -- \r\nHemp growers and entrepreneurs who were joyous a year ago after U.S. lawmakers reclassified the plant as a legal agricultural crop now are worried their businesses could be crippled if federal policymakers move ahead with draft regulations… [+6328 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Israel's lawmakers deliver setback for Netanyahu immunity", "description": "A Israeli parliamentary committee has voted to form a panel to consider Prime Minister Benjamin Netanyahu's request for immunity from prosecution", "url": "https://abcnews.go.com/International/wireStory/israels-lawmakers-deliver-setback-netanyahu-immunity-68250604", "urlToImage": "https://s.abcnews.com/images/International/WireAP_c740f9e85ab34130b66890e60c274f46_16x9_992.jpg", "publishedAt": "2020-01-13T18:04:06Z", "content": "JERUSALEM -- \r\nIsraeli lawmakers on Monday approved the formation of a committee to consider Prime Minister Benjamin Netanyahu's request for legal immunity, a major setback for the embattled leader who is seeking to fend off corruption charges.\r\nNetanyahu was… [+1907 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "JILL LAWLESS Associated Press", "title": "5 contenders vie to lead UK Labour back from election defeat", "description": "Britain’s opposition Labour Party says five lawmakers will contend to lead the party as it tries to rebuild support and regain power after last month's electoral drubbing", "url": "https://abcnews.go.com/International/wireStory/contenders-vie-lead-uk-labour-back-election-defeat-68250569", "urlToImage": "https://s.abcnews.com/images/International/WireAP_9a16db4ed47b4e02ae0731625a96a24d_16x9_992.jpg", "publishedAt": "2020-01-13T18:00:56Z", "content": "LONDON -- \r\nBritains opposition Labour Party said Monday that five lawmakers will contend to lead the party as it tries to rebuild support and regain power after last month's electoral drubbing.\r\nLabour is choosing a new leader to replace Jeremy Corbyn, who i… [+2175 chars]"}]}