{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": "abc-news", "name": "ABC News"}, "author": "LINDSAY WHITEHURST Associated Press", "title": "Forest ecologist helps refashion Barbie dolls as scientists", "description": "After her daughter asked for a Barbie, University of Utah forest ecologist Nalini Nadkarni decided to re-fashion the iconic dolls as a scientist-explorer in rubber boots rather than high heels", "url": "https://abcnews.go.com/Business/wireStory/forest-ecologist-helps-refashion-barbie-dolls-scientists-67983328", "urlToImage": "https://s.abcnews.com/images/Lifestyle/WireAP_4c2964dedc2a4a76a9a6f1cbf2bcb525_16x9_992.jpg", "publishedAt": "2019-12-30T15:31:44Z", "content": "SALT LAKE CITY -- \r\nWhen Nalini Nadkarni was a kid, shed run home from school, climb into one of the eight maple trees in her parents backyard and spend an afternoon there with an apple and a book. \r\nThat time in the treetops set the tone for the rest of her … [+3337 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Nicaragua frees some protesters, including Belgian", "description": "Several activists arrested in Nicaragua in November for taking water to protesters have been freed, including a Belgian dual-national woman", "url": "https://abcnews.go.com/International/wireStory/nicaragua-frees-protesters-including-belgian-67983451", "urlToImage": "null", "publishedAt": "2019-12-30T15:31:00Z", "content": "MEXICO CITY -- \r\nSeveral activists arrested in Nicaragua in November for taking water to protesters were freed Monday, including a Belgian dual-national. \r\nRelatives and business leaders confirmed the release of several of the activists, and other confirmed t… [+732 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "Paris bakery blast caused by gas pipe break, probe shows", "description": "French investigators have found evidence that a deadly explosion at a Paris bakery almost a year ago was caused by a gas pipe break", "url": "https://abcnews.go.com/International/wireStory/paris-bakery-blast-caused-gas-pipe-break-probe-67983326", "urlToImage": "null", "publishedAt": "2019-12-30T15:25:30Z", "content": "PARIS -- \r\nFrench investigators have confirmed that a powerful explosion at a bakery in Paris that killed four people and injured dozens almost a year ago was caused by a gas pipe break, authorities said Monday. \r\nThe Jan. 12, 2019 blast devastated a street i… [+594 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "The Associated Press", "title": "South Carolina to rent out former Turner family beach house", "description": "Guests will soon be able to rent a beach house that once belonged to billionaire Ted Turner's family on a private South Carolina island", "url": "https://abcnews.go.com/US/wireStory/south-carolina-rent-turner-family-beach-house-67983097", "urlToImage": "null", "publishedAt": "2019-12-30T15:09:21Z", "content": "ST. PHILLIPS ISLAND, S.C. -- \r\nGuests will soon be able to rent a beach house that once belonged to billionaire Ted Turner's family on a private South Carolina island, state officials say.\r\nSouth Carolina State Parks is finishing rehabilitation work on the pr… [+1028 chars]"}, {"source": {"id": "abc-news", "name": "ABC News"}, "author": "MATT OTT AP Business Writer", "title": "Pending homes sales rebound in November", "description": "Americans signed more contracts to purchase homes in November, indicating that the housing market is still strong", "url": "https://abcnews.go.com/Business/wireStory/pending-homes-sales-rebound-november-67983071", "urlToImage": "null", "publishedAt": "2019-12-30T15:06:17Z", "content": "WASHINGTON -- \r\nAmericans signed more contracts to purchase homes in November, bouncing back from last month's decline, indicating that the housing market is still strong.\r\nThe National Association of Realtors said Monday that its pending home sales index, wh… [+679 chars]"}]}